{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20220104/code/DELP/log CovidVisualizedGlobal DELP.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 5 Jan 2022, 16:58:32
{txt}
{com}. 
. ***************************************************************************
. * This is "do CovidVisualizedGlobal DELP.do"
. 
. * Project: Combine and visualize international periodically updating 
. * estimates of COVID-19 at the global level (CovidVisualizedGlobal)
. * Person: Farshad Pourmalek pourmalek_farshad at yahoo dot com
. * Time (initial): 2021-04-14
. ***************************************************************************
. 
. 
.                                                                                                          ***************************
. * To change update date, find and replace all, 20220104 (old), with 20220104 (new) <<--           <<<--- * change update date here *
.                                                                                                          ***************************
. 
. 
. clear
{txt}
{com}. 
. copy https://raw.githubusercontent.com/COVIDAnalytics/website/master/data/predicted/Global_V4_since100_20220104.csv Global_V4_since100_20220104.csv
{txt}
{com}. 
. import delimited using "Global_V4_since100_20220104.csv", clear varnames(1)
{res}{text}(16 vars, 40,080 obs)

{com}. 
. rename country loc_grand_name
{res}{txt}
{com}. 
. save "DELP.dta", replace
{txt}file DELP.dta saved

{com}. 
. 
. 
. 
. 
. 
. *****************************
. 
. * gen global sum
. 
. use "DELP.dta", clear
{txt}
{com}. 
. keep if continent == "None"
{txt}(39,913 observations deleted)

{com}. 
. drop continent province loc_grand_name
{txt}
{com}. 
. collapse (sum) totaldetected-totaldetecteddeathsub, by(day)
{txt}
{com}. 
. gen loc_grand_name = " GLOBAL"
{txt}
{com}. 
. 
. rename day date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22553{txt},{res}22719{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}30sep2021{txt},{res}15mar2022{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}167{col 51}{txt}missing .:  {res}0{txt}/{res}167

{txt}{col 19}mean:{res}{col 26}   22636{txt} = {res}22dec2021{txt}
{col 15}std. dev:{res}{col 26} 48.3529

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   22569{col 37}   22594{col 47}   22636{col 57}   22678{col 67}   22703
{col 26}16oct2021{col 36}10nov2021{col 46}22dec2021{col 56}02feb2022{col 66}27feb2022
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. 
. * rename outcome variables
. 
. 
. * total vars
. 
. rename totaldetecteddeaths   TotDeaMeRaA01S00
{res}{txt}
{com}. rename totaldetecteddeathslb TotDeaLoRaA01S00
{res}{txt}
{com}. rename totaldetecteddeathsub TotDeaUpRaA01S00
{res}{txt}
{com}. 
. label var TotDeaMeRaA01S00 "Total Deaths Mean DELP S0"
{txt}
{com}. label var TotDeaMeRaA01S00 "Total Deaths Lower DELP S0"
{txt}
{com}. label var TotDeaMeRaA01S00 "Total Deaths Upper DELP S0"
{txt}
{com}. 
. rename totaldetected   TotCasMeRaA01S00
{res}{txt}
{com}. rename totaldetectedlb TotCasLoRaA01S00
{res}{txt}
{com}. rename totaldetectedub TotCasUpRaA01S00
{res}{txt}
{com}. 
. label var TotCasMeRaA01S00 "Total Cases Mean DELP S0"
{txt}
{com}. label var TotCasMeRaA01S00 "Total Cases Lower DELP S0"
{txt}
{com}. label var TotCasMeRaA01S00 "Total Cases Upper DELP S0"
{txt}
{com}. 
. 
. * gen daily vars and rename
. 
. sort date
{txt}
{com}. 
. gen DayDeaMeRaA01S00 =  TotDeaMeRaA01S00[_n] - TotDeaMeRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. gen DayDeaLoRaA01S00 =  TotDeaLoRaA01S00[_n] - TotDeaLoRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. gen DayDeaUpRaA01S00 =  TotDeaUpRaA01S00[_n] - TotDeaUpRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. gen DayCasMeRaA01S00 =  TotCasMeRaA01S00[_n] - TotCasMeRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. gen DayCasLoRaA01S00 =  TotCasLoRaA01S00[_n] - TotCasLoRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. gen DayCasUpRaA01S00 =  TotCasUpRaA01S00[_n] - TotCasUpRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. 
. label var DayDeaMeRaA01S00 "Daily Deaths Mean DELP S0"
{txt}
{com}. label var DayDeaLoRaA01S00 "Daily Deaths Lower DELP S0"
{txt}
{com}. label var DayDeaUpRaA01S00 "Daily Deaths Upper DELP S0"
{txt}
{com}. 
. label var DayCasMeRaA01S00 "Daily Cases Mean DELP S0"
{txt}
{com}. label var DayCasLoRaA01S00 "Daily Cases Lower DELP S0"
{txt}
{com}. label var DayCasUpRaA01S00 "Daily Cases Upper DELP S0"
{txt}
{com}. 
. label var TotDeaMeRaA01S00 "Total Deaths Mean DELP S0"
{txt}
{com}. label var TotDeaLoRaA01S00 "Total Deaths Lower DELP S0"
{txt}
{com}. label var TotDeaUpRaA01S00 "Total Deaths Upper DELP S0"
{txt}
{com}. 
. label var TotCasMeRaA01S00 "Total Cases Mean DELP S0"
{txt}
{com}. label var TotCasLoRaA01S00 "Total Cases Lower DELP S0"
{txt}
{com}. label var TotCasUpRaA01S00 "Total Cases Upper DELP S0"
{txt}
{com}. 
. 
. * 
. 
. * other outcomes
. 
. * active activehospitalized activeventilated cumulativehospitalized
. 
. /*
> ***********************
> * rename convention
> 
> active                                  Act
> 
> activehospitalized              Hos
> 
> activeventilated                Ven
> 
> cumulativehospitalized  Hos
> 
> */
. 
. 
. rename active DayActMeRaA01S00
{res}{txt}
{com}. 
. rename activehospitalized DayHosMeRaA01S00
{res}{txt}
{com}. 
. rename activeventilated DayVenMeRaA01S00
{res}{txt}
{com}. 
. rename cumulativehospitalized TotHosMeRaA01S00
{res}{txt}
{com}. 
. label var DayActMeRaA01S00 "Daily Cases Active Mean DELP S0"
{txt}
{com}. 
. label var DayHosMeRaA01S00 "Daily Cases Active Hospitalized Mean DELP S0"
{txt}
{com}. 
. label var DayVenMeRaA01S00 "Daily Cases Active Ventilated Mean DELP S0"
{txt}
{com}. 
. label var TotHosMeRaA01S00 "Total Cases Active Mean DELP S0"
{txt}
{com}. 
.  
. 
. keep ///
> loc_grand_name date ///
> TotDeaMeRaA01S00 TotDeaLoRaA01S00 TotDeaUpRaA01S00 ///
> DayDeaMeRaA01S00 DayDeaLoRaA01S00 DayDeaUpRaA01S00 ///
> TotCasMeRaA01S00 TotCasLoRaA01S00 TotCasUpRaA01S00 ///
> DayCasMeRaA01S00 DayCasLoRaA01S00 DayCasUpRaA01S00 ///
> DayActMeRaA01S00 DayHosMeRaA01S00 DayVenMeRaA01S00 TotHosMeRaA01S00
{txt}
{com}. 
. 
. order ///
> loc_grand_name date ///
> TotDeaMeRaA01S00 TotDeaLoRaA01S00 TotDeaUpRaA01S00 ///
> DayDeaMeRaA01S00 DayDeaLoRaA01S00 DayDeaUpRaA01S00 ///
> TotCasMeRaA01S00 TotCasLoRaA01S00 TotCasUpRaA01S00 ///
> DayCasMeRaA01S00 DayCasLoRaA01S00 DayCasUpRaA01S00 ///
> DayActMeRaA01S00 DayHosMeRaA01S00 DayVenMeRaA01S00 TotHosMeRaA01S00
{txt}
{com}. 
. 
. 
. * gen cfr
. 
. gen DayCfrMeRaA01S00 = 100 * DayDeaMeRaA01S00 / DayCasMeRaA01S00
{txt}(1 missing value generated)

{com}. gen DayCfrLoRaA01S00 = 100 * DayDeaLoRaA01S00 / DayCasLoRaA01S00
{txt}(5 missing values generated)

{com}. gen DayCfrUpRaA01S00 = 100 * DayDeaUpRaA01S00 / DayCasUpRaA01S00
{txt}(1 missing value generated)

{com}. 
. label var DayCfrMeRaA01S00 "Daily CFR Mean DELP S0"
{txt}
{com}. label var DayCfrLoRaA01S00 "Daily CFR Lower DELP S0"
{txt}
{com}. label var DayCfrUpRaA01S00 "Daily CFR Upper DELP S0"
{txt}
{com}. 
. 
. 
. * gen "Daily cases mean div by daily deaths mean DELP DayCbD" for visulization of temporal relation of deaths and cases peaks 
. 
. summ DayDeaMeRaA01S00 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        166     28103.1    105638.9       2568     781376
{txt}
{com}. gen DayDeMMeRaA01S00 = r(mean)
{txt}
{com}. label var DayDeMMeRaA01S00 "Daily deaths mean DELP DayDeM"
{txt}
{com}. 
. summ DayCasMeRaA01S00 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        166      767579    455977.5     172419    1851845
{txt}
{com}. gen DayCaMMeRaA01S00 = r(mean)
{txt}
{com}. label var DayCaMMeRaA01S00 "Daily cases mean DELP DayCaM"
{txt}
{com}.                               
. gen DayCbDMeRaA01S00 = DayCaMMeRaA01S00 / DayDeaMeRaA01S00
{txt}(1 missing value generated)

{com}. label var DayCbDMeRaA01S00 "Daily cases mean div by daily deaths mean DELP DayCbD"
{txt}
{com}. summ DayCbDMeRaA01S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        166     111.451    52.98533   .9823427   298.9015
{txt}
{com}.         
. gen DayDMuMeRaA01S00 = DayDeaMeRaA01S00 * DayCbDMeRaA01S00
{txt}(1 missing value generated)

{com}. label var DayDMuMeRaA01S00 "Daily deaths scaled (times means of cases by deaths) only for visualization DELP"
{txt}
{com}. summ DayDMuMeRaA01S00   

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        166      767579    .0128677   767578.9   767579.1
{txt}
{com}. 
. 
. 
. 
. ******************
.         
. * smooth 
. 
. encode loc_grand_name, gen(loc_grand_name_encoded)
{txt}
{com}. 
. tsset loc_grand_name_encoded date, daily   
{res}{txt}{col 8}panel variable:  {res}loc_grand_name_encoded (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}date, 30Sep2021 to 15Mar2022
{txt}{col 17}delta:  {res}1 day
{txt}
{com}. 
. qui {c -(}
{txt}
{com}. *
. 
. 
. order date loc_grand_name       
{txt}
{com}. sort date
{txt}
{com}. 
. qui compress
{txt}
{com}. save "DELP GLOBAL.dta", replace
{txt}file DELP GLOBAL.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *****************************
. 
. * gen AFRO
. 
. use "DELP.dta", clear
{txt}
{com}. 
. keep if ///
> loc_grand_name == "Algeria" | ///
> loc_grand_name == "Angola" | ///
> loc_grand_name == "Benin" | ///
> loc_grand_name == "Botswana" | ///
> loc_grand_name == "Burkina Faso" | ///
> loc_grand_name == "Burundi" | ///
> loc_grand_name == "Cabo Verde" | ///
> loc_grand_name == "Cameroon" | ///
> loc_grand_name == "Central African Republic" | ///
> loc_grand_name == "Chad" | ///
> loc_grand_name == "Comoros" | ///
> loc_grand_name == "Congo (Brazzaville)" | ///
> loc_grand_name == "Congo (Kinshasa)" | ///
> loc_grand_name == "Cote d'Ivoire" | ///
> loc_grand_name == "Equatorial Guinea" | ///
> loc_grand_name == "Ethiopia" | ///
> loc_grand_name == "Gabon" | ///
> loc_grand_name == "Gambia" | ///
> loc_grand_name == "Ghana" | ///
> loc_grand_name == "Guinea" | ///
> loc_grand_name == "Guinea-Bissau" | ///
> loc_grand_name == "Kenya" | ///
> loc_grand_name == "Lesotho" | ///
> loc_grand_name == "Liberia" | ///
> loc_grand_name == "Madagascar" | ///
> loc_grand_name == "Malawi" | ///
> loc_grand_name == "Mali" | ///
> loc_grand_name == "Mauritania" | ///
> loc_grand_name == "Mauritius" | ///
> loc_grand_name == "Mozambique" | ///
> loc_grand_name == "Namibia" | ///
> loc_grand_name == "Niger" | ///
> loc_grand_name == "Nigeria" | ///
> loc_grand_name == "Rwanda" | ///
> loc_grand_name == "Sao Tome and Principe" | ///
> loc_grand_name == "Senegal" | ///
> loc_grand_name == "Seychelles" | ///
> loc_grand_name == "Sierra Leone" | ///
> loc_grand_name == "South Africa" | ///
> loc_grand_name == "South Sudan" | ///
> loc_grand_name == "Tanzania" | ///
> loc_grand_name == "Togo" | ///
> loc_grand_name == "Uganda" | ///
> loc_grand_name == "Zambia" | ///
> loc_grand_name == "Zimbabwe" 
{txt}(32,565 observations deleted)

{com}. 
. drop continent province loc_grand_name
{txt}
{com}. 
. collapse (sum) totaldetected-totaldetecteddeathsub, by(day)
{txt}
{com}. 
. 
. gen loc_grand_name = "AFRO"
{txt}
{com}. 
. 
. rename day date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22553{txt},{res}22719{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}30sep2021{txt},{res}15mar2022{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}167{col 51}{txt}missing .:  {res}0{txt}/{res}167

{txt}{col 19}mean:{res}{col 26}   22636{txt} = {res}22dec2021{txt}
{col 15}std. dev:{res}{col 26} 48.3529

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   22569{col 37}   22594{col 47}   22636{col 57}   22678{col 67}   22703
{col 26}16oct2021{col 36}10nov2021{col 46}22dec2021{col 56}02feb2022{col 66}27feb2022
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. * gen daily vars and rename
. * rename outcome variables
. 
. 
. * total vars
. 
. rename totaldetecteddeaths   TotDeaMeRaA01S00
{res}{txt}
{com}. rename totaldetecteddeathslb TotDeaLoRaA01S00
{res}{txt}
{com}. rename totaldetecteddeathsub TotDeaUpRaA01S00
{res}{txt}
{com}. 
. label var TotDeaMeRaA01S00 "Total Deaths Mean DELP S0"
{txt}
{com}. label var TotDeaMeRaA01S00 "Total Deaths Lower DELP S0"
{txt}
{com}. label var TotDeaMeRaA01S00 "Total Deaths Upper DELP S0"
{txt}
{com}. 
. rename totaldetected   TotCasMeRaA01S00
{res}{txt}
{com}. rename totaldetectedlb TotCasLoRaA01S00
{res}{txt}
{com}. rename totaldetectedub TotCasUpRaA01S00
{res}{txt}
{com}. 
. label var TotCasMeRaA01S00 "Total Cases Mean DELP S0"
{txt}
{com}. label var TotCasMeRaA01S00 "Total Cases Lower DELP S0"
{txt}
{com}. label var TotCasMeRaA01S00 "Total Cases Upper DELP S0"
{txt}
{com}. 
. 
. * gen daily vars and rename
. 
. sort date
{txt}
{com}. 
. gen DayDeaMeRaA01S00 =  TotDeaMeRaA01S00[_n] - TotDeaMeRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. gen DayDeaLoRaA01S00 =  TotDeaLoRaA01S00[_n] - TotDeaLoRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. gen DayDeaUpRaA01S00 =  TotDeaUpRaA01S00[_n] - TotDeaUpRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. gen DayCasMeRaA01S00 =  TotCasMeRaA01S00[_n] - TotCasMeRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. gen DayCasLoRaA01S00 =  TotCasLoRaA01S00[_n] - TotCasLoRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. gen DayCasUpRaA01S00 =  TotCasUpRaA01S00[_n] - TotCasUpRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. 
. label var DayDeaMeRaA01S00 "Daily Deaths Mean DELP S0"
{txt}
{com}. label var DayDeaLoRaA01S00 "Daily Deaths Lower DELP S0"
{txt}
{com}. label var DayDeaUpRaA01S00 "Daily Deaths Upper DELP S0"
{txt}
{com}. 
. label var DayCasMeRaA01S00 "Daily Cases Mean DELP S0"
{txt}
{com}. label var DayCasLoRaA01S00 "Daily Cases Lower DELP S0"
{txt}
{com}. label var DayCasUpRaA01S00 "Daily Cases Upper DELP S0"
{txt}
{com}. 
. label var TotDeaMeRaA01S00 "Total Deaths Mean DELP S0"
{txt}
{com}. label var TotDeaLoRaA01S00 "Total Deaths Lower DELP S0"
{txt}
{com}. label var TotDeaUpRaA01S00 "Total Deaths Upper DELP S0"
{txt}
{com}. 
. label var TotCasMeRaA01S00 "Total Cases Mean DELP S0"
{txt}
{com}. label var TotCasLoRaA01S00 "Total Cases Lower DELP S0"
{txt}
{com}. label var TotCasUpRaA01S00 "Total Cases Upper DELP S0"
{txt}
{com}. 
. 
. * 
. 
. * other outcomes
. 
. * active activehospitalized activeventilated cumulativehospitalized
. 
. /*
> ***********************
> * rename convention
> 
> active                                  Act
> 
> activehospitalized              Hos
> 
> activeventilated                Ven
> 
> cumulativehospitalized  Hos
> 
> */
. 
. 
. rename active DayActMeRaA01S00
{res}{txt}
{com}. 
. rename activehospitalized DayHosMeRaA01S00
{res}{txt}
{com}. 
. rename activeventilated DayVenMeRaA01S00
{res}{txt}
{com}. 
. rename cumulativehospitalized TotHosMeRaA01S00
{res}{txt}
{com}. 
. label var DayActMeRaA01S00 "Daily Cases Active Mean DELP S0"
{txt}
{com}. 
. label var DayHosMeRaA01S00 "Daily Cases Active Hospitalized Mean DELP S0"
{txt}
{com}. 
. label var DayVenMeRaA01S00 "Daily Cases Active Ventilated Mean DELP S0"
{txt}
{com}. 
. label var TotHosMeRaA01S00 "Total Cases Active Mean DELP S0"
{txt}
{com}. 
.  
. 
. keep ///
> loc_grand_name date ///
> TotDeaMeRaA01S00 TotDeaLoRaA01S00 TotDeaUpRaA01S00 ///
> DayDeaMeRaA01S00 DayDeaLoRaA01S00 DayDeaUpRaA01S00 ///
> TotCasMeRaA01S00 TotCasLoRaA01S00 TotCasUpRaA01S00 ///
> DayCasMeRaA01S00 DayCasLoRaA01S00 DayCasUpRaA01S00 ///
> DayActMeRaA01S00 DayHosMeRaA01S00 DayVenMeRaA01S00 TotHosMeRaA01S00
{txt}
{com}. 
. 
. order ///
> loc_grand_name date ///
> TotDeaMeRaA01S00 TotDeaLoRaA01S00 TotDeaUpRaA01S00 ///
> DayDeaMeRaA01S00 DayDeaLoRaA01S00 DayDeaUpRaA01S00 ///
> TotCasMeRaA01S00 TotCasLoRaA01S00 TotCasUpRaA01S00 ///
> DayCasMeRaA01S00 DayCasLoRaA01S00 DayCasUpRaA01S00 ///
> DayActMeRaA01S00 DayHosMeRaA01S00 DayVenMeRaA01S00 TotHosMeRaA01S00
{txt}
{com}. 
. 
. 
. * gen cfr
. 
. gen DayCfrMeRaA01S00 = 100 * DayDeaMeRaA01S00 / DayCasMeRaA01S00
{txt}(1 missing value generated)

{com}. gen DayCfrLoRaA01S00 = 100 * DayDeaLoRaA01S00 / DayCasLoRaA01S00
{txt}(1 missing value generated)

{com}. gen DayCfrUpRaA01S00 = 100 * DayDeaUpRaA01S00 / DayCasUpRaA01S00
{txt}(1 missing value generated)

{com}. 
. label var DayCfrMeRaA01S00 "Daily CFR Mean DELP S0"
{txt}
{com}. label var DayCfrLoRaA01S00 "Daily CFR Lower DELP S0"
{txt}
{com}. label var DayCfrUpRaA01S00 "Daily CFR Upper DELP S0"
{txt}
{com}. 
. 
. 
. 
. *
. 
. 
. 
. 
. 
. * gen "Daily cases mean div by daily deaths mean DELP DayCbD" for visulization of temporal relation of deaths and cases peaks 
. 
. 
. summ DayDeaMeRaA01S00 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        166    22201.05    105612.3         30     775383
{txt}
{com}. gen DayDeMMeRaA01S00 = r(mean)
{txt}
{com}. label var DayDeMMeRaA01S00 "Daily deaths mean DELP DayDeM"
{txt}
{com}. 
. summ DayCasMeRaA01S00 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        166    173427.7    216349.9       1104    1279498
{txt}
{com}. gen DayCaMMeRaA01S00 = r(mean)
{txt}
{com}. label var DayCaMMeRaA01S00 "Daily cases mean DELP DayCaM"
{txt}
{com}.                               
. gen DayCbDMeRaA01S00 = DayCaMMeRaA01S00 / DayDeaMeRaA01S00
{txt}(1 missing value generated)

{com}. label var DayCbDMeRaA01S00 "Daily cases mean div by daily deaths mean DELP DayCbD"
{txt}
{com}. summ DayCbDMeRaA01S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        166    1541.441    1863.334   .2236672   5780.924
{txt}
{com}.         
. gen DayDMuMeRaA01S00 = DayDeaMeRaA01S00 * DayCbDMeRaA01S00
{txt}(1 missing value generated)

{com}. label var DayDMuMeRaA01S00 "Daily deaths scaled (times means of cases by deaths) only for visualization DELP"
{txt}
{com}. summ DayDMuMeRaA01S00   

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        166    173427.7    .0034353   173427.7   173427.8
{txt}
{com}. 
. 
. 
. 
. ******************
.         
. * smooth 
. 
. encode loc_grand_name, gen(loc_grand_name_encoded)
{txt}
{com}. 
. tsset loc_grand_name_encoded date, daily   
{res}{txt}{col 8}panel variable:  {res}loc_grand_name_encoded (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}date, 30Sep2021 to 15Mar2022
{txt}{col 17}delta:  {res}1 day
{txt}
{com}. 
. qui {c -(}
{txt}
{com}. *
. 
. 
. order date loc_grand_name       
{txt}
{com}. sort date
{txt}
{com}. 
. 
. qui compress
{txt}
{com}. save "DELP AFRO.dta", replace
{txt}file DELP AFRO.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *****************************
. 
. * gen AMRO
. 
. use "DELP.dta", clear
{txt}
{com}. 
. keep if ///
> loc_grand_name == "Antigua and Barbuda" | ///
> loc_grand_name == "Argentina" | ///
> loc_grand_name == "Barbados" | ///
> loc_grand_name == "Belize" | ///
> loc_grand_name == "Bolivia" | ///
> loc_grand_name == "Brazil" | ///
> loc_grand_name == "Canada" | ///
> loc_grand_name == "Chile" | ///
> loc_grand_name == "Colombia" | ///
> loc_grand_name == "Costa Rica" | ///
> loc_grand_name == "Cuba" | ///
> loc_grand_name == "Dominican Republic" | ///
> loc_grand_name == "Ecuador" | ///
> loc_grand_name == "El Salvador" | ///
> loc_grand_name == "Guatemala" | ///
> loc_grand_name == "Guyana" | ///
> loc_grand_name == "Haiti" | ///
> loc_grand_name == "Honduras" | ///
> loc_grand_name == "Jamaica" | ///
> loc_grand_name == "Mexico" | ///
> loc_grand_name == "Nicaragua" | ///
> loc_grand_name == "Panama" | ///
> loc_grand_name == "Paraguay" | ///
> loc_grand_name == "Peru" | ///
> loc_grand_name == "Suriname" | ///
> loc_grand_name == "Trinidad and Tobago" | ///
> loc_grand_name == "Uruguay" | ///
> loc_grand_name == "US" | ///
> loc_grand_name == "Venezuela" 
{txt}(25,217 observations deleted)

{com}. 
. drop continent province loc_grand_name
{txt}
{com}. 
. collapse (sum) totaldetected-totaldetecteddeathsub, by(day)
{txt}
{com}. 
. gen loc_grand_name = "AMRO"
{txt}
{com}. 
. 
. rename day date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22553{txt},{res}22719{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}30sep2021{txt},{res}15mar2022{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}167{col 51}{txt}missing .:  {res}0{txt}/{res}167

{txt}{col 19}mean:{res}{col 26}   22636{txt} = {res}22dec2021{txt}
{col 15}std. dev:{res}{col 26} 48.3529

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   22569{col 37}   22594{col 47}   22636{col 57}   22678{col 67}   22703
{col 26}16oct2021{col 36}10nov2021{col 46}22dec2021{col 56}02feb2022{col 66}27feb2022
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. * rename outcome variables
. 
. 
. * total vars
. 
. rename totaldetecteddeaths   TotDeaMeRaA01S00
{res}{txt}
{com}. rename totaldetecteddeathslb TotDeaLoRaA01S00
{res}{txt}
{com}. rename totaldetecteddeathsub TotDeaUpRaA01S00
{res}{txt}
{com}. 
. label var TotDeaMeRaA01S00 "Total Deaths Mean DELP S0"
{txt}
{com}. label var TotDeaMeRaA01S00 "Total Deaths Lower DELP S0"
{txt}
{com}. label var TotDeaMeRaA01S00 "Total Deaths Upper DELP S0"
{txt}
{com}. 
. rename totaldetected   TotCasMeRaA01S00
{res}{txt}
{com}. rename totaldetectedlb TotCasLoRaA01S00
{res}{txt}
{com}. rename totaldetectedub TotCasUpRaA01S00
{res}{txt}
{com}. 
. label var TotCasMeRaA01S00 "Total Cases Mean DELP S0"
{txt}
{com}. label var TotCasMeRaA01S00 "Total Cases Lower DELP S0"
{txt}
{com}. label var TotCasMeRaA01S00 "Total Cases Upper DELP S0"
{txt}
{com}. 
. 
. * gen daily vars and rename
. 
. sort date
{txt}
{com}. 
. gen DayDeaMeRaA01S00 =  TotDeaMeRaA01S00[_n] - TotDeaMeRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. gen DayDeaLoRaA01S00 =  TotDeaLoRaA01S00[_n] - TotDeaLoRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. gen DayDeaUpRaA01S00 =  TotDeaUpRaA01S00[_n] - TotDeaUpRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. gen DayCasMeRaA01S00 =  TotCasMeRaA01S00[_n] - TotCasMeRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. gen DayCasLoRaA01S00 =  TotCasLoRaA01S00[_n] - TotCasLoRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. gen DayCasUpRaA01S00 =  TotCasUpRaA01S00[_n] - TotCasUpRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. 
. label var DayDeaMeRaA01S00 "Daily Deaths Mean DELP S0"
{txt}
{com}. label var DayDeaLoRaA01S00 "Daily Deaths Lower DELP S0"
{txt}
{com}. label var DayDeaUpRaA01S00 "Daily Deaths Upper DELP S0"
{txt}
{com}. 
. label var DayCasMeRaA01S00 "Daily Cases Mean DELP S0"
{txt}
{com}. label var DayCasLoRaA01S00 "Daily Cases Lower DELP S0"
{txt}
{com}. label var DayCasUpRaA01S00 "Daily Cases Upper DELP S0"
{txt}
{com}. 
. label var TotDeaMeRaA01S00 "Total Deaths Mean DELP S0"
{txt}
{com}. label var TotDeaLoRaA01S00 "Total Deaths Lower DELP S0"
{txt}
{com}. label var TotDeaUpRaA01S00 "Total Deaths Upper DELP S0"
{txt}
{com}. 
. label var TotCasMeRaA01S00 "Total Cases Mean DELP S0"
{txt}
{com}. label var TotCasLoRaA01S00 "Total Cases Lower DELP S0"
{txt}
{com}. label var TotCasUpRaA01S00 "Total Cases Upper DELP S0"
{txt}
{com}. 
. 
. * 
. 
. * other outcomes
. 
. * active activehospitalized activeventilated cumulativehospitalized
. 
. /*
> ***********************
> * rename convention
> 
> active                                  Act
> 
> activehospitalized              Hos
> 
> activeventilated                Ven
> 
> cumulativehospitalized  Hos
> 
> */
. 
. 
. rename active DayActMeRaA01S00
{res}{txt}
{com}. 
. rename activehospitalized DayHosMeRaA01S00
{res}{txt}
{com}. 
. rename activeventilated DayVenMeRaA01S00
{res}{txt}
{com}. 
. rename cumulativehospitalized TotHosMeRaA01S00
{res}{txt}
{com}. 
. label var DayActMeRaA01S00 "Daily Cases Active Mean DELP S0"
{txt}
{com}. 
. label var DayHosMeRaA01S00 "Daily Cases Active Hospitalized Mean DELP S0"
{txt}
{com}. 
. label var DayVenMeRaA01S00 "Daily Cases Active Ventilated Mean DELP S0"
{txt}
{com}. 
. label var TotHosMeRaA01S00 "Total Cases Active Mean DELP S0"
{txt}
{com}. 
.  
. 
. keep ///
> loc_grand_name date ///
> TotDeaMeRaA01S00 TotDeaLoRaA01S00 TotDeaUpRaA01S00 ///
> DayDeaMeRaA01S00 DayDeaLoRaA01S00 DayDeaUpRaA01S00 ///
> TotCasMeRaA01S00 TotCasLoRaA01S00 TotCasUpRaA01S00 ///
> DayCasMeRaA01S00 DayCasLoRaA01S00 DayCasUpRaA01S00 ///
> DayActMeRaA01S00 DayHosMeRaA01S00 DayVenMeRaA01S00 TotHosMeRaA01S00
{txt}
{com}. 
. 
. order ///
> loc_grand_name date ///
> TotDeaMeRaA01S00 TotDeaLoRaA01S00 TotDeaUpRaA01S00 ///
> DayDeaMeRaA01S00 DayDeaLoRaA01S00 DayDeaUpRaA01S00 ///
> TotCasMeRaA01S00 TotCasLoRaA01S00 TotCasUpRaA01S00 ///
> DayCasMeRaA01S00 DayCasLoRaA01S00 DayCasUpRaA01S00 ///
> DayActMeRaA01S00 DayHosMeRaA01S00 DayVenMeRaA01S00 TotHosMeRaA01S00
{txt}
{com}. 
. 
. 
. * gen cfr
. 
. gen DayCfrMeRaA01S00 = 100 * DayDeaMeRaA01S00 / DayCasMeRaA01S00
{txt}(1 missing value generated)

{com}. gen DayCfrLoRaA01S00 = 100 * DayDeaLoRaA01S00 / DayCasLoRaA01S00
{txt}(1 missing value generated)

{com}. gen DayCfrUpRaA01S00 = 100 * DayDeaUpRaA01S00 / DayCasUpRaA01S00
{txt}(1 missing value generated)

{com}. 
. label var DayCfrMeRaA01S00 "Daily CFR Mean DELP S0"
{txt}
{com}. label var DayCfrLoRaA01S00 "Daily CFR Lower DELP S0"
{txt}
{com}. label var DayCfrUpRaA01S00 "Daily CFR Upper DELP S0"
{txt}
{com}. 
. 
. 
. 
. *
. 
. 
. 
. 
. 
. * gen "Daily cases mean div by daily deaths mean DELP DayCbD" for visulization of temporal relation of deaths and cases peaks 
. 
. 
. summ DayDeaMeRaA01S00 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        166    3223.169     850.611       1161       4666
{txt}
{com}. gen DayDeMMeRaA01S00 = r(mean)
{txt}
{com}. label var DayDeMMeRaA01S00 "Daily deaths mean DELP DayDeM"
{txt}
{com}. 
. summ DayCasMeRaA01S00 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        166    350806.1    306959.5      20294    1103530
{txt}
{com}. gen DayCaMMeRaA01S00 = r(mean)
{txt}
{com}. label var DayCaMMeRaA01S00 "Daily cases mean DELP DayCaM"
{txt}
{com}.                               
. gen DayCbDMeRaA01S00 = DayCaMMeRaA01S00 / DayDeaMeRaA01S00
{txt}(1 missing value generated)

{com}. label var DayCbDMeRaA01S00 "Daily cases mean div by daily deaths mean DELP DayCbD"
{txt}
{com}. summ DayCbDMeRaA01S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        166    120.1716    47.02192   75.18347   302.1585
{txt}
{com}.         
. gen DayDMuMeRaA01S00 = DayDeaMeRaA01S00 * DayCbDMeRaA01S00
{txt}(1 missing value generated)

{com}. label var DayDMuMeRaA01S00 "Daily deaths scaled (times means of cases by deaths) only for visualization DELP"
{txt}
{com}. summ DayDMuMeRaA01S00   

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        166    350806.1    .0076839     350806   350806.1
{txt}
{com}. 
. 
. 
. 
. ******************
.         
. * smooth 
. 
. encode loc_grand_name, gen(loc_grand_name_encoded)
{txt}
{com}. 
. tsset loc_grand_name_encoded date, daily   
{res}{txt}{col 8}panel variable:  {res}loc_grand_name_encoded (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}date, 30Sep2021 to 15Mar2022
{txt}{col 17}delta:  {res}1 day
{txt}
{com}. 
. qui {c -(}
{txt}
{com}. *
. 
. 
. order date loc_grand_name       
{txt}
{com}. sort date
{txt}
{com}. 
. 
. qui compress
{txt}
{com}. save "DELP AMRO.dta", replace
{txt}file DELP AMRO.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *****************************
. 
. * gen EMRO
. 
. use "DELP.dta", clear
{txt}
{com}. 
. keep if ///
> loc_grand_name == "Afghanistan" | ///
> loc_grand_name == "Bahrain" | ///
> loc_grand_name == "Djibouti" | ///
> loc_grand_name == "Egypt" | ///
> loc_grand_name == "Iran" | ///
> loc_grand_name == "Iraq" | ///
> loc_grand_name == "Jordan" | ///
> loc_grand_name == "Kuwait" | ///
> loc_grand_name == "Lebanon" | ///
> loc_grand_name == "Libya" | ///
> loc_grand_name == "Morocco" | ///
> loc_grand_name == "Oman" | ///
> loc_grand_name == "Pakistan" | ///
> loc_grand_name == "Qatar" | ///
> loc_grand_name == "Saudi Arabia" | ///
> loc_grand_name == "Somalia" | ///
> loc_grand_name == "Sudan" | ///
> loc_grand_name == "Tunisia" | ///
> loc_grand_name == "United Arab Emirates" | ///
> loc_grand_name == "Yemen" 
{txt}(36,740 observations deleted)

{com}. 
. drop continent province loc_grand_name
{txt}
{com}. 
. collapse (sum) totaldetected-totaldetecteddeathsub, by(day)
{txt}
{com}. 
. gen loc_grand_name = "EMRO"
{txt}
{com}. 
. 
. rename day date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22553{txt},{res}22719{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}30sep2021{txt},{res}15mar2022{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}167{col 51}{txt}missing .:  {res}0{txt}/{res}167

{txt}{col 19}mean:{res}{col 26}   22636{txt} = {res}22dec2021{txt}
{col 15}std. dev:{res}{col 26} 48.3529

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   22569{col 37}   22594{col 47}   22636{col 57}   22678{col 67}   22703
{col 26}16oct2021{col 36}10nov2021{col 46}22dec2021{col 56}02feb2022{col 66}27feb2022
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. * rename outcome variables
. 
. 
. * total vars
. 
. rename totaldetecteddeaths   TotDeaMeRaA01S00
{res}{txt}
{com}. rename totaldetecteddeathslb TotDeaLoRaA01S00
{res}{txt}
{com}. rename totaldetecteddeathsub TotDeaUpRaA01S00
{res}{txt}
{com}. 
. label var TotDeaMeRaA01S00 "Total Deaths Mean DELP S0"
{txt}
{com}. label var TotDeaMeRaA01S00 "Total Deaths Lower DELP S0"
{txt}
{com}. label var TotDeaMeRaA01S00 "Total Deaths Upper DELP S0"
{txt}
{com}. 
. rename totaldetected   TotCasMeRaA01S00
{res}{txt}
{com}. rename totaldetectedlb TotCasLoRaA01S00
{res}{txt}
{com}. rename totaldetectedub TotCasUpRaA01S00
{res}{txt}
{com}. 
. label var TotCasMeRaA01S00 "Total Cases Mean DELP S0"
{txt}
{com}. label var TotCasMeRaA01S00 "Total Cases Lower DELP S0"
{txt}
{com}. label var TotCasMeRaA01S00 "Total Cases Upper DELP S0"
{txt}
{com}. 
. 
. * gen daily vars and rename
. 
. sort date
{txt}
{com}. 
. gen DayDeaMeRaA01S00 =  TotDeaMeRaA01S00[_n] - TotDeaMeRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. gen DayDeaLoRaA01S00 =  TotDeaLoRaA01S00[_n] - TotDeaLoRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. gen DayDeaUpRaA01S00 =  TotDeaUpRaA01S00[_n] - TotDeaUpRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. gen DayCasMeRaA01S00 =  TotCasMeRaA01S00[_n] - TotCasMeRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. gen DayCasLoRaA01S00 =  TotCasLoRaA01S00[_n] - TotCasLoRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. gen DayCasUpRaA01S00 =  TotCasUpRaA01S00[_n] - TotCasUpRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. 
. label var DayDeaMeRaA01S00 "Daily Deaths Mean DELP S0"
{txt}
{com}. label var DayDeaLoRaA01S00 "Daily Deaths Lower DELP S0"
{txt}
{com}. label var DayDeaUpRaA01S00 "Daily Deaths Upper DELP S0"
{txt}
{com}. 
. label var DayCasMeRaA01S00 "Daily Cases Mean DELP S0"
{txt}
{com}. label var DayCasLoRaA01S00 "Daily Cases Lower DELP S0"
{txt}
{com}. label var DayCasUpRaA01S00 "Daily Cases Upper DELP S0"
{txt}
{com}. 
. label var TotDeaMeRaA01S00 "Total Deaths Mean DELP S0"
{txt}
{com}. label var TotDeaLoRaA01S00 "Total Deaths Lower DELP S0"
{txt}
{com}. label var TotDeaUpRaA01S00 "Total Deaths Upper DELP S0"
{txt}
{com}. 
. label var TotCasMeRaA01S00 "Total Cases Mean DELP S0"
{txt}
{com}. label var TotCasLoRaA01S00 "Total Cases Lower DELP S0"
{txt}
{com}. label var TotCasUpRaA01S00 "Total Cases Upper DELP S0"
{txt}
{com}. 
. 
. * 
. 
. * other outcomes
. 
. * active activehospitalized activeventilated cumulativehospitalized
. 
. /*
> ***********************
> * rename convention
> 
> active                                  Act
> 
> activehospitalized              Hos
> 
> activeventilated                Ven
> 
> cumulativehospitalized  Hos
> 
> */
. 
. 
. rename active DayActMeRaA01S00
{res}{txt}
{com}. 
. rename activehospitalized DayHosMeRaA01S00
{res}{txt}
{com}. 
. rename activeventilated DayVenMeRaA01S00
{res}{txt}
{com}. 
. rename cumulativehospitalized TotHosMeRaA01S00
{res}{txt}
{com}. 
. label var DayActMeRaA01S00 "Daily Cases Active Mean DELP S0"
{txt}
{com}. 
. label var DayHosMeRaA01S00 "Daily Cases Active Hospitalized Mean DELP S0"
{txt}
{com}. 
. label var DayVenMeRaA01S00 "Daily Cases Active Ventilated Mean DELP S0"
{txt}
{com}. 
. label var TotHosMeRaA01S00 "Total Cases Active Mean DELP S0"
{txt}
{com}. 
.  
. 
. keep ///
> loc_grand_name date ///
> TotDeaMeRaA01S00 TotDeaLoRaA01S00 TotDeaUpRaA01S00 ///
> DayDeaMeRaA01S00 DayDeaLoRaA01S00 DayDeaUpRaA01S00 ///
> TotCasMeRaA01S00 TotCasLoRaA01S00 TotCasUpRaA01S00 ///
> DayCasMeRaA01S00 DayCasLoRaA01S00 DayCasUpRaA01S00 ///
> DayActMeRaA01S00 DayHosMeRaA01S00 DayVenMeRaA01S00 TotHosMeRaA01S00
{txt}
{com}. 
. 
. order ///
> loc_grand_name date ///
> TotDeaMeRaA01S00 TotDeaLoRaA01S00 TotDeaUpRaA01S00 ///
> DayDeaMeRaA01S00 DayDeaLoRaA01S00 DayDeaUpRaA01S00 ///
> TotCasMeRaA01S00 TotCasLoRaA01S00 TotCasUpRaA01S00 ///
> DayCasMeRaA01S00 DayCasLoRaA01S00 DayCasUpRaA01S00 ///
> DayActMeRaA01S00 DayHosMeRaA01S00 DayVenMeRaA01S00 TotHosMeRaA01S00
{txt}
{com}. 
. 
. 
. * gen cfr
. 
. gen DayCfrMeRaA01S00 = 100 * DayDeaMeRaA01S00 / DayCasMeRaA01S00
{txt}(1 missing value generated)

{com}. gen DayCfrLoRaA01S00 = 100 * DayDeaLoRaA01S00 / DayCasLoRaA01S00
{txt}(1 missing value generated)

{com}. gen DayCfrUpRaA01S00 = 100 * DayDeaUpRaA01S00 / DayCasUpRaA01S00
{txt}(1 missing value generated)

{com}. 
. label var DayCfrMeRaA01S00 "Daily CFR Mean DELP S0"
{txt}
{com}. label var DayCfrLoRaA01S00 "Daily CFR Lower DELP S0"
{txt}
{com}. label var DayCfrUpRaA01S00 "Daily CFR Upper DELP S0"
{txt}
{com}. 
. 
. 
. 
. *
. 
. 
. 
. 
. 
. * gen "Daily cases mean div by daily deaths mean DELP DayCbD" for visulization of temporal relation of deaths and cases peaks 
. 
. 
. summ DayDeaMeRaA01S00 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        166    192.2651    103.4514         29        494
{txt}
{com}. gen DayDeMMeRaA01S00 = r(mean)
{txt}
{com}. label var DayDeMMeRaA01S00 "Daily deaths mean DELP DayDeM"
{txt}
{com}. 
. summ DayCasMeRaA01S00 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        166    17750.73    8844.544       3252      38521
{txt}
{com}. gen DayCaMMeRaA01S00 = r(mean)
{txt}
{com}. label var DayCaMMeRaA01S00 "Daily cases mean DELP DayCaM"
{txt}
{com}.                               
. gen DayCbDMeRaA01S00 = DayCaMMeRaA01S00 / DayDeaMeRaA01S00
{txt}(1 missing value generated)

{com}. label var DayCbDMeRaA01S00 "Daily cases mean div by daily deaths mean DELP DayCbD"
{txt}
{com}. summ DayCbDMeRaA01S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        166    135.9194    107.9867   35.93266   612.0943
{txt}
{com}.         
. gen DayDMuMeRaA01S00 = DayDeaMeRaA01S00 * DayCbDMeRaA01S00
{txt}(1 missing value generated)

{com}. label var DayDMuMeRaA01S00 "Daily deaths scaled (times means of cases by deaths) only for visualization DELP"
{txt}
{com}. summ DayDMuMeRaA01S00   

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        166    17750.73           0   17750.73   17750.73
{txt}
{com}. 
. 
. 
. 
. ******************
.         
. * smooth 
. 
. encode loc_grand_name, gen(loc_grand_name_encoded)
{txt}
{com}. 
. tsset loc_grand_name_encoded date, daily   
{res}{txt}{col 8}panel variable:  {res}loc_grand_name_encoded (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}date, 30Sep2021 to 15Mar2022
{txt}{col 17}delta:  {res}1 day
{txt}
{com}. 
. qui {c -(}
{txt}
{com}. *
. 
. 
. order date loc_grand_name       
{txt}
{com}. sort date
{txt}
{com}. 
. 
. qui compress
{txt}
{com}. save "DELP EMRO.dta", replace
{txt}file DELP EMRO.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *****************************
. 
. * gen EURO
. 
. use "DELP.dta", clear
{txt}
{com}. 
. keep if ///
> loc_grand_name == "Albania" | ///
> loc_grand_name == "Andorra" | ///
> loc_grand_name == "Armenia" | ///
> loc_grand_name == "Austria" | ///
> loc_grand_name == "Azerbaijan" | ///
> loc_grand_name == "Belarus" | ///
> loc_grand_name == "Belgium" | ///
> loc_grand_name == "Bosnia and Herzegovina" | ///
> loc_grand_name == "Bulgaria" | ///
> loc_grand_name == "Croatia" | ///
> loc_grand_name == "Cyprus" | ///
> loc_grand_name == "Czechia" | ///
> loc_grand_name == "Denmark" | ///
> loc_grand_name == "Estonia" | ///
> loc_grand_name == "Finland" | ///
> loc_grand_name == "France" | ///
> loc_grand_name == "Georgia" | ///
> loc_grand_name == "Germany" | ///
> loc_grand_name == "Greece" | ///
> loc_grand_name == "Hungary" | ///
> loc_grand_name == "Iceland" | ///
> loc_grand_name == "Ireland" | ///
> loc_grand_name == "Israel" | ///
> loc_grand_name == "Italy" | ///
> loc_grand_name == "Kazakhstan" | ///
> loc_grand_name == "Kosovo" | ///
> loc_grand_name == "Latvia" | ///
> loc_grand_name == "Liechtenstein" | ///
> loc_grand_name == "Lithuania" | ///
> loc_grand_name == "Luxembourg" | ///
> loc_grand_name == "Malta" | ///
> loc_grand_name == "Moldova" | ///
> loc_grand_name == "Monaco" | ///
> loc_grand_name == "Montenegro" | ///
> loc_grand_name == "Netherlands" | ///
> loc_grand_name == "North Macedonia" | ///
> loc_grand_name == "Norway" | ///
> loc_grand_name == "Poland" | ///
> loc_grand_name == "Portugal" | ///
> loc_grand_name == "Romania" | ///
> loc_grand_name == "Russia" | ///
> loc_grand_name == "San Marino" | ///
> loc_grand_name == "Serbia" | ///
> loc_grand_name == "Slovakia" | ///
> loc_grand_name == "Slovenia" | ///
> loc_grand_name == "Spain" | ///
> loc_grand_name == "Sweden" | ///
> loc_grand_name == "Switzerland" | ///
> loc_grand_name == "Tajikistan" | ///
> loc_grand_name == "Turkey" | ///
> loc_grand_name == "Ukraine" | ///
> loc_grand_name == "United Kingdom" | ///
> loc_grand_name == "Uzbekistan" 
{txt}(31,229 observations deleted)

{com}. 
. drop continent province loc_grand_name
{txt}
{com}. 
. collapse (sum) totaldetected-totaldetecteddeathsub, by(day)
{txt}
{com}. 
. gen loc_grand_name = "EURO"
{txt}
{com}. 
. 
. rename day date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22553{txt},{res}22719{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}30sep2021{txt},{res}15mar2022{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}167{col 51}{txt}missing .:  {res}0{txt}/{res}167

{txt}{col 19}mean:{res}{col 26}   22636{txt} = {res}22dec2021{txt}
{col 15}std. dev:{res}{col 26} 48.3529

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   22569{col 37}   22594{col 47}   22636{col 57}   22678{col 67}   22703
{col 26}16oct2021{col 36}10nov2021{col 46}22dec2021{col 56}02feb2022{col 66}27feb2022
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. * rename outcome variables
. 
. 
. * total vars
. 
. rename totaldetecteddeaths   TotDeaMeRaA01S00
{res}{txt}
{com}. rename totaldetecteddeathslb TotDeaLoRaA01S00
{res}{txt}
{com}. rename totaldetecteddeathsub TotDeaUpRaA01S00
{res}{txt}
{com}. 
. label var TotDeaMeRaA01S00 "Total Deaths Mean DELP S0"
{txt}
{com}. label var TotDeaMeRaA01S00 "Total Deaths Lower DELP S0"
{txt}
{com}. label var TotDeaMeRaA01S00 "Total Deaths Upper DELP S0"
{txt}
{com}. 
. rename totaldetected   TotCasMeRaA01S00
{res}{txt}
{com}. rename totaldetectedlb TotCasLoRaA01S00
{res}{txt}
{com}. rename totaldetectedub TotCasUpRaA01S00
{res}{txt}
{com}. 
. label var TotCasMeRaA01S00 "Total Cases Mean DELP S0"
{txt}
{com}. label var TotCasMeRaA01S00 "Total Cases Lower DELP S0"
{txt}
{com}. label var TotCasMeRaA01S00 "Total Cases Upper DELP S0"
{txt}
{com}. 
. 
. * gen daily vars and rename
. 
. sort date
{txt}
{com}. 
. gen DayDeaMeRaA01S00 =  TotDeaMeRaA01S00[_n] - TotDeaMeRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. gen DayDeaLoRaA01S00 =  TotDeaLoRaA01S00[_n] - TotDeaLoRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. gen DayDeaUpRaA01S00 =  TotDeaUpRaA01S00[_n] - TotDeaUpRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. gen DayCasMeRaA01S00 =  TotCasMeRaA01S00[_n] - TotCasMeRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. gen DayCasLoRaA01S00 =  TotCasLoRaA01S00[_n] - TotCasLoRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. gen DayCasUpRaA01S00 =  TotCasUpRaA01S00[_n] - TotCasUpRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. 
. label var DayDeaMeRaA01S00 "Daily Deaths Mean DELP S0"
{txt}
{com}. label var DayDeaLoRaA01S00 "Daily Deaths Lower DELP S0"
{txt}
{com}. label var DayDeaUpRaA01S00 "Daily Deaths Upper DELP S0"
{txt}
{com}. 
. label var DayCasMeRaA01S00 "Daily Cases Mean DELP S0"
{txt}
{com}. label var DayCasLoRaA01S00 "Daily Cases Lower DELP S0"
{txt}
{com}. label var DayCasUpRaA01S00 "Daily Cases Upper DELP S0"
{txt}
{com}. 
. label var TotDeaMeRaA01S00 "Total Deaths Mean DELP S0"
{txt}
{com}. label var TotDeaLoRaA01S00 "Total Deaths Lower DELP S0"
{txt}
{com}. label var TotDeaUpRaA01S00 "Total Deaths Upper DELP S0"
{txt}
{com}. 
. label var TotCasMeRaA01S00 "Total Cases Mean DELP S0"
{txt}
{com}. label var TotCasLoRaA01S00 "Total Cases Lower DELP S0"
{txt}
{com}. label var TotCasUpRaA01S00 "Total Cases Upper DELP S0"
{txt}
{com}. 
. 
. * 
. 
. * other outcomes
. 
. * active activehospitalized activeventilated cumulativehospitalized
. 
. /*
> ***********************
> * rename convention
> 
> active                                  Act
> 
> activehospitalized              Hos
> 
> activeventilated                Ven
> 
> cumulativehospitalized  Hos
> 
> */
. 
. 
. rename active DayActMeRaA01S00
{res}{txt}
{com}. 
. rename activehospitalized DayHosMeRaA01S00
{res}{txt}
{com}. 
. rename activeventilated DayVenMeRaA01S00
{res}{txt}
{com}. 
. rename cumulativehospitalized TotHosMeRaA01S00
{res}{txt}
{com}. 
. label var DayActMeRaA01S00 "Daily Cases Active Mean DELP S0"
{txt}
{com}. 
. label var DayHosMeRaA01S00 "Daily Cases Active Hospitalized Mean DELP S0"
{txt}
{com}. 
. label var DayVenMeRaA01S00 "Daily Cases Active Ventilated Mean DELP S0"
{txt}
{com}. 
. label var TotHosMeRaA01S00 "Total Cases Active Mean DELP S0"
{txt}
{com}. 
.  
. 
. keep ///
> loc_grand_name date ///
> TotDeaMeRaA01S00 TotDeaLoRaA01S00 TotDeaUpRaA01S00 ///
> DayDeaMeRaA01S00 DayDeaLoRaA01S00 DayDeaUpRaA01S00 ///
> TotCasMeRaA01S00 TotCasLoRaA01S00 TotCasUpRaA01S00 ///
> DayCasMeRaA01S00 DayCasLoRaA01S00 DayCasUpRaA01S00 ///
> DayActMeRaA01S00 DayHosMeRaA01S00 DayVenMeRaA01S00 TotHosMeRaA01S00
{txt}
{com}. 
. 
. order ///
> loc_grand_name date ///
> TotDeaMeRaA01S00 TotDeaLoRaA01S00 TotDeaUpRaA01S00 ///
> DayDeaMeRaA01S00 DayDeaLoRaA01S00 DayDeaUpRaA01S00 ///
> TotCasMeRaA01S00 TotCasLoRaA01S00 TotCasUpRaA01S00 ///
> DayCasMeRaA01S00 DayCasLoRaA01S00 DayCasUpRaA01S00 ///
> DayActMeRaA01S00 DayHosMeRaA01S00 DayVenMeRaA01S00 TotHosMeRaA01S00
{txt}
{com}. 
. 
. 
. * gen cfr
. 
. gen DayCfrMeRaA01S00 = 100 * DayDeaMeRaA01S00 / DayCasMeRaA01S00
{txt}(1 missing value generated)

{com}. gen DayCfrLoRaA01S00 = 100 * DayDeaLoRaA01S00 / DayCasLoRaA01S00
{txt}(1 missing value generated)

{com}. gen DayCfrUpRaA01S00 = 100 * DayDeaUpRaA01S00 / DayCasUpRaA01S00
{txt}(1 missing value generated)

{com}. 
. label var DayCfrMeRaA01S00 "Daily CFR Mean DELP S0"
{txt}
{com}. label var DayCfrLoRaA01S00 "Daily CFR Lower DELP S0"
{txt}
{com}. label var DayCfrUpRaA01S00 "Daily CFR Upper DELP S0"
{txt}
{com}. 
. 
. 
. 
. *
. 
. 
. 
. 
. 
. * gen "Daily cases mean div by daily deaths mean DELP DayCbD" for visulization of temporal relation of deaths and cases peaks 
. 
. 
. summ DayDeaMeRaA01S00 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        166    3125.289    992.0536        833       4237
{txt}
{com}. gen DayDeMMeRaA01S00 = r(mean)
{txt}
{com}. label var DayDeMMeRaA01S00 "Daily deaths mean DELP DayDeM"
{txt}
{com}. 
. summ DayCasMeRaA01S00 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        166    321656.6    251879.1      10540    1037999
{txt}
{com}. gen DayCaMMeRaA01S00 = r(mean)
{txt}
{com}. label var DayCaMMeRaA01S00 "Daily cases mean DELP DayCaM"
{txt}
{com}.                               
. gen DayCbDMeRaA01S00 = DayCaMMeRaA01S00 / DayDeaMeRaA01S00
{txt}(1 missing value generated)

{com}. label var DayCbDMeRaA01S00 "Daily cases mean div by daily deaths mean DELP DayCbD"
{txt}
{com}. summ DayCbDMeRaA01S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        166    123.0067    69.49973   75.91611   386.1424
{txt}
{com}.         
. gen DayDMuMeRaA01S00 = DayDeaMeRaA01S00 * DayCbDMeRaA01S00
{txt}(1 missing value generated)

{com}. label var DayDMuMeRaA01S00 "Daily deaths scaled (times means of cases by deaths) only for visualization DELP"
{txt}
{com}. summ DayDMuMeRaA01S00   

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        166    321656.6    .0048509   321656.6   321656.6
{txt}
{com}. 
. 
. 
. 
. ******************
.         
. * smooth 
. 
. encode loc_grand_name, gen(loc_grand_name_encoded)
{txt}
{com}. 
. tsset loc_grand_name_encoded date, daily   
{res}{txt}{col 8}panel variable:  {res}loc_grand_name_encoded (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}date, 30Sep2021 to 15Mar2022
{txt}{col 17}delta:  {res}1 day
{txt}
{com}. 
. qui {c -(}
{txt}
{com}. *
. 
. 
. order date loc_grand_name       
{txt}
{com}. sort date
{txt}
{com}. 
. 
. qui compress
{txt}
{com}. save "DELP EURO.dta", replace
{txt}file DELP EURO.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *****************************
. 
. * gen SEARO
. 
. use "DELP.dta", clear
{txt}
{com}. 
. keep if ///
> loc_grand_name == "Bangladesh" | ///
> loc_grand_name == "Bhutan" | ///
> loc_grand_name == "India" | ///
> loc_grand_name == "Indonesia" | ///
> loc_grand_name == "Maldives" | ///
> loc_grand_name == "Nepal" | ///
> loc_grand_name == "Sri Lanka" | ///
> loc_grand_name == "Thailand"  
{txt}(38,744 observations deleted)

{com}. 
. drop continent province loc_grand_name
{txt}
{com}. 
. collapse (sum) totaldetected-totaldetecteddeathsub, by(day)
{txt}
{com}. 
. gen loc_grand_name = "SEARO"
{txt}
{com}. 
. 
. rename day date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22553{txt},{res}22719{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}30sep2021{txt},{res}15mar2022{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}167{col 51}{txt}missing .:  {res}0{txt}/{res}167

{txt}{col 19}mean:{res}{col 26}   22636{txt} = {res}22dec2021{txt}
{col 15}std. dev:{res}{col 26} 48.3529

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   22569{col 37}   22594{col 47}   22636{col 57}   22678{col 67}   22703
{col 26}16oct2021{col 36}10nov2021{col 46}22dec2021{col 56}02feb2022{col 66}27feb2022
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. * rename outcome variables
. 
. 
. * total vars
. 
. rename totaldetecteddeaths   TotDeaMeRaA01S00
{res}{txt}
{com}. rename totaldetecteddeathslb TotDeaLoRaA01S00
{res}{txt}
{com}. rename totaldetecteddeathsub TotDeaUpRaA01S00
{res}{txt}
{com}. 
. label var TotDeaMeRaA01S00 "Total Deaths Mean DELP S0"
{txt}
{com}. label var TotDeaMeRaA01S00 "Total Deaths Lower DELP S0"
{txt}
{com}. label var TotDeaMeRaA01S00 "Total Deaths Upper DELP S0"
{txt}
{com}. 
. rename totaldetected   TotCasMeRaA01S00
{res}{txt}
{com}. rename totaldetectedlb TotCasLoRaA01S00
{res}{txt}
{com}. rename totaldetectedub TotCasUpRaA01S00
{res}{txt}
{com}. 
. label var TotCasMeRaA01S00 "Total Cases Mean DELP S0"
{txt}
{com}. label var TotCasMeRaA01S00 "Total Cases Lower DELP S0"
{txt}
{com}. label var TotCasMeRaA01S00 "Total Cases Upper DELP S0"
{txt}
{com}. 
. 
. * gen daily vars and rename
. 
. sort date
{txt}
{com}. 
. gen DayDeaMeRaA01S00 =  TotDeaMeRaA01S00[_n] - TotDeaMeRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. gen DayDeaLoRaA01S00 =  TotDeaLoRaA01S00[_n] - TotDeaLoRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. gen DayDeaUpRaA01S00 =  TotDeaUpRaA01S00[_n] - TotDeaUpRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. gen DayCasMeRaA01S00 =  TotCasMeRaA01S00[_n] - TotCasMeRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. gen DayCasLoRaA01S00 =  TotCasLoRaA01S00[_n] - TotCasLoRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. gen DayCasUpRaA01S00 =  TotCasUpRaA01S00[_n] - TotCasUpRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. 
. label var DayDeaMeRaA01S00 "Daily Deaths Mean DELP S0"
{txt}
{com}. label var DayDeaLoRaA01S00 "Daily Deaths Lower DELP S0"
{txt}
{com}. label var DayDeaUpRaA01S00 "Daily Deaths Upper DELP S0"
{txt}
{com}. 
. label var DayCasMeRaA01S00 "Daily Cases Mean DELP S0"
{txt}
{com}. label var DayCasLoRaA01S00 "Daily Cases Lower DELP S0"
{txt}
{com}. label var DayCasUpRaA01S00 "Daily Cases Upper DELP S0"
{txt}
{com}. 
. label var TotDeaMeRaA01S00 "Total Deaths Mean DELP S0"
{txt}
{com}. label var TotDeaLoRaA01S00 "Total Deaths Lower DELP S0"
{txt}
{com}. label var TotDeaUpRaA01S00 "Total Deaths Upper DELP S0"
{txt}
{com}. 
. label var TotCasMeRaA01S00 "Total Cases Mean DELP S0"
{txt}
{com}. label var TotCasLoRaA01S00 "Total Cases Lower DELP S0"
{txt}
{com}. label var TotCasUpRaA01S00 "Total Cases Upper DELP S0"
{txt}
{com}. 
. 
. * 
. 
. * other outcomes
. 
. * active activehospitalized activeventilated cumulativehospitalized
. 
. /*
> ***********************
> * rename convention
> 
> active                                  Act
> 
> activehospitalized              Hos
> 
> activeventilated                Ven
> 
> cumulativehospitalized  Hos
> 
> */
. 
. 
. rename active DayActMeRaA01S00
{res}{txt}
{com}. 
. rename activehospitalized DayHosMeRaA01S00
{res}{txt}
{com}. 
. rename activeventilated DayVenMeRaA01S00
{res}{txt}
{com}. 
. rename cumulativehospitalized TotHosMeRaA01S00
{res}{txt}
{com}. 
. label var DayActMeRaA01S00 "Daily Cases Active Mean DELP S0"
{txt}
{com}. 
. label var DayHosMeRaA01S00 "Daily Cases Active Hospitalized Mean DELP S0"
{txt}
{com}. 
. label var DayVenMeRaA01S00 "Daily Cases Active Ventilated Mean DELP S0"
{txt}
{com}. 
. label var TotHosMeRaA01S00 "Total Cases Active Mean DELP S0"
{txt}
{com}. 
.  
. 
. keep ///
> loc_grand_name date ///
> TotDeaMeRaA01S00 TotDeaLoRaA01S00 TotDeaUpRaA01S00 ///
> DayDeaMeRaA01S00 DayDeaLoRaA01S00 DayDeaUpRaA01S00 ///
> TotCasMeRaA01S00 TotCasLoRaA01S00 TotCasUpRaA01S00 ///
> DayCasMeRaA01S00 DayCasLoRaA01S00 DayCasUpRaA01S00 ///
> DayActMeRaA01S00 DayHosMeRaA01S00 DayVenMeRaA01S00 TotHosMeRaA01S00
{txt}
{com}. 
. 
. order ///
> loc_grand_name date ///
> TotDeaMeRaA01S00 TotDeaLoRaA01S00 TotDeaUpRaA01S00 ///
> DayDeaMeRaA01S00 DayDeaLoRaA01S00 DayDeaUpRaA01S00 ///
> TotCasMeRaA01S00 TotCasLoRaA01S00 TotCasUpRaA01S00 ///
> DayCasMeRaA01S00 DayCasLoRaA01S00 DayCasUpRaA01S00 ///
> DayActMeRaA01S00 DayHosMeRaA01S00 DayVenMeRaA01S00 TotHosMeRaA01S00
{txt}
{com}. 
. 
. 
. * gen cfr
. 
. gen DayCfrMeRaA01S00 = 100 * DayDeaMeRaA01S00 / DayCasMeRaA01S00
{txt}(1 missing value generated)

{com}. gen DayCfrLoRaA01S00 = 100 * DayDeaLoRaA01S00 / DayCasLoRaA01S00
{txt}(1 missing value generated)

{com}. gen DayCfrUpRaA01S00 = 100 * DayDeaUpRaA01S00 / DayCasUpRaA01S00
{txt}(1 missing value generated)

{com}. 
. label var DayCfrMeRaA01S00 "Daily CFR Mean DELP S0"
{txt}
{com}. label var DayCfrLoRaA01S00 "Daily CFR Lower DELP S0"
{txt}
{com}. label var DayCfrUpRaA01S00 "Daily CFR Upper DELP S0"
{txt}
{com}. 
. 
. 
. 
. *
. 
. 
. 
. 
. 
. * gen "Daily cases mean div by daily deaths mean DELP DayCbD" for visulization of temporal relation of deaths and cases peaks 
. 
. 
. summ DayDeaMeRaA01S00 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        166    309.9096    194.0858          7        520
{txt}
{com}. gen DayDeMMeRaA01S00 = r(mean)
{txt}
{com}. label var DayDeMMeRaA01S00 "Daily deaths mean DELP DayDeM"
{txt}
{com}. 
. summ DayCasMeRaA01S00 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        166    12738.98    11012.89        146      40978
{txt}
{com}. gen DayCaMMeRaA01S00 = r(mean)
{txt}
{com}. label var DayCaMMeRaA01S00 "Daily cases mean DELP DayCaM"
{txt}
{com}.                               
. gen DayCbDMeRaA01S00 = DayCaMMeRaA01S00 / DayDeaMeRaA01S00
{txt}(1 missing value generated)

{com}. label var DayCbDMeRaA01S00 "Daily cases mean div by daily deaths mean DELP DayCbD"
{txt}
{com}. summ DayCbDMeRaA01S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        166    172.7263    311.6268   24.49804   1819.854
{txt}
{com}.         
. gen DayDMuMeRaA01S00 = DayDeaMeRaA01S00 * DayCbDMeRaA01S00
{txt}(1 missing value generated)

{com}. label var DayDMuMeRaA01S00 "Daily deaths scaled (times means of cases by deaths) only for visualization DELP"
{txt}
{com}. summ DayDMuMeRaA01S00   

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        166    12738.98    .0003004   12738.98   12738.98
{txt}
{com}. 
. 
. 
. 
. ******************
.         
. * smooth 
. 
. encode loc_grand_name, gen(loc_grand_name_encoded)
{txt}
{com}. 
. tsset loc_grand_name_encoded date, daily   
{res}{txt}{col 8}panel variable:  {res}loc_grand_name_encoded (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}date, 30Sep2021 to 15Mar2022
{txt}{col 17}delta:  {res}1 day
{txt}
{com}. 
. qui {c -(}
{txt}
{com}. *
. 
. 
. order date loc_grand_name       
{txt}
{com}. sort date
{txt}
{com}. 
. 
. qui compress
{txt}
{com}. save "DELP SEARO.dta", replace
{txt}file DELP SEARO.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *****************************
. 
. * gen WPRO
. 
. use "DELP.dta", clear
{txt}
{com}. 
. keep if ///
> loc_grand_name == "Australia" | ///
> loc_grand_name == "Cambodia" | ///
> loc_grand_name == "Japan" | ///
> loc_grand_name == "Korea, South" | ///
> loc_grand_name == "Malaysia" | ///
> loc_grand_name == "Mongolia" | ///
> loc_grand_name == "New Zealand" | ///
> loc_grand_name == "Papua New Guinea" | ///
> loc_grand_name == "Philippines" | ///
> loc_grand_name == "Singapore" | ///
> loc_grand_name == "Vietnam" 
{txt}(37,074 observations deleted)

{com}. 
. drop continent province loc_grand_name
{txt}
{com}. 
. collapse (sum) totaldetected-totaldetecteddeathsub, by(day)
{txt}
{com}. 
. gen loc_grand_name = "WPRO"
{txt}
{com}. 
. 
. rename day date_original
{res}{txt}
{com}. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22553{txt},{res}22719{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}30sep2021{txt},{res}15mar2022{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}167{col 51}{txt}missing .:  {res}0{txt}/{res}167

{txt}{col 19}mean:{res}{col 26}   22636{txt} = {res}22dec2021{txt}
{col 15}std. dev:{res}{col 26} 48.3529

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   22569{col 37}   22594{col 47}   22636{col 57}   22678{col 67}   22703
{col 26}16oct2021{col 36}10nov2021{col 46}22dec2021{col 56}02feb2022{col 66}27feb2022
{txt}
{com}. drop year month day date2 date_original
{txt}
{com}. 
. * rename outcome variables
. 
. 
. * total vars
. 
. rename totaldetecteddeaths   TotDeaMeRaA01S00
{res}{txt}
{com}. rename totaldetecteddeathslb TotDeaLoRaA01S00
{res}{txt}
{com}. rename totaldetecteddeathsub TotDeaUpRaA01S00
{res}{txt}
{com}. 
. label var TotDeaMeRaA01S00 "Total Deaths Mean DELP S0"
{txt}
{com}. label var TotDeaMeRaA01S00 "Total Deaths Lower DELP S0"
{txt}
{com}. label var TotDeaMeRaA01S00 "Total Deaths Upper DELP S0"
{txt}
{com}. 
. rename totaldetected   TotCasMeRaA01S00
{res}{txt}
{com}. rename totaldetectedlb TotCasLoRaA01S00
{res}{txt}
{com}. rename totaldetectedub TotCasUpRaA01S00
{res}{txt}
{com}. 
. label var TotCasMeRaA01S00 "Total Cases Mean DELP S0"
{txt}
{com}. label var TotCasMeRaA01S00 "Total Cases Lower DELP S0"
{txt}
{com}. label var TotCasMeRaA01S00 "Total Cases Upper DELP S0"
{txt}
{com}. 
. 
. * gen daily vars and rename
. 
. sort date
{txt}
{com}. 
. gen DayDeaMeRaA01S00 =  TotDeaMeRaA01S00[_n] - TotDeaMeRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. gen DayDeaLoRaA01S00 =  TotDeaLoRaA01S00[_n] - TotDeaLoRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. gen DayDeaUpRaA01S00 =  TotDeaUpRaA01S00[_n] - TotDeaUpRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. gen DayCasMeRaA01S00 =  TotCasMeRaA01S00[_n] - TotCasMeRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. gen DayCasLoRaA01S00 =  TotCasLoRaA01S00[_n] - TotCasLoRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. gen DayCasUpRaA01S00 =  TotCasUpRaA01S00[_n] - TotCasUpRaA01S00[_n-1]
{txt}(1 missing value generated)

{com}. 
. 
. label var DayDeaMeRaA01S00 "Daily Deaths Mean DELP S0"
{txt}
{com}. label var DayDeaLoRaA01S00 "Daily Deaths Lower DELP S0"
{txt}
{com}. label var DayDeaUpRaA01S00 "Daily Deaths Upper DELP S0"
{txt}
{com}. 
. label var DayCasMeRaA01S00 "Daily Cases Mean DELP S0"
{txt}
{com}. label var DayCasLoRaA01S00 "Daily Cases Lower DELP S0"
{txt}
{com}. label var DayCasUpRaA01S00 "Daily Cases Upper DELP S0"
{txt}
{com}. 
. label var TotDeaMeRaA01S00 "Total Deaths Mean DELP S0"
{txt}
{com}. label var TotDeaLoRaA01S00 "Total Deaths Lower DELP S0"
{txt}
{com}. label var TotDeaUpRaA01S00 "Total Deaths Upper DELP S0"
{txt}
{com}. 
. label var TotCasMeRaA01S00 "Total Cases Mean DELP S0"
{txt}
{com}. label var TotCasLoRaA01S00 "Total Cases Lower DELP S0"
{txt}
{com}. label var TotCasUpRaA01S00 "Total Cases Upper DELP S0"
{txt}
{com}. 
. 
. * 
. 
. * other outcomes
. 
. * active activehospitalized activeventilated cumulativehospitalized
. 
. /*
> ***********************
> * rename convention
> 
> active                                  Act
> 
> activehospitalized              Hos
> 
> activeventilated                Ven
> 
> cumulativehospitalized  Hos
> 
> */
. 
. 
. rename active DayActMeRaA01S00
{res}{txt}
{com}. 
. rename activehospitalized DayHosMeRaA01S00
{res}{txt}
{com}. 
. rename activeventilated DayVenMeRaA01S00
{res}{txt}
{com}. 
. rename cumulativehospitalized TotHosMeRaA01S00
{res}{txt}
{com}. 
. label var DayActMeRaA01S00 "Daily Cases Active Mean DELP S0"
{txt}
{com}. 
. label var DayHosMeRaA01S00 "Daily Cases Active Hospitalized Mean DELP S0"
{txt}
{com}. 
. label var DayVenMeRaA01S00 "Daily Cases Active Ventilated Mean DELP S0"
{txt}
{com}. 
. label var TotHosMeRaA01S00 "Total Cases Active Mean DELP S0"
{txt}
{com}. 
.  
. 
. keep ///
> loc_grand_name date ///
> TotDeaMeRaA01S00 TotDeaLoRaA01S00 TotDeaUpRaA01S00 ///
> DayDeaMeRaA01S00 DayDeaLoRaA01S00 DayDeaUpRaA01S00 ///
> TotCasMeRaA01S00 TotCasLoRaA01S00 TotCasUpRaA01S00 ///
> DayCasMeRaA01S00 DayCasLoRaA01S00 DayCasUpRaA01S00 ///
> DayActMeRaA01S00 DayHosMeRaA01S00 DayVenMeRaA01S00 TotHosMeRaA01S00
{txt}
{com}. 
. 
. order ///
> loc_grand_name date ///
> TotDeaMeRaA01S00 TotDeaLoRaA01S00 TotDeaUpRaA01S00 ///
> DayDeaMeRaA01S00 DayDeaLoRaA01S00 DayDeaUpRaA01S00 ///
> TotCasMeRaA01S00 TotCasLoRaA01S00 TotCasUpRaA01S00 ///
> DayCasMeRaA01S00 DayCasLoRaA01S00 DayCasUpRaA01S00 ///
> DayActMeRaA01S00 DayHosMeRaA01S00 DayVenMeRaA01S00 TotHosMeRaA01S00
{txt}
{com}. 
. 
. 
. * gen cfr
. 
. gen DayCfrMeRaA01S00 = 100 * DayDeaMeRaA01S00 / DayCasMeRaA01S00
{txt}(1 missing value generated)

{com}. gen DayCfrLoRaA01S00 = 100 * DayDeaLoRaA01S00 / DayCasLoRaA01S00
{txt}(1 missing value generated)

{com}. gen DayCfrUpRaA01S00 = 100 * DayDeaUpRaA01S00 / DayCasUpRaA01S00
{txt}(1 missing value generated)

{com}. 
. label var DayCfrMeRaA01S00 "Daily CFR Mean DELP S0"
{txt}
{com}. label var DayCfrLoRaA01S00 "Daily CFR Lower DELP S0"
{txt}
{com}. label var DayCfrUpRaA01S00 "Daily CFR Upper DELP S0"
{txt}
{com}. 
. 
. 
. 
. *
. 
. 
. 
. 
. 
. * gen "Daily cases mean div by daily deaths mean DELP DayCbD" for visulization of temporal relation of deaths and cases peaks 
. 
. 
. summ DayDeaMeRaA01S00 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        166     361.988     110.392        108        457
{txt}
{com}. gen DayDeMMeRaA01S00 = r(mean)
{txt}
{com}. label var DayDeMMeRaA01S00 "Daily deaths mean DELP DayDeM"
{txt}
{com}. 
. summ DayCasMeRaA01S00 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        166    64623.38    68882.76      18180     256565
{txt}
{com}. gen DayCaMMeRaA01S00 = r(mean)
{txt}
{com}. label var DayCaMMeRaA01S00 "Daily cases mean DELP DayCaM"
{txt}
{com}.                               
. gen DayCbDMeRaA01S00 = DayCaMMeRaA01S00 / DayDeaMeRaA01S00
{txt}(1 missing value generated)

{com}. label var DayCbDMeRaA01S00 "Daily cases mean div by daily deaths mean DELP DayCbD"
{txt}
{com}. summ DayCbDMeRaA01S00

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        166    213.1938    119.5954   141.4078   598.3646
{txt}
{com}.         
. gen DayDMuMeRaA01S00 = DayDeaMeRaA01S00 * DayCbDMeRaA01S00
{txt}(1 missing value generated)

{com}. label var DayDMuMeRaA01S00 "Daily deaths scaled (times means of cases by deaths) only for visualization DELP"
{txt}
{com}. summ DayDMuMeRaA01S00   

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        166    64623.38    .0023941   64623.38   64623.38
{txt}
{com}. 
. 
. 
. 
. ******************
.         
. * smooth 
. 
. encode loc_grand_name, gen(loc_grand_name_encoded)
{txt}
{com}. 
. tsset loc_grand_name_encoded date, daily   
{res}{txt}{col 8}panel variable:  {res}loc_grand_name_encoded (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}date, 30Sep2021 to 15Mar2022
{txt}{col 17}delta:  {res}1 day
{txt}
{com}. 
. qui {c -(}
{txt}
{com}. *
. 
. 
. order date loc_grand_name       
{txt}
{com}. sort date
{txt}
{com}. 
. 
. qui compress
{txt}
{com}. save "DELP WPRO.dta", replace
{txt}file DELP WPRO.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. ******************
. 
. * append regions
. 
. use "DELP GLOBAL.dta", clear 
{txt}
{com}. 
. local list2 AFRO AMRO EMRO EURO SEARO WPRO
{txt}
{com}. 
. foreach region of local list2 {c -(}
{txt}  2{com}. 
.         append using "DELP `region'.dta"
{txt}  3{com}.         
. {c )-}
{txt}(label loc_grand_name_encoded already defined)
(label loc_grand_name_encoded already defined)
(label loc_grand_name_encoded already defined)
(label loc_grand_name_encoded already defined)
(label loc_grand_name_encoded already defined)
(label loc_grand_name_encoded already defined)

{com}. *
. 
. 
. 
. 
. 
. 
. * gen vars by location 
. 
. foreach var of varlist ///
> TotDeaMeRaA01S00        TotDeaLoRaA01S00        TotDeaUpRaA01S00        DayDeaMeRaA01S00        DayDeaLoRaA01S00        DayDeaUpRaA01S00 ///
> TotCasMeRaA01S00        TotCasLoRaA01S00        TotCasUpRaA01S00        DayCasMeRaA01S00        DayCasLoRaA01S00        DayCasUpRaA01S00 ///
> DayActMeRaA01S00        DayHosMeRaA01S00        DayVenMeRaA01S00        TotHosMeRaA01S00        DayCfrMeRaA01S00        DayCfrLoRaA01S00 ///
> DayCfrUpRaA01S00        DayDeMMeRaA01S00        DayCaMMeRaA01S00        DayCbDMeRaA01S00        DayDMuMeRaA01S00 {c -(}
{txt}  2{com}. 
. 
.         qui gen `var'AFRO = `var' 
{txt}  3{com}.         qui replace `var'AFRO = . if loc_grand_name != "AFRO"
{txt}  4{com}.         
.         qui gen `var'AMRO = `var'
{txt}  5{com}.         qui replace `var'AMRO = . if loc_grand_name != "AMRO"
{txt}  6{com}.         
.         qui gen `var'EMRO = `var'
{txt}  7{com}.         qui replace `var'EMRO = . if loc_grand_name != "EMRO"
{txt}  8{com}.         
.         qui gen `var'EURO = `var'
{txt}  9{com}.         qui replace `var'EURO = . if loc_grand_name != "EURO"
{txt} 10{com}.         
.         qui gen `var'GLOBAL = `var'
{txt} 11{com}.         qui replace `var'GLOBAL = . if loc_grand_name != " GLOBAL"
{txt} 12{com}.         
.         qui gen `var'SEARO = `var'
{txt} 13{com}.         qui replace `var'SEARO = . if loc_grand_name != "SEARO"
{txt} 14{com}.         
.         qui gen `var'WPRO = `var'
{txt} 15{com}.         qui replace `var'WPRO = . if loc_grand_name != "WPRO"
{txt} 16{com}.         
.         
.         label var `var'AFRO "`var' AFRO"
{txt} 17{com}.         label var `var'AMRO "`var' AMRO"
{txt} 18{com}.         label var `var'EMRO "`var' EMRO"
{txt} 19{com}.         label var `var'EURO "`var' EURO"
{txt} 20{com}.         label var `var'GLOBAL "`var' GLOBAL"
{txt} 21{com}.         label var `var'SEARO "`var' SEARO"
{txt} 22{com}.         label var `var'WPRO "`var' WPRO"
{txt} 23{com}. 
.                                 
. {c )-}
{txt}
{com}. *
. 
. 
. 
. 
. sort date loc_grand_name
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "CovidVisualizedGlobal DELP.dta", replace
{txt}file CovidVisualizedGlobal DELP.dta saved

{com}. 
. 
. 
. 
. 
. ***********************
. 
. * graphs
. 
. 
. grstyle init
{res}{txt}
{com}. 
. grstyle color background white
{txt}
{com}. 
. 
. 
. local list2 GLOBAL AFRO AMRO EMRO EURO SEARO WPRO
{txt}
{com}. 
. foreach region of local list2 {c -(}
{txt}  2{com}. 
.         
. 
.         * daily deaths wo CI
.         
.         twoway  ///
>         (line DayDeaMeRaA01S00`region' date, sort lcolor(red)) ///
>         , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
>         xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
>         ytitle(Daily deaths) title("COVID-19 daily deaths, `region', DELP, single scenario", size(medium)) ///
>         xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) ///
>                    
{txt}  3{com}.         qui graph save "graph `region' 1 COVID-19 daily deaths, `region', DELP wo CI.gph", replace
{txt}  4{com}.         qui graph export "graph `region' 1 COVID-19 daily deaths, `region', DELP wo CI.pdf", replace
{txt}  5{com}.         
.         
.         
.         
.         * daily deaths with CI
.         
.         twoway (rarea DayDeaLoRaA01S00`region' DayDeaUpRaA01S00`region' date, sort color(green*.2)) ///
>         (line DayDeaMeRaA01S00`region' date, sort lcolor(green)) ///
>         , legend(off) ///          
>         xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
>         xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
>         ytitle(Daily deaths) title("COVID-19 daily deaths, `region', DELP, single scenario", size(medium)) ///
>         xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
>         subtitle("with confidence limits", size(small)) 
{txt}  6{com}.                    
.         qui graph save "graph `region' 2 COVID-19 daily deaths, `region', DELP with CI.gph", replace
{txt}  7{com}.         qui graph export "graph `region' 2 COVID-19 daily deaths, `region', DELP with CI.pdf", replace
{txt}  8{com}.         
.         
.         
.         
.         * total deaths wo CI 
.         
.         twoway  ///
>         (line TotDeaMeRaA01S00`region' date, sort lcolor(green)) ///
>         , legend(off) ///          
>         xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
>         xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
>         ytitle(Total deaths) title("COVID-19 total deaths, `region', DELP, single scenario", size(medium)) ///
>         xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand)
{txt}  9{com}.         
.         qui graph save "graph 3 `region' COVID-19 total deaths, `region', DELP wo CI.gph", replace
{txt} 10{com}.         qui graph export "graph `region' 3 COVID-19 total deaths, `region', DELP wo CI.pdf", replace
{txt} 11{com}.         
.         
.         
.         
.         * total deaths with CI 
.         
.         twoway (rarea TotDeaLoRaA01S00`region' TotDeaUpRaA01S00`region' date, sort color(green*.2)) ///
>         (line TotDeaMeRaA01S00`region' date, sort lcolor(green)) ///
>         , legend(off) ///          
>         xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
>         xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
>         ytitle(Total deaths) title("COVID-19 total deaths, `region', DELP, single scenario", size(medium)) ///
>         xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
>         subtitle("with confidence limits", size(small)) 
{txt} 12{com}.                 
.         qui graph save "graph `region' 4 COVID-19 total deaths, `region', DELP with CI.gph", replace
{txt} 13{com}.         qui graph export "graph `region' 4 COVID-19 total deaths, `region', DELP with CI.pdf", replace
{txt} 14{com}.         
.         
.         
.         
.         * daily cases wo CI
.         
.         twoway ///
>         (line DayCasMeRaA01S00`region' date, sort lcolor(green)) ///
>         , legend(off) ///          
>         xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
>         xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
>         ytitle(Daily cases) title("COVID-19 daily cases, `region', DELP, single scenario", size(medium)) ///
>         xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand)        
{txt} 15{com}.         
.         qui graph save "graph `region' 5 COVID-19 daily cases, `region', DELP wo CI.gph", replace
{txt} 16{com}.         qui graph export "graph `region' 5 COVID-19 daily cases, `region', DELP wo CI.pdf", replace
{txt} 17{com}.         
.         
.         
.         
.         * daily cases with CI
.         
.         twoway (rarea DayCasLoRaA01S00`region' DayCasUpRaA01S00`region' date, sort color(green*.2)) ///
>         (line DayCasMeRaA01S00`region' date, sort lcolor(green)) ///
>         , legend(off) ///          
>         xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
>         xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
>         ytitle(Daily cases) title("COVID-19 daily cases, `region', DELP, single scenario", size(medium)) ///
>         xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
>         subtitle("with confidence limits", size(small)) 
{txt} 18{com}.         
.         qui graph save "graph `region' 6 COVID-19 daily cases, `region', DELP with CI.gph", replace
{txt} 19{com}.         qui graph export "graph `region' 6 COVID-19 daily cases, `region', DELP with CI.pdf", replace
{txt} 20{com}.         
.         
.         
.         
.         * total cases wo CI
.         
.         twoway ///
>         (line TotCasMeRaA01S00`region' date, sort lcolor(green)) ///
>         , legend(off) ///          
>         xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
>         xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
>         ytitle(Total cases) title("COVID-19 total cases, `region', DELP, single scenario", size(medium)) ///
>         xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand)        
{txt} 21{com}.         
.         qui graph save "graph `region' 7 COVID-19 total cases, `region', DELP wo CI.gph", replace
{txt} 22{com}.         qui graph export "graph `region' 7 COVID-19 total cases, `region', DELP wo CI.pdf", replace
{txt} 23{com}.         
.         
.         
.         
.         * total cases with CI
.         
.         twoway (rarea TotCasLoRaA01S00`region' TotCasUpRaA01S00`region' date, sort color(green*.2)) ///
>         (line TotCasMeRaA01S00`region' date, sort lcolor(green)) ///
>         , legend(off) ///          
>         xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
>         xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
>         ytitle(Total cases) title("COVID-19 total cases, `region', DELP, single scenario", size(medium)) ///
>         xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
>         subtitle("with confidence limits", size(small)) 
{txt} 24{com}.                 
.         qui graph save "graph `region' 8 COVID-19 total cases, `region', DELP with CI.gph", replace
{txt} 25{com}.         qui graph export "graph `region' 8 COVID-19 total cases, `region', DELP with CI.pdf", replace
{txt} 26{com}.         
.         
.         
.         
.         * daily cfr 
.         
.         twoway (rarea DayCfrLoRaA01S00`region' DayCfrUpRaA01S00`region' date, sort color(green*.2)) ///
>         (line DayCfrMeRaA01S00`region' date, sort lcolor(green)) ///
>         , legend(off) ///          
>         xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
>         xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
>         ytitle(Daily cases) title("COVID-19 daily CFR, `region', DELP, single scenario", size(medium)) ///
>         xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand)        
{txt} 27{com}.         
.         qui graph save "graph `region' 9 COVID-19 daily CFR, `region', DELP.gph", replace
{txt} 28{com}.         qui graph export "graph `region' 9 COVID-19 daily CFR, `region', DELP.pdf", replace
{txt} 29{com}.         
.         
.         
.         
.         * daily cases active, active hospitalized, active ventilated
.         
.         twoway ///
>         (line DayActMeRaA01S00`region' date, sort lcolor(green)) ///
>         (line DayHosMeRaA01S00`region' date, sort lcolor(black)) ///
>         (line DayVenMeRaA01S00`region' date, sort lcolor(red)) ///
>         , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
>         xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
>         ytitle(Daily outcome) title("COVID-19 daily cases, `region', DELP, single scenario", size(medium)) ///
>         xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
>         legend(order(1 "Active cases" 2 "Active hospitalized" 3 "Active ventilated") rows(1)) ///
>         subtitle("active cases, active hospitalized, active ventilated", size(small))   
{txt} 30{com}.                    
.         qui graph save "graph `region' 10 COVID-19 daily cases etc, `region', DELP wo CI.gph", replace
{txt} 31{com}.         qui graph export "graph `region' 10 COVID-19 daily cases etc, `region', DELP wo CI.pdf", replace
{txt} 32{com}.         
.         
.         
.         
.         * daily active hospitalized, active ventilated
.         
.         twoway ///
>         (line DayHosMeRaA01S00`region' date, sort lcolor(black)) ///
>         (line DayVenMeRaA01S00`region' date, sort lcolor(red)) ///
>         , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
>         xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
>         ytitle(Daily outcome) title("COVID-19 daily cases, `region', DELP, single scenario", size(medium)) ///
>         xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
>         legend(order(1 "Active hospitalized" 2 "Active ventilated") rows(1)) ///
>         subtitle("active hospitalized, active ventilated", size(small)) 
{txt} 33{com}.         
.         qui graph save "graph `region' 11 COVID-19 daily cases etc, `region', DELP wo CI.gph", replace
{txt} 34{com}.         qui graph export "graph `region' 11 COVID-19 daily cases etc, `region', DELP wo CI.pdf", replace
{txt} 35{com}.         
.         
.         
.         
.         ** DayCas DayDea DayDea_multip
.         
.         twoway ///
>         (line DayCasMeRaA01S00`region' date, sort lcolor(blue)) ///
>         (line DayDeaMeRaA01S00`region' date, sort lcolor(red)) ///
>         (line DayDMuMeRaA01S00`region' date, sort lpattern(dot) lcolor(red)) ///
>         if date > td(01jan2020) ///
>         , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
>         xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
>         ytitle(Daily cases and deaths) title("COVID-19 daily cases and deaths, `region', DELP", size(medium)) ///
>         xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) yscale(titlegap(4)) legend(region(lcolor(none)))  ///
>         legend(order(1 "Daily cases" 2 "Daily deaths" 3 "Daily deaths scaled for visualization") size(small)) ///
>         subtitle("Daily deaths, scaled = times (means of cases divided by deaths) for visualization only", size(small)) ///
>         note("Single scenario, mean estimate")
{txt} 36{com}.         
.         qui graph save "graph `region' 12 COVID-19 daily deaths and cases `region', DELP.gph", replace
{txt} 37{com}.         qui graph export "graph `region' 12 COVID-19 daily deaths and cases `region', DELP.pdf", replace
{txt} 38{com}.         
. 
. {c )-}
{res}{txt}
{com}. *
. 
. 
. 
. 
. *******************************
. 
. * regions together
. 
. 
. 
. 
. * daily deaths, with GLOBAL
. 
. twoway ///
> (line DayDeaMeRaA01S00AFRO date, sort lcolor(brown)) ///
> (line DayDeaMeRaA01S00AMRO date, sort lcolor(red)) ///
> (line DayDeaMeRaA01S00EMRO date, sort lcolor(gold)) ///
> (line DayDeaMeRaA01S00EURO date, sort lcolor(green)) ///
> (line DayDeaMeRaA01S00SEARO date, sort lcolor(cyan)) ///
> (line DayDeaMeRaA01S00WPRO date, sort lcolor(blue)) ///
> (line DayDeaMeRaA01S00GLOBAL date, sort lcolor(black) lwidth(thick)) ///
> , xtitle(Date) xlabel(#24, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(forty_five)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, WHO regions, DELP", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "AFRO" 2 "AMRO" 3 "EMRO" 4 "EURO" 5 "SEARO" 6 "WPRO" 7 "GLOBAL") size(small) rows (2)) ///
> subtitle("with GLOBAL", size(small))
{res}{txt}
{com}. 
. qui qui graph save "graph 1a COVID-19 daily deaths, regions together, DELP.gph", replace
{txt}
{com}. qui qui graph export "graph 1a COVID-19 daily deaths, regions together, DELP.pdf", replace
{txt}
{com}. 
. 
. 
. 
. * daily deaths, without GLOBAL
. 
. twoway ///
> (line DayDeaMeRaA01S00AFRO date, sort lcolor(brown)) ///
> (line DayDeaMeRaA01S00AMRO date, sort lcolor(red)) ///
> (line DayDeaMeRaA01S00EMRO date, sort lcolor(gold)) ///
> (line DayDeaMeRaA01S00EURO date, sort lcolor(green)) ///
> (line DayDeaMeRaA01S00SEARO date, sort lcolor(cyan)) ///
> (line DayDeaMeRaA01S00WPRO date, sort lcolor(blue)) ///
> , xtitle(Date) xlabel(#24, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(forty_five)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, WHO regions, DELP", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "AFRO" 2 "AMRO" 3 "EMRO" 4 "EURO" 5 "SEARO" 6 "WPRO") size(small) rows (2)) ///
> subtitle("without GLOBAL", size(small))
{res}{txt}
{com}. 
. qui qui graph save "graph 1b COVID-19 daily deaths, regions together wo global, DELP.gph", replace
{txt}
{com}. qui qui graph export "graph 1b COVID-19 daily deaths, regions together wo global, DELP.pdf", replace
{txt}
{com}. 
. 
. 
. 
. * daily cases, with GLOBAL
. 
. twoway ///
> (line DayCasMeRaA01S00AFRO date, sort lcolor(brown)) ///
> (line DayCasMeRaA01S00AMRO date, sort lcolor(red)) ///
> (line DayCasMeRaA01S00EMRO date, sort lcolor(gold)) ///
> (line DayCasMeRaA01S00EURO date, sort lcolor(green)) ///
> (line DayCasMeRaA01S00SEARO date, sort lcolor(cyan)) ///
> (line DayCasMeRaA01S00WPRO date, sort lcolor(blue)) ///
> (line DayCasMeRaA01S00GLOBAL date, sort lcolor(black) lwidth(thick)) ///
> , xtitle(Date) xlabel(#24, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(forty_five)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, WHO regions, DELP", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "AFRO" 2 "AMRO" 3 "EMRO" 4 "EURO" 5 "SEARO" 6 "WPRO" 7 "GLOBAL") size(small) rows (2)) ///
> subtitle("with GLOBAL", size(small))
{res}{txt}
{com}. 
. qui qui graph save "graph 2a COVID-19 daily cases, regions together, DELP.gph", replace
{txt}
{com}. qui qui graph export "graph 2a COVID-19 daily cases, regions together, DELP.pdf", replace
{txt}
{com}. 
. 
. 
. 
. * daily cases, without GLOBAL
. 
. twoway ///
> (line DayCasMeRaA01S00AFRO date, sort lcolor(brown)) ///
> (line DayCasMeRaA01S00AMRO date, sort lcolor(red)) ///
> (line DayCasMeRaA01S00EMRO date, sort lcolor(gold)) ///
> (line DayCasMeRaA01S00EURO date, sort lcolor(green)) ///
> (line DayCasMeRaA01S00SEARO date, sort lcolor(cyan)) ///
> (line DayCasMeRaA01S00WPRO date, sort lcolor(blue)) ///
> , xtitle(Date) xlabel(#24, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(forty_five)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, WHO regions, DELP", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "AFRO" 2 "AMRO" 3 "EMRO" 4 "EURO" 5 "SEARO" 6 "WPRO") size(small) rows (2)) ///
> subtitle("without GLOBAL", size(small))
{res}{txt}
{com}. 
. qui qui graph save "graph 2b COVID-19 daily cases, regions together wo global, DELP.gph", replace
{txt}
{com}. qui qui graph export "graph 2b COVID-19 daily cases, regions together wo global, DELP.pdf", replace
{txt}
{com}. 
. 
. 
. 
. 
. * total deaths, with GLOBAL
. 
. twoway ///
> (line TotDeaMeRaA01S00AFRO date, sort lcolor(brown)) ///
> (line TotDeaMeRaA01S00AMRO date, sort lcolor(red)) ///
> (line TotDeaMeRaA01S00EMRO date, sort lcolor(gold)) ///
> (line TotDeaMeRaA01S00EURO date, sort lcolor(green)) ///
> (line TotDeaMeRaA01S00SEARO date, sort lcolor(cyan)) ///
> (line TotDeaMeRaA01S00WPRO date, sort lcolor(blue)) ///
> (line TotDeaMeRaA01S00GLOBAL date, sort lcolor(black) lwidth(thick)) ///
> , xtitle(Date) xlabel(#24, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(forty_five)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, WHO regions, DELP", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "AFRO" 2 "AMRO" 3 "EMRO" 4 "EURO" 5 "SEARO" 6 "WPRO" 7 "GLOBAL") size(small) rows (2)) ///
> subtitle("with GLOBAL", size(small))
{res}{txt}
{com}. 
. qui qui graph save "graph 3a COVID-19 total deaths, regions together, DELP.gph", replace
{txt}
{com}. qui qui graph export "graph 3a COVID-19 total deaths, regions together, DELP.pdf", replace
{txt}
{com}. 
. 
. 
. * total deaths, without GLOBAL
. 
. twoway ///
> (line TotDeaMeRaA01S00AFRO date, sort lcolor(brown)) ///
> (line TotDeaMeRaA01S00AMRO date, sort lcolor(red)) ///
> (line TotDeaMeRaA01S00EMRO date, sort lcolor(gold)) ///
> (line TotDeaMeRaA01S00EURO date, sort lcolor(green)) ///
> (line TotDeaMeRaA01S00SEARO date, sort lcolor(cyan)) ///
> (line TotDeaMeRaA01S00WPRO date, sort lcolor(blue)) ///
> , xtitle(Date) xlabel(#24, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(forty_five)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, WHO regions, DELP", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "AFRO" 2 "AMRO" 3 "EMRO" 4 "EURO" 5 "SEARO" 6 "WPRO") size(small) rows (2)) ///
> subtitle("without GLOBAL", size(small))
{res}{txt}
{com}. 
. qui qui graph save "graph 3b COVID-19 total deaths, regions together wo global, DELP.gph", replace
{txt}
{com}. qui qui graph export "graph 3b COVID-19 total deaths, regions together wo global, DELP.pdf", replace
{txt}
{com}. 
. 
. 
. 
. 
. * total cases, with GLOBAL
. 
. twoway ///
> (line TotCasMeRaA01S00AFRO date, sort lcolor(brown)) ///
> (line TotCasMeRaA01S00AMRO date, sort lcolor(red)) ///
> (line TotCasMeRaA01S00EMRO date, sort lcolor(gold)) ///
> (line TotCasMeRaA01S00EURO date, sort lcolor(green)) ///
> (line TotCasMeRaA01S00SEARO date, sort lcolor(cyan)) ///
> (line TotCasMeRaA01S00WPRO date, sort lcolor(blue)) ///
> (line TotCasMeRaA01S00GLOBAL date, sort lcolor(black) lwidth(thick)) ///
> , xtitle(Date) xlabel(#24, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(forty_five)) ///
> ytitle(Total cases) title("COVID-19 total cases, WHO regions, DELP", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "AFRO" 2 "AMRO" 3 "EMRO" 4 "EURO" 5 "SEARO" 6 "WPRO" 7 "GLOBAL") size(small) rows (2)) ///
> subtitle("with GLOBAL", size(small))
{res}{txt}
{com}. 
. qui qui graph save "graph 4a COVID-19 total cases, regions together, DELP.gph", replace
{txt}
{com}. qui qui graph export "graph 4a COVID-19 total cases, regions together, DELP.pdf", replace
{txt}
{com}. 
. 
. 
. * total cases, without GLOBAL
. 
. twoway ///
> (line TotCasMeRaA01S00AFRO date, sort lcolor(brown)) ///
> (line TotCasMeRaA01S00AMRO date, sort lcolor(red)) ///
> (line TotCasMeRaA01S00EMRO date, sort lcolor(gold)) ///
> (line TotCasMeRaA01S00EURO date, sort lcolor(green)) ///
> (line TotCasMeRaA01S00SEARO date, sort lcolor(cyan)) ///
> (line TotCasMeRaA01S00WPRO date, sort lcolor(blue)) ///
> , xtitle(Date) xlabel(#24, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(forty_five)) ///
> ytitle(Total cases) title("COVID-19 total cases, WHO regions, DELP", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "AFRO" 2 "AMRO" 3 "EMRO" 4 "EURO" 5 "SEARO" 6 "WPRO") size(small) rows (2)) ///
> subtitle("without GLOBAL", size(small))
{res}{txt}
{com}. 
. qui qui graph save "graph 4b COVID-19 total cases, regions together wo global, DELP.gph", replace
{txt}
{com}. qui qui graph export "graph 4b COVID-19 total cases, regions together wo global, DELP.pdf", replace
{txt}
{com}. 
. 
. 
. 
. 
. * daily cfr, with GLOBAL
. 
. twoway ///
> (line DayCfrMeRaA01S00AFRO date, sort lcolor(brown)) ///
> (line DayCfrMeRaA01S00AMRO date, sort lcolor(red)) ///
> (line DayCfrMeRaA01S00EMRO date, sort lcolor(gold)) ///
> (line DayCfrMeRaA01S00EURO date, sort lcolor(green)) ///
> (line DayCfrMeRaA01S00SEARO date, sort lcolor(cyan)) ///
> (line DayCfrMeRaA01S00WPRO date, sort lcolor(blue)) ///
> (line DayCfrMeRaA01S00GLOBAL date, sort lcolor(black) lwidth(thick)) ///
> , xtitle(Date) xlabel(#24, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(forty_five)) ///
> ytitle(Daily CFR) title("COVID-19 daily cfr, WHO regions, DELP", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "AFRO" 2 "AMRO" 3 "EMRO" 4 "EURO" 5 "SEARO" 6 "WPRO" 7 "GLOBAL") size(small) rows (2)) ///
> subtitle("with GLOBAL", size(small))
{res}{txt}
{com}. 
. qui qui graph save "graph 5a COVID-19 daily cfr, regions together, DELP.gph", replace
{txt}
{com}. qui qui graph export "graph 5a COVID-19 daily cfr, regions together, DELP.pdf", replace
{txt}
{com}. 
. 
. 
. 
. * daily cfr after 2021, with GLOBAL
. 
. twoway ///
> (line DayCfrMeRaA01S00AFRO date, sort lcolor(brown)) ///
> (line DayCfrMeRaA01S00AMRO date, sort lcolor(red)) ///
> (line DayCfrMeRaA01S00EMRO date, sort lcolor(gold)) ///
> (line DayCfrMeRaA01S00EURO date, sort lcolor(green)) ///
> (line DayCfrMeRaA01S00SEARO date, sort lcolor(cyan)) ///
> (line DayCfrMeRaA01S00WPRO date, sort lcolor(blue)) ///
> (line DayCfrMeRaA01S00GLOBAL date, sort lcolor(black) lwidth(thick)) ///
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#12, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(forty_five)) ///
> ytitle(Daily CFR) title("COVID-19 daily cfr, WHO regions, DELP", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "AFRO" 2 "AMRO" 3 "EMRO" 4 "EURO" 5 "SEARO" 6 "WPRO" 7 "GLOBAL") size(small) rows (2)) ///
> subtitle("after 2021, with GLOBAL", size(small))
{res}{txt}
{com}. 
. qui qui graph save "graph 6a COVID-19 daily cfr, regions together, DELP.gph", replace
{txt}
{com}. qui qui graph export "graph 6a COVID-19 daily cfr, regions together, DELP.pdf", replace
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. 
. view "log CovidVisualizedGlobal DELP.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20220104/code/DELP/log CovidVisualizedGlobal DELP.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 5 Jan 2022, 16:59:59
{txt}{.-}
{smcl}
{txt}{sf}{ul off}