{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211210/code/SRIV/log CovidVisualizedGlobal SRIV 1.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}13 Dec 2021, 08:39:17
{txt}
{com}. 
. ***************************************************************************
. * This is "do CovidVisualizedGlobal SRIV 1.do"
. 
. * Project: Combine and visualize international periodically updating 
. * estimates of COVID-19 at the global level (CovidVisualizedGlobal)
. * Person: Farshad Pourmalek pourmalek_farshad at yahoo dot com
. * Time (initial): 2021-04-14
. ***************************************************************************
. 
. 
.                                                                                                          ***************************
. * To change update date, find and replace all, 2021-12-10 (old), with 2021-12-10 (new) <<--       <<<--- * change update date here *
.                                                                                                          ***************************
.                                                                                                                                                                                                                  
. ******* Also, find and replace all, 09dec2021 (old), with 09dec2021 (new) **********              <<<---       *  AND HERE  *
.                                                                                                          ***************************
. 
. 
. 
. * Get SRIV estimates 
. 
. 
. copy https://raw.githubusercontent.com/scc-usc/ReCOVER-COVID-19/master/results/historical_forecasts/2021-12-10/global_forecasts_deaths.csv global_forecasts_deaths.csv
{txt}
{com}. copy https://raw.githubusercontent.com/scc-usc/ReCOVER-COVID-19/master/results/historical_forecasts/2021-12-10/global_forecasts_deaths_lb.csv global_forecasts_deaths_lb.csv
{txt}
{com}. copy https://raw.githubusercontent.com/scc-usc/ReCOVER-COVID-19/master/results/historical_forecasts/2021-12-10/global_forecasts_deaths_ub.csv global_forecasts_deaths_ub.csv
{txt}
{com}. copy https://raw.githubusercontent.com/scc-usc/ReCOVER-COVID-19/master/results/historical_forecasts/2021-12-10/global_forecasts_cases.csv global_forecasts_cases.csv
{txt}
{com}. copy https://raw.githubusercontent.com/scc-usc/ReCOVER-COVID-19/master/results/historical_forecasts/2021-12-10/global_forecasts_cases_lb.csv global_forecasts_cases_lb.csv
{txt}
{com}. copy https://raw.githubusercontent.com/scc-usc/ReCOVER-COVID-19/master/results/historical_forecasts/2021-12-10/global_forecasts_cases_ub.csv global_forecasts_cases_ub.csv
{txt}
{com}. 
. 
. 
. * gen one file with original vars for all countries
. 
. local list1 ///
> global_forecasts_deaths global_forecasts_deaths_lb global_forecasts_deaths_ub ///
> global_forecasts_cases global_forecasts_cases_lb global_forecasts_cases_ub
{txt}
{com}. 
. foreach l of local list1 {c -(}
{txt}  2{com}. 
.         import delimited "`l'.csv", clear varnames(1)
{txt}  3{com}.         
.         label var id id
{txt}  4{com}.         
.         foreach v of var * {c -(}
{txt}  5{com}.                 local lbl : var label `v'
{txt}  6{com}.                 local lbl = strtoname("`lbl'")
{txt}  7{com}.                 rename `v' `lbl'                                        
{txt}  8{com}.         {c )-}
{txt}  9{com}.         *
.         
.         drop id
{txt} 10{com}.         
.         gen i = _n
{txt} 11{com}.                 
.         reshape long _, i(i) j(j, string)
{txt} 12{com}.         
.         rename _ `l'
{txt} 13{com}.         
.         rename j date 
{txt} 14{com}.         
.         drop i
{txt} 15{com}.         
.         rename Country country
{txt} 16{com}.         
.         order date country
{txt} 17{com}.         
.         save "`l'.dta", replace 
{txt} 18{com}. 
. {c )-}
{res}{text}(103 vars, 184 obs)
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}(note: j = 2021_12_09 2021_12_10 2021_12_11 2021_12_12 2021_12_13 2021_12_14 2021_12_15 2021_12_16 2021_12_17 2021_12_18 2021_12_19 2021_12_20 2021_12_21 2021_12_22 2021_12_23 2021_12_24 2021_12_25 2021_12_26 2021_12_27 2021_12_28 2021_12_29 2021_12_30 2021_12_31 2022_01_01 2022_01_02 2022_01_03 2022_01_04 2022_01_05 2022_01_06 2022_01_07 2022_01_08 2022_01_09 2022_01_10 2022_01_11 2022_01_12 2022_01_13 2022_01_14 2022_01_15 2022_01_16 2022_01_17 2022_01_18 2022_01_19 2022_01_20 2022_01_21 2022_01_22 2022_01_23 2022_01_24 2022_01_25 2022_01_26 2022_01_27 2022_01_28 2022_01_29 2022_01_30 2022_01_31 2022_02_01 2022_02_02 2022_02_03 2022_02_04 2022_02_05 2022_02_06 2022_02_07 2022_02_08 2022_02_09 2022_02_10 2022_02_11 2022_02_12 2022_02_13 2022_02_14 2022_02_15 2022_02_16 2022_02_17 2022_02_18 2022_02_19 2022_02_20 2022_02_21 2022_02_22 2022_02_23 2022_02_24 2022_02_25 2022_02_26 2022_02_27 2022_02_28 2022_03_01 2022_03_02 2022_03_03 2022_03_04 2022_03_05 2022_03_06 2022_03_07 2022_03_08 2022_03_09 2022_03_10 2022_03_11 2022_03_12 2022_03_13 2022_03_14 2022_03_15 2022_03_16 2022_03_17 2022_03_18 2022_03_19)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}     184   {txt}->{res}   18584
{txt}Number of variables            {res}     103   {txt}->{res}       4
{txt}j variable (101 values)                   ->   {res}j
{txt}xij variables:
{res}_2021_12_09 _2021_12_10 ... _2022_03_19   {txt}->   {res}_
{txt}{hline 77}
{res}{txt}file global_forecasts_deaths.dta saved
{res}{text}(103 vars, 184 obs)
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}(note: j = 2021_12_09 2021_12_10 2021_12_11 2021_12_12 2021_12_13 2021_12_14 2021_12_15 2021_12_16 2021_12_17 2021_12_18 2021_12_19 2021_12_20 2021_12_21 2021_12_22 2021_12_23 2021_12_24 2021_12_25 2021_12_26 2021_12_27 2021_12_28 2021_12_29 2021_12_30 2021_12_31 2022_01_01 2022_01_02 2022_01_03 2022_01_04 2022_01_05 2022_01_06 2022_01_07 2022_01_08 2022_01_09 2022_01_10 2022_01_11 2022_01_12 2022_01_13 2022_01_14 2022_01_15 2022_01_16 2022_01_17 2022_01_18 2022_01_19 2022_01_20 2022_01_21 2022_01_22 2022_01_23 2022_01_24 2022_01_25 2022_01_26 2022_01_27 2022_01_28 2022_01_29 2022_01_30 2022_01_31 2022_02_01 2022_02_02 2022_02_03 2022_02_04 2022_02_05 2022_02_06 2022_02_07 2022_02_08 2022_02_09 2022_02_10 2022_02_11 2022_02_12 2022_02_13 2022_02_14 2022_02_15 2022_02_16 2022_02_17 2022_02_18 2022_02_19 2022_02_20 2022_02_21 2022_02_22 2022_02_23 2022_02_24 2022_02_25 2022_02_26 2022_02_27 2022_02_28 2022_03_01 2022_03_02 2022_03_03 2022_03_04 2022_03_05 2022_03_06 2022_03_07 2022_03_08 2022_03_09 2022_03_10 2022_03_11 2022_03_12 2022_03_13 2022_03_14 2022_03_15 2022_03_16 2022_03_17 2022_03_18 2022_03_19)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}     184   {txt}->{res}   18584
{txt}Number of variables            {res}     103   {txt}->{res}       4
{txt}j variable (101 values)                   ->   {res}j
{txt}xij variables:
{res}_2021_12_09 _2021_12_10 ... _2022_03_19   {txt}->   {res}_
{txt}{hline 77}
{res}{txt}file global_forecasts_deaths_lb.dta saved
{res}{text}(103 vars, 184 obs)
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}(note: j = 2021_12_09 2021_12_10 2021_12_11 2021_12_12 2021_12_13 2021_12_14 2021_12_15 2021_12_16 2021_12_17 2021_12_18 2021_12_19 2021_12_20 2021_12_21 2021_12_22 2021_12_23 2021_12_24 2021_12_25 2021_12_26 2021_12_27 2021_12_28 2021_12_29 2021_12_30 2021_12_31 2022_01_01 2022_01_02 2022_01_03 2022_01_04 2022_01_05 2022_01_06 2022_01_07 2022_01_08 2022_01_09 2022_01_10 2022_01_11 2022_01_12 2022_01_13 2022_01_14 2022_01_15 2022_01_16 2022_01_17 2022_01_18 2022_01_19 2022_01_20 2022_01_21 2022_01_22 2022_01_23 2022_01_24 2022_01_25 2022_01_26 2022_01_27 2022_01_28 2022_01_29 2022_01_30 2022_01_31 2022_02_01 2022_02_02 2022_02_03 2022_02_04 2022_02_05 2022_02_06 2022_02_07 2022_02_08 2022_02_09 2022_02_10 2022_02_11 2022_02_12 2022_02_13 2022_02_14 2022_02_15 2022_02_16 2022_02_17 2022_02_18 2022_02_19 2022_02_20 2022_02_21 2022_02_22 2022_02_23 2022_02_24 2022_02_25 2022_02_26 2022_02_27 2022_02_28 2022_03_01 2022_03_02 2022_03_03 2022_03_04 2022_03_05 2022_03_06 2022_03_07 2022_03_08 2022_03_09 2022_03_10 2022_03_11 2022_03_12 2022_03_13 2022_03_14 2022_03_15 2022_03_16 2022_03_17 2022_03_18 2022_03_19)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}     184   {txt}->{res}   18584
{txt}Number of variables            {res}     103   {txt}->{res}       4
{txt}j variable (101 values)                   ->   {res}j
{txt}xij variables:
{res}_2021_12_09 _2021_12_10 ... _2022_03_19   {txt}->   {res}_
{txt}{hline 77}
{res}{txt}file global_forecasts_deaths_ub.dta saved
{res}{text}(103 vars, 184 obs)
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}(note: j = 2021_12_09 2021_12_10 2021_12_11 2021_12_12 2021_12_13 2021_12_14 2021_12_15 2021_12_16 2021_12_17 2021_12_18 2021_12_19 2021_12_20 2021_12_21 2021_12_22 2021_12_23 2021_12_24 2021_12_25 2021_12_26 2021_12_27 2021_12_28 2021_12_29 2021_12_30 2021_12_31 2022_01_01 2022_01_02 2022_01_03 2022_01_04 2022_01_05 2022_01_06 2022_01_07 2022_01_08 2022_01_09 2022_01_10 2022_01_11 2022_01_12 2022_01_13 2022_01_14 2022_01_15 2022_01_16 2022_01_17 2022_01_18 2022_01_19 2022_01_20 2022_01_21 2022_01_22 2022_01_23 2022_01_24 2022_01_25 2022_01_26 2022_01_27 2022_01_28 2022_01_29 2022_01_30 2022_01_31 2022_02_01 2022_02_02 2022_02_03 2022_02_04 2022_02_05 2022_02_06 2022_02_07 2022_02_08 2022_02_09 2022_02_10 2022_02_11 2022_02_12 2022_02_13 2022_02_14 2022_02_15 2022_02_16 2022_02_17 2022_02_18 2022_02_19 2022_02_20 2022_02_21 2022_02_22 2022_02_23 2022_02_24 2022_02_25 2022_02_26 2022_02_27 2022_02_28 2022_03_01 2022_03_02 2022_03_03 2022_03_04 2022_03_05 2022_03_06 2022_03_07 2022_03_08 2022_03_09 2022_03_10 2022_03_11 2022_03_12 2022_03_13 2022_03_14 2022_03_15 2022_03_16 2022_03_17 2022_03_18 2022_03_19)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}     184   {txt}->{res}   18584
{txt}Number of variables            {res}     103   {txt}->{res}       4
{txt}j variable (101 values)                   ->   {res}j
{txt}xij variables:
{res}_2021_12_09 _2021_12_10 ... _2022_03_19   {txt}->   {res}_
{txt}{hline 77}
{res}{txt}file global_forecasts_cases.dta saved
{res}{text}(103 vars, 184 obs)
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}(note: j = 2021_12_09 2021_12_10 2021_12_11 2021_12_12 2021_12_13 2021_12_14 2021_12_15 2021_12_16 2021_12_17 2021_12_18 2021_12_19 2021_12_20 2021_12_21 2021_12_22 2021_12_23 2021_12_24 2021_12_25 2021_12_26 2021_12_27 2021_12_28 2021_12_29 2021_12_30 2021_12_31 2022_01_01 2022_01_02 2022_01_03 2022_01_04 2022_01_05 2022_01_06 2022_01_07 2022_01_08 2022_01_09 2022_01_10 2022_01_11 2022_01_12 2022_01_13 2022_01_14 2022_01_15 2022_01_16 2022_01_17 2022_01_18 2022_01_19 2022_01_20 2022_01_21 2022_01_22 2022_01_23 2022_01_24 2022_01_25 2022_01_26 2022_01_27 2022_01_28 2022_01_29 2022_01_30 2022_01_31 2022_02_01 2022_02_02 2022_02_03 2022_02_04 2022_02_05 2022_02_06 2022_02_07 2022_02_08 2022_02_09 2022_02_10 2022_02_11 2022_02_12 2022_02_13 2022_02_14 2022_02_15 2022_02_16 2022_02_17 2022_02_18 2022_02_19 2022_02_20 2022_02_21 2022_02_22 2022_02_23 2022_02_24 2022_02_25 2022_02_26 2022_02_27 2022_02_28 2022_03_01 2022_03_02 2022_03_03 2022_03_04 2022_03_05 2022_03_06 2022_03_07 2022_03_08 2022_03_09 2022_03_10 2022_03_11 2022_03_12 2022_03_13 2022_03_14 2022_03_15 2022_03_16 2022_03_17 2022_03_18 2022_03_19)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}     184   {txt}->{res}   18584
{txt}Number of variables            {res}     103   {txt}->{res}       4
{txt}j variable (101 values)                   ->   {res}j
{txt}xij variables:
{res}_2021_12_09 _2021_12_10 ... _2022_03_19   {txt}->   {res}_
{txt}{hline 77}
{res}{txt}file global_forecasts_cases_lb.dta saved
{res}{text}(103 vars, 184 obs)
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}(note: j = 2021_12_09 2021_12_10 2021_12_11 2021_12_12 2021_12_13 2021_12_14 2021_12_15 2021_12_16 2021_12_17 2021_12_18 2021_12_19 2021_12_20 2021_12_21 2021_12_22 2021_12_23 2021_12_24 2021_12_25 2021_12_26 2021_12_27 2021_12_28 2021_12_29 2021_12_30 2021_12_31 2022_01_01 2022_01_02 2022_01_03 2022_01_04 2022_01_05 2022_01_06 2022_01_07 2022_01_08 2022_01_09 2022_01_10 2022_01_11 2022_01_12 2022_01_13 2022_01_14 2022_01_15 2022_01_16 2022_01_17 2022_01_18 2022_01_19 2022_01_20 2022_01_21 2022_01_22 2022_01_23 2022_01_24 2022_01_25 2022_01_26 2022_01_27 2022_01_28 2022_01_29 2022_01_30 2022_01_31 2022_02_01 2022_02_02 2022_02_03 2022_02_04 2022_02_05 2022_02_06 2022_02_07 2022_02_08 2022_02_09 2022_02_10 2022_02_11 2022_02_12 2022_02_13 2022_02_14 2022_02_15 2022_02_16 2022_02_17 2022_02_18 2022_02_19 2022_02_20 2022_02_21 2022_02_22 2022_02_23 2022_02_24 2022_02_25 2022_02_26 2022_02_27 2022_02_28 2022_03_01 2022_03_02 2022_03_03 2022_03_04 2022_03_05 2022_03_06 2022_03_07 2022_03_08 2022_03_09 2022_03_10 2022_03_11 2022_03_12 2022_03_13 2022_03_14 2022_03_15 2022_03_16 2022_03_17 2022_03_18 2022_03_19)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}     184   {txt}->{res}   18584
{txt}Number of variables            {res}     103   {txt}->{res}       4
{txt}j variable (101 values)                   ->   {res}j
{txt}xij variables:
{res}_2021_12_09 _2021_12_10 ... _2022_03_19   {txt}->   {res}_
{txt}{hline 77}
{res}{txt}file global_forecasts_cases_ub.dta saved

{com}. *
. 
. 
. use global_forecasts_deaths, clear
{txt}
{com}. 
. merge 1:1 date country using global_forecasts_deaths_lb
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          18,584{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. 
. merge 1:1 date country using global_forecasts_deaths_ub
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          18,584{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. 
. merge 1:1 date country using global_forecasts_cases
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          18,584{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. 
. merge 1:1 date country using global_forecasts_cases_lb
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          18,584{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. 
. merge 1:1 date country using global_forecasts_cases_ub
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          18,584{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. 
. 
. rename global_forecasts_deaths_lb TotDeaLoRaA05S00      
{res}{txt}
{com}. rename global_forecasts_deaths_ub TotDeaUpRaA05S00      
{res}{txt}
{com}. rename global_forecasts_deaths    TotDeaMeRaA05S00
{res}{txt}
{com}. rename global_forecasts_cases_lb  TotCasLoRaA05S00
{res}{txt}
{com}. rename global_forecasts_cases_ub  TotCasUpRaA05S00      
{res}{txt}
{com}. rename global_forecasts_cases     TotCasMeRaA05S00
{res}{txt}
{com}. 
. label var TotDeaMeRaA05S00 "Total Deaths Mean SRIV"
{txt}
{com}. label var TotDeaLoRaA05S00 "Total Deaths Lower SRIV"
{txt}
{com}. label var TotDeaUpRaA05S00 "Total Deaths Upper SRIV"
{txt}
{com}. label var TotCasMeRaA05S00 "Total Cases Mean SRIV"
{txt}
{com}. label var TotCasLoRaA05S00 "Total Cases Lower SRIV"
{txt}
{com}. label var TotCasUpRaA05S00 "Total Cases Upper SRIV"
{txt}
{com}. 
. 
. save "SRIV.dta", replace
{txt}file SRIV.dta saved

{com}. 
. 
. 
. 
. 
. * gen one file for each country with original vars for all countries
. 
. clear 
{txt}
{com}. use "SRIV.dta", clear
{txt}
{com}. levelsof country, local(levels)
{txt}`"Afghanistan"' `"Albania"' `"Algeria"' `"Andorra"' `"Angola"' `"Antigua and Barbuda"' `"Argentina"' `"Armenia"' `"Australia"' `"Austria"' `"Azerbaijan"' `"Bahrain"' `"Bangladesh"' `"Barbados"' `"Belarus"' `"Belgium"' `"Belize"' `"Benin"' `"Bhutan"' `"Bolivia"' `"Bosnia and Herzegovina"' `"Botswana"' `"Brazil"' `"Brunei"' `"Bulgaria"' `"Burkina Faso"' `"Burundi"' `"Cambodia"' `"Cameroon"' `"Canada"' `"Cape Verde"' `"Central African Republic"' `"Chad"' `"Chile"' `"China"' `"Colombia"' `"Congo"' `"Costa Rica"' `"Cote d'Ivoire"' `"Croatia"' `"Cuba"' `"Cyprus"' `"Czech Republic"' `"Democratic Republic of the Congo"' `"Denmark"' `"Diamond Princess"' `"Djibouti"' `"Dominica"' `"Dominican Republic"' `"Ecuador"' `"Egypt"' `"El Salvador"' `"Equatorial Guinea"' `"Eritrea"' `"Estonia"' `"Eswatini"' `"Ethiopia"' `"Fiji"' `"Finland"' `"France"' `"Gabon"' `"Georgia"' `"Germany"' `"Ghana"' `"Greece"' `"Grenada"' `"Guatemala"' `"Guinea"' `"Guinea-Bissau"' `"Guyana"' `"Haiti"' `"Holy See"' `"Honduras"' `"Hungary"' `"Iceland"' `"India"' `"Indonesia"' `"Iran"' `"Iraq"' `"Ireland"' `"Israel"' `"Italy"' `"Jamaica"' `"Japan"' `"Jordan"' `"Kazakhstan"' `"Kenya"' `"Kosovo"' `"Kuwait"' `"Kyrgyzstan"' `"Laos"' `"Latvia"' `"Lebanon"' `"Liberia"' `"Libya"' `"Liechtenstein"' `"Lithuania"' `"Luxembourg"' `"MS Zaandam"' `"Macedonia"' `"Madagascar"' `"Malawi"' `"Malaysia"' `"Maldives"' `"Mali"' `"Malta"' `"Mauritania"' `"Mauritius"' `"Mexico"' `"Moldova"' `"Monaco"' `"Mongolia"' `"Montenegro"' `"Morocco"' `"Mozambique"' `"Myanmar"' `"Namibia"' `"Nepal"' `"Netherlands"' `"New Zealand"' `"Nicaragua"' `"Niger"' `"Nigeria"' `"Norway"' `"Oman"' `"Pakistan"' `"Panama"' `"Papua New Guinea"' `"Paraguay"' `"Peru"' `"Philippines"' `"Poland"' `"Portugal"' `"Qatar"' `"Romania"' `"Russian Federation"' `"Rwanda"' `"Saint Kitts and Nevis"' `"Saint Lucia"' `"Saint Vincent and the Grenadines"' `"San Marino"' `"Sao Tome and Principe"' `"Saudi Arabia"' `"Senegal"' `"Serbia"' `"Seychelles"' `"Sierra Leone"' `"Singapore"' `"Slovakia"' `"Slovenia"' `"Somalia"' `"South Africa"' `"South Korea"' `"South Sudan"' `"Spain"' `"Sri Lanka"' `"Sudan"' `"Suriname"' `"Sweden"' `"Switzerland"' `"Syria"' `"Tanzania"' `"Thailand"' `"The Bahamas"' `"The Gambia"' `"Timor-Leste"' `"Togo"' `"Trinidad and Tobago"' `"Tunisia"' `"Turkey"' `"Uganda"' `"Ukraine"' `"United Arab Emirates"' `"United Kingdom"' `"United States"' `"Uruguay"' `"Uzbekistan"' `"Venezuela"' `"Vietnam"' `"West Bank and Gaza"' `"Western Sahara"' `"Yemen"' `"Zambia"' `"Zimbabwe"'

{com}. 
. 
. foreach l of local levels {c -(}
{txt}  2{com}.         use "SRIV.dta", clear
{txt}  3{com}.         di "`l'"
{txt}  4{com}.         keep if country == "`l'"
{txt}  5{com}.     save "`l'", replace
{txt}  6{com}. {c )-}
Afghanistan
{txt}(18,483 observations deleted)
file Afghanistan.dta saved
Albania
(18,483 observations deleted)
file Albania.dta saved
Algeria
(18,483 observations deleted)
file Algeria.dta saved
Andorra
(18,483 observations deleted)
file Andorra.dta saved
Angola
(18,483 observations deleted)
file Angola.dta saved
Antigua and Barbuda
(18,483 observations deleted)
file Antigua and Barbuda.dta saved
Argentina
(18,483 observations deleted)
file Argentina.dta saved
Armenia
(18,483 observations deleted)
file Armenia.dta saved
Australia
(18,483 observations deleted)
file Australia.dta saved
Austria
(18,483 observations deleted)
file Austria.dta saved
Azerbaijan
(18,483 observations deleted)
file Azerbaijan.dta saved
Bahrain
(18,483 observations deleted)
file Bahrain.dta saved
Bangladesh
(18,483 observations deleted)
file Bangladesh.dta saved
Barbados
(18,483 observations deleted)
file Barbados.dta saved
Belarus
(18,483 observations deleted)
file Belarus.dta saved
Belgium
(18,483 observations deleted)
file Belgium.dta saved
Belize
(18,483 observations deleted)
file Belize.dta saved
Benin
(18,483 observations deleted)
file Benin.dta saved
Bhutan
(18,483 observations deleted)
file Bhutan.dta saved
Bolivia
(18,483 observations deleted)
file Bolivia.dta saved
Bosnia and Herzegovina
(18,483 observations deleted)
file Bosnia and Herzegovina.dta saved
Botswana
(18,483 observations deleted)
file Botswana.dta saved
Brazil
(18,483 observations deleted)
file Brazil.dta saved
Brunei
(18,483 observations deleted)
file Brunei.dta saved
Bulgaria
(18,483 observations deleted)
file Bulgaria.dta saved
Burkina Faso
(18,483 observations deleted)
file Burkina Faso.dta saved
Burundi
(18,483 observations deleted)
file Burundi.dta saved
Cambodia
(18,483 observations deleted)
file Cambodia.dta saved
Cameroon
(18,483 observations deleted)
file Cameroon.dta saved
Canada
(18,483 observations deleted)
file Canada.dta saved
Cape Verde
(18,483 observations deleted)
file Cape Verde.dta saved
Central African Republic
(18,483 observations deleted)
file Central African Republic.dta saved
Chad
(18,483 observations deleted)
file Chad.dta saved
Chile
(18,483 observations deleted)
file Chile.dta saved
China
(18,483 observations deleted)
file China.dta saved
Colombia
(18,483 observations deleted)
file Colombia.dta saved
Congo
(18,483 observations deleted)
file Congo.dta saved
Costa Rica
(18,483 observations deleted)
file Costa Rica.dta saved
Cote d'Ivoire
(18,483 observations deleted)
file Cote d'Ivoire.dta saved
Croatia
(18,483 observations deleted)
file Croatia.dta saved
Cuba
(18,483 observations deleted)
file Cuba.dta saved
Cyprus
(18,483 observations deleted)
file Cyprus.dta saved
Czech Republic
(18,483 observations deleted)
file Czech Republic.dta saved
Democratic Republic of the Congo
(18,483 observations deleted)
file Democratic Republic of the Congo.dta saved
Denmark
(18,483 observations deleted)
file Denmark.dta saved
Diamond Princess
(18,483 observations deleted)
file Diamond Princess.dta saved
Djibouti
(18,483 observations deleted)
file Djibouti.dta saved
Dominica
(18,483 observations deleted)
file Dominica.dta saved
Dominican Republic
(18,483 observations deleted)
file Dominican Republic.dta saved
Ecuador
(18,483 observations deleted)
file Ecuador.dta saved
Egypt
(18,483 observations deleted)
file Egypt.dta saved
El Salvador
(18,483 observations deleted)
file El Salvador.dta saved
Equatorial Guinea
(18,483 observations deleted)
file Equatorial Guinea.dta saved
Eritrea
(18,483 observations deleted)
file Eritrea.dta saved
Estonia
(18,483 observations deleted)
file Estonia.dta saved
Eswatini
(18,483 observations deleted)
file Eswatini.dta saved
Ethiopia
(18,483 observations deleted)
file Ethiopia.dta saved
Fiji
(18,483 observations deleted)
file Fiji.dta saved
Finland
(18,483 observations deleted)
file Finland.dta saved
France
(18,483 observations deleted)
file France.dta saved
Gabon
(18,483 observations deleted)
file Gabon.dta saved
Georgia
(18,483 observations deleted)
file Georgia.dta saved
Germany
(18,483 observations deleted)
file Germany.dta saved
Ghana
(18,483 observations deleted)
file Ghana.dta saved
Greece
(18,483 observations deleted)
file Greece.dta saved
Grenada
(18,483 observations deleted)
file Grenada.dta saved
Guatemala
(18,483 observations deleted)
file Guatemala.dta saved
Guinea
(18,483 observations deleted)
file Guinea.dta saved
Guinea-Bissau
(18,483 observations deleted)
file Guinea-Bissau.dta saved
Guyana
(18,483 observations deleted)
file Guyana.dta saved
Haiti
(18,483 observations deleted)
file Haiti.dta saved
Holy See
(18,483 observations deleted)
file Holy See.dta saved
Honduras
(18,483 observations deleted)
file Honduras.dta saved
Hungary
(18,483 observations deleted)
file Hungary.dta saved
Iceland
(18,483 observations deleted)
file Iceland.dta saved
India
(18,483 observations deleted)
file India.dta saved
Indonesia
(18,483 observations deleted)
file Indonesia.dta saved
Iran
(18,483 observations deleted)
file Iran.dta saved
Iraq
(18,483 observations deleted)
file Iraq.dta saved
Ireland
(18,483 observations deleted)
file Ireland.dta saved
Israel
(18,483 observations deleted)
file Israel.dta saved
Italy
(18,483 observations deleted)
file Italy.dta saved
Jamaica
(18,483 observations deleted)
file Jamaica.dta saved
Japan
(18,483 observations deleted)
file Japan.dta saved
Jordan
(18,483 observations deleted)
file Jordan.dta saved
Kazakhstan
(18,483 observations deleted)
file Kazakhstan.dta saved
Kenya
(18,483 observations deleted)
file Kenya.dta saved
Kosovo
(18,483 observations deleted)
file Kosovo.dta saved
Kuwait
(18,483 observations deleted)
file Kuwait.dta saved
Kyrgyzstan
(18,483 observations deleted)
file Kyrgyzstan.dta saved
Laos
(18,483 observations deleted)
file Laos.dta saved
Latvia
(18,483 observations deleted)
file Latvia.dta saved
Lebanon
(18,483 observations deleted)
file Lebanon.dta saved
Liberia
(18,483 observations deleted)
file Liberia.dta saved
Libya
(18,483 observations deleted)
file Libya.dta saved
Liechtenstein
(18,483 observations deleted)
file Liechtenstein.dta saved
Lithuania
(18,483 observations deleted)
file Lithuania.dta saved
Luxembourg
(18,483 observations deleted)
file Luxembourg.dta saved
MS Zaandam
(18,483 observations deleted)
file MS Zaandam.dta saved
Macedonia
(18,483 observations deleted)
file Macedonia.dta saved
Madagascar
(18,483 observations deleted)
file Madagascar.dta saved
Malawi
(18,483 observations deleted)
file Malawi.dta saved
Malaysia
(18,483 observations deleted)
file Malaysia.dta saved
Maldives
(18,483 observations deleted)
file Maldives.dta saved
Mali
(18,483 observations deleted)
file Mali.dta saved
Malta
(18,483 observations deleted)
file Malta.dta saved
Mauritania
(18,483 observations deleted)
file Mauritania.dta saved
Mauritius
(18,483 observations deleted)
file Mauritius.dta saved
Mexico
(18,483 observations deleted)
file Mexico.dta saved
Moldova
(18,483 observations deleted)
file Moldova.dta saved
Monaco
(18,483 observations deleted)
file Monaco.dta saved
Mongolia
(18,483 observations deleted)
file Mongolia.dta saved
Montenegro
(18,483 observations deleted)
file Montenegro.dta saved
Morocco
(18,483 observations deleted)
file Morocco.dta saved
Mozambique
(18,483 observations deleted)
file Mozambique.dta saved
Myanmar
(18,483 observations deleted)
file Myanmar.dta saved
Namibia
(18,483 observations deleted)
file Namibia.dta saved
Nepal
(18,483 observations deleted)
file Nepal.dta saved
Netherlands
(18,483 observations deleted)
file Netherlands.dta saved
New Zealand
(18,483 observations deleted)
file New Zealand.dta saved
Nicaragua
(18,483 observations deleted)
file Nicaragua.dta saved
Niger
(18,483 observations deleted)
file Niger.dta saved
Nigeria
(18,483 observations deleted)
file Nigeria.dta saved
Norway
(18,483 observations deleted)
file Norway.dta saved
Oman
(18,483 observations deleted)
file Oman.dta saved
Pakistan
(18,483 observations deleted)
file Pakistan.dta saved
Panama
(18,483 observations deleted)
file Panama.dta saved
Papua New Guinea
(18,483 observations deleted)
file Papua New Guinea.dta saved
Paraguay
(18,483 observations deleted)
file Paraguay.dta saved
Peru
(18,483 observations deleted)
file Peru.dta saved
Philippines
(18,483 observations deleted)
file Philippines.dta saved
Poland
(18,483 observations deleted)
file Poland.dta saved
Portugal
(18,483 observations deleted)
file Portugal.dta saved
Qatar
(18,483 observations deleted)
file Qatar.dta saved
Romania
(18,483 observations deleted)
file Romania.dta saved
Russian Federation
(18,483 observations deleted)
file Russian Federation.dta saved
Rwanda
(18,483 observations deleted)
file Rwanda.dta saved
Saint Kitts and Nevis
(18,483 observations deleted)
file Saint Kitts and Nevis.dta saved
Saint Lucia
(18,483 observations deleted)
file Saint Lucia.dta saved
Saint Vincent and the Grenadines
(18,483 observations deleted)
file Saint Vincent and the Grenadines.dta saved
San Marino
(18,483 observations deleted)
file San Marino.dta saved
Sao Tome and Principe
(18,483 observations deleted)
file Sao Tome and Principe.dta saved
Saudi Arabia
(18,483 observations deleted)
file Saudi Arabia.dta saved
Senegal
(18,483 observations deleted)
file Senegal.dta saved
Serbia
(18,483 observations deleted)
file Serbia.dta saved
Seychelles
(18,483 observations deleted)
file Seychelles.dta saved
Sierra Leone
(18,483 observations deleted)
file Sierra Leone.dta saved
Singapore
(18,483 observations deleted)
file Singapore.dta saved
Slovakia
(18,483 observations deleted)
file Slovakia.dta saved
Slovenia
(18,483 observations deleted)
file Slovenia.dta saved
Somalia
(18,483 observations deleted)
file Somalia.dta saved
South Africa
(18,483 observations deleted)
file South Africa.dta saved
South Korea
(18,483 observations deleted)
file South Korea.dta saved
South Sudan
(18,483 observations deleted)
file South Sudan.dta saved
Spain
(18,483 observations deleted)
file Spain.dta saved
Sri Lanka
(18,483 observations deleted)
file Sri Lanka.dta saved
Sudan
(18,483 observations deleted)
file Sudan.dta saved
Suriname
(18,483 observations deleted)
file Suriname.dta saved
Sweden
(18,483 observations deleted)
file Sweden.dta saved
Switzerland
(18,483 observations deleted)
file Switzerland.dta saved
Syria
(18,483 observations deleted)
file Syria.dta saved
Tanzania
(18,483 observations deleted)
file Tanzania.dta saved
Thailand
(18,483 observations deleted)
file Thailand.dta saved
The Bahamas
(18,483 observations deleted)
file The Bahamas.dta saved
The Gambia
(18,483 observations deleted)
file The Gambia.dta saved
Timor-Leste
(18,483 observations deleted)
file Timor-Leste.dta saved
Togo
(18,483 observations deleted)
file Togo.dta saved
Trinidad and Tobago
(18,483 observations deleted)
file Trinidad and Tobago.dta saved
Tunisia
(18,483 observations deleted)
file Tunisia.dta saved
Turkey
(18,483 observations deleted)
file Turkey.dta saved
Uganda
(18,483 observations deleted)
file Uganda.dta saved
Ukraine
(18,483 observations deleted)
file Ukraine.dta saved
United Arab Emirates
(18,483 observations deleted)
file United Arab Emirates.dta saved
United Kingdom
(18,483 observations deleted)
file United Kingdom.dta saved
United States
(18,483 observations deleted)
file United States.dta saved
Uruguay
(18,483 observations deleted)
file Uruguay.dta saved
Uzbekistan
(18,483 observations deleted)
file Uzbekistan.dta saved
Venezuela
(18,483 observations deleted)
file Venezuela.dta saved
Vietnam
(18,483 observations deleted)
file Vietnam.dta saved
West Bank and Gaza
(18,483 observations deleted)
file West Bank and Gaza.dta saved
Western Sahara
(18,483 observations deleted)
file Western Sahara.dta saved
Yemen
(18,483 observations deleted)
file Yemen.dta saved
Zambia
(18,483 observations deleted)
file Zambia.dta saved
Zimbabwe
(18,483 observations deleted)
file Zimbabwe.dta saved

{com}. *
. 
. 
. * use the single files for each country for formatting the date 
. 
. 
. clear 
{txt}
{com}. use "SRIV.dta", clear
{txt}
{com}. levelsof country, local(levels)
{txt}`"Afghanistan"' `"Albania"' `"Algeria"' `"Andorra"' `"Angola"' `"Antigua and Barbuda"' `"Argentina"' `"Armenia"' `"Australia"' `"Austria"' `"Azerbaijan"' `"Bahrain"' `"Bangladesh"' `"Barbados"' `"Belarus"' `"Belgium"' `"Belize"' `"Benin"' `"Bhutan"' `"Bolivia"' `"Bosnia and Herzegovina"' `"Botswana"' `"Brazil"' `"Brunei"' `"Bulgaria"' `"Burkina Faso"' `"Burundi"' `"Cambodia"' `"Cameroon"' `"Canada"' `"Cape Verde"' `"Central African Republic"' `"Chad"' `"Chile"' `"China"' `"Colombia"' `"Congo"' `"Costa Rica"' `"Cote d'Ivoire"' `"Croatia"' `"Cuba"' `"Cyprus"' `"Czech Republic"' `"Democratic Republic of the Congo"' `"Denmark"' `"Diamond Princess"' `"Djibouti"' `"Dominica"' `"Dominican Republic"' `"Ecuador"' `"Egypt"' `"El Salvador"' `"Equatorial Guinea"' `"Eritrea"' `"Estonia"' `"Eswatini"' `"Ethiopia"' `"Fiji"' `"Finland"' `"France"' `"Gabon"' `"Georgia"' `"Germany"' `"Ghana"' `"Greece"' `"Grenada"' `"Guatemala"' `"Guinea"' `"Guinea-Bissau"' `"Guyana"' `"Haiti"' `"Holy See"' `"Honduras"' `"Hungary"' `"Iceland"' `"India"' `"Indonesia"' `"Iran"' `"Iraq"' `"Ireland"' `"Israel"' `"Italy"' `"Jamaica"' `"Japan"' `"Jordan"' `"Kazakhstan"' `"Kenya"' `"Kosovo"' `"Kuwait"' `"Kyrgyzstan"' `"Laos"' `"Latvia"' `"Lebanon"' `"Liberia"' `"Libya"' `"Liechtenstein"' `"Lithuania"' `"Luxembourg"' `"MS Zaandam"' `"Macedonia"' `"Madagascar"' `"Malawi"' `"Malaysia"' `"Maldives"' `"Mali"' `"Malta"' `"Mauritania"' `"Mauritius"' `"Mexico"' `"Moldova"' `"Monaco"' `"Mongolia"' `"Montenegro"' `"Morocco"' `"Mozambique"' `"Myanmar"' `"Namibia"' `"Nepal"' `"Netherlands"' `"New Zealand"' `"Nicaragua"' `"Niger"' `"Nigeria"' `"Norway"' `"Oman"' `"Pakistan"' `"Panama"' `"Papua New Guinea"' `"Paraguay"' `"Peru"' `"Philippines"' `"Poland"' `"Portugal"' `"Qatar"' `"Romania"' `"Russian Federation"' `"Rwanda"' `"Saint Kitts and Nevis"' `"Saint Lucia"' `"Saint Vincent and the Grenadines"' `"San Marino"' `"Sao Tome and Principe"' `"Saudi Arabia"' `"Senegal"' `"Serbia"' `"Seychelles"' `"Sierra Leone"' `"Singapore"' `"Slovakia"' `"Slovenia"' `"Somalia"' `"South Africa"' `"South Korea"' `"South Sudan"' `"Spain"' `"Sri Lanka"' `"Sudan"' `"Suriname"' `"Sweden"' `"Switzerland"' `"Syria"' `"Tanzania"' `"Thailand"' `"The Bahamas"' `"The Gambia"' `"Timor-Leste"' `"Togo"' `"Trinidad and Tobago"' `"Tunisia"' `"Turkey"' `"Uganda"' `"Ukraine"' `"United Arab Emirates"' `"United Kingdom"' `"United States"' `"Uruguay"' `"Uzbekistan"' `"Venezuela"' `"Vietnam"' `"West Bank and Gaza"' `"Western Sahara"' `"Yemen"' `"Zambia"' `"Zimbabwe"'

{com}. 
. 
. foreach l of local levels {c -(}
{txt}  2{com}.         use "`l'", clear
{txt}  3{com}.         di "`l'"
{txt}  4{com}.         gen day1 = date[1]
{txt}  5{com}.         
.         gen year = substr(day1,1,4) 
{txt}  6{com}.         gen month = substr(day1,6,2) 
{txt}  7{com}.         gen day = substr(day1,9,2) 
{txt}  8{com}.         egen date2 = concat(day month year)
{txt}  9{com}.         gen day1b = date(date2, "DMY", 2050)
{txt} 10{com}.         format day1b %tdDDMonCCYY
{txt} 11{com}.         codebook day1b
{txt} 12{com}.         drop day1 year month day date2
{txt} 13{com}.         
.         bysort country: gen n = _n
{txt} 14{com}.         bysort country: replace day1b = day1b[n] + n - 1
{txt} 15{com}.         drop n
{txt} 16{com}.         drop date
{txt} 17{com}.         rename day1b date
{txt} 18{com}.         
.         
.         local list2 ///
>         DeaMeRaA05S00 DeaLoRaA05S00 DeaUpRaA05S00 ///
>         CasMeRaA05S00 CasLoRaA05S00 CasUpRaA05S00 
{txt} 19{com}.         
.         foreach s of local list2 {c -(}
{txt} 20{com}.                 bysort country: gen Day`s' =  Tot`s'[_n] - Tot`s'[_n-1] // genn1
{txt} 21{com}.         {c )-}
{txt} 22{com}.         *
.         
.         
.         label var DayDeaMeRaA05S00 "Daily Deaths Mean SRIV"
{txt} 23{com}.         label var DayDeaLoRaA05S00 "Daily Deaths Lower SRIV"
{txt} 24{com}.         label var DayDeaUpRaA05S00 "Daily Deaths Upper SRIV"
{txt} 25{com}.         label var DayCasMeRaA05S00 "Daily Cases Mean SRIV"
{txt} 26{com}.         label var DayCasLoRaA05S00 "Daily Cases Lower SRIV"
{txt} 27{com}.         label var DayCasUpRaA05S00 "Daily Cases Upper SRIV"
{txt} 28{com}.         
.         
.         * gen "Daily cases mean div by daily deaths mean SRIV  DayCbD" for visulization of temporal relation of deaths and cases peaks 
.         
.         
.         summ DayDeaMeRaA05S00 
{txt} 29{com}.         gen DayDeMMeRaA05S00   = r(mean)
{txt} 30{com}.         label var DayDeMMeRaA05S00   "Daily deaths mean SRIV  DayDeM"
{txt} 31{com}.         
.         summ DayCasMeRaA05S00   
{txt} 32{com}.         gen DayCaMMeRaA05S00   = r(mean)
{txt} 33{com}.         label var DayCaMMeRaA05S00   "Daily cases mean SRIV  DayCaM"
{txt} 34{com}.                                                            
.         gen DayCbDMeRaA05S00   = DayCaMMeRaA05S00   / DayDeMMeRaA05S00  
{txt} 35{com}.         label var DayCbDMeRaA05S00   "Daily cases mean div by daily deaths mean SRIV  DayCbD"
{txt} 36{com}.         summ DayCbDMeRaA05S00  
{txt} 37{com}.                                                                                                   
.         gen DayDMuMeRaA05S00   = DayDeaMeRaA05S00   * DayCbDMeRaA05S00  
{txt} 38{com}.         label var DayDMuMeRaA05S00   "Daily deaths scaled (times means of cases by deaths) SRIV"
{txt} 39{com}.         summ DayDMuMeRaA05S00  
{txt} 40{com}.                         
.         
.         save "`l'", replace
{txt} 41{com}. {c )-}
Afghanistan

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .71    .6403124          0          2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        10.2    8.674821          0         29

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101     14.3662           0    14.3662    14.3662
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        10.2    9.198855          0    28.7324
{txt}file Afghanistan.dta saved
Albania

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        1.71     1.45154          0          5

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       99.15    90.62581       -199        311

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    57.98246           0   57.98246   57.98246
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       99.15    84.16388          0   289.9123
{txt}file Albania.dta saved
Algeria

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        9.09    4.233333          0         16

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      112.56    94.86496          0        228

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    12.38284           0   12.38284   12.38284
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      112.56    52.42068          0   198.1254
{txt}file Algeria.dta saved
Andorra

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100          .8    .8164966          0          2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      111.46    137.5354          0        401

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101     139.325           0    139.325    139.325
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      111.46    113.7584          0     278.65
{txt}file Andorra.dta saved
Angola

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .12    .3265986          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       11.34    4.252676          5         18

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101        94.5           0       94.5       94.5
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       11.34    30.86357          0       94.5
{txt}file Angola.dta saved
Antigua and Barbuda

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .02    .1407053          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100         .07    .2564324          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101         3.5           0        3.5        3.5
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100         .07    .4924685          0        3.5
{txt}file Antigua and Barbuda.dta saved
Argentina

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       21.18    7.073039          9         33

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      1142.8    638.6359        395       2309

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    53.95657           0   53.95657   53.95657
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      1142.8    381.6369   485.6091   1780.567
{txt}file Argentina.dta saved
Armenia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        4.15    5.477917          0         22

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       52.94    77.24666          0        307

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    12.75663           0   12.75663   12.75663
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       52.94    69.87974          0   280.6458
{txt}file Armenia.dta saved
Australia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100      128.07    127.2197          4        365

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100    22829.47    23618.45        245      66436

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    178.2578           0   178.2578   178.2578
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100    22829.47     22677.9    713.031   65064.08
{txt}file Australia.dta saved
Austria

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       21.07     22.6119          0         62

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      860.41    1576.918          0       6128

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    40.83578           0   40.83578   40.83578
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      860.41    923.3747          0   2531.819
{txt}file Austria.dta saved
Azerbaijan

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        9.53    6.183156          2         22

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      514.66    377.4363         95       1359

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101     54.0042           0    54.0042    54.0042
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      514.66    333.9164   108.0084   1188.092
{txt}file Azerbaijan.dta saved
Bahrain

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       56.49    17.04687         31         84
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Bahrain.dta saved
Bangladesh

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        3.32    1.043305          0          5

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       56.33    1580.284     -15587        246

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    16.96687           0   16.96687   16.96687
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       56.33    17.70161          0   84.83434
{txt}file Bangladesh.dta saved
Barbados

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .52     .627324          0          2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       34.76    33.05004          3        124

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    66.84615           0   66.84615   66.84615
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       34.76    41.93419          0   133.6923
{txt}file Barbados.dta saved
Belarus

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        8.34    3.739551          2         15

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      732.69    425.3468        188       1547

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    87.85252           0   87.85252   87.85252
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      732.69     328.529    175.705   1317.788
{txt}file Belarus.dta saved
Belgium

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        22.3     23.7676          0         66

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      2513.6    3843.748         17      14414

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    112.7175           0   112.7175   112.7175
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      2513.6    2679.025          0   7439.355
{txt}file Belgium.dta saved
Belize

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .49    .5772628          0          2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       17.06    15.20023          2         57

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    34.81633           0   34.81633   34.81633
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       17.06    20.09817          0   69.63265
{txt}file Belize.dta saved
Benin

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       -2.82    34.26704       -342          2
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Benin.dta saved
Bhutan

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100           0           0          0          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Bhutan.dta saved
Bolivia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         7.6    3.487351          2         13

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      406.93    244.9029         90        839

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    53.54342           0   53.54342   53.54342
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      406.93    186.7247   107.0868   696.0645
{txt}file Bolivia.dta saved
Bosnia and Herzegovina

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        27.1    1.760969         25         33

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      580.17    31.96401        543        639

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    21.40849           0   21.40849   21.40849
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      580.17    37.69967   535.2122     706.48
{txt}file Bosnia and Herzegovina.dta saved
Botswana

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100          .3    .4605662          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      231.98     124.035       -567        375

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    773.2666           0   773.2666   773.2666
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      231.98    356.1404          0   773.2666
{txt}file Botswana.dta saved
Brazil

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100      101.58     66.9443         15        204

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     3023.58     2519.23        385       8541

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101     29.7655           0    29.7655    29.7655
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     3023.58    1992.631   446.4826   6072.163
{txt}file Brazil.dta saved
Brunei

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .02    .1407053          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        1.96    4.067412          0         19

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    98.00001           0   98.00001   98.00001
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        1.96    13.78912          0   98.00001
{txt}file Brunei.dta saved
Bulgaria

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       33.61      25.873          5         95

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      566.16    481.6947         66       1699

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    16.84499           0   16.84499   16.84499
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      566.16    435.8303   84.22493   1600.274
{txt}file Bulgaria.dta saved
Burkina Faso

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       10.17    8.738693          1         34

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      423.49    352.6477          2       1244

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101     41.6411           0    41.6411    41.6411
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      423.49    363.8888    41.6411   1415.797
{txt}file Burkina Faso.dta saved
Burundi

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       -7.72    120.2438      -1198          8
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Burundi.dta saved
Cambodia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .63    .8836906          0          4

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100           4    4.709758          0         19

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    6.349206           0   6.349206   6.349206
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100           4    5.610734          0   25.39683
{txt}file Cambodia.dta saved
Cameroon

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .23    .4893822          0          2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100         .82     67.2271       -658         40

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    3.565217           0   3.565217   3.565217
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100         .82    1.744754          0   7.130435
{txt}file Cameroon.dta saved
Canada

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       93.22    49.92552         20        157

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100    11674.22    4363.021       4404      17580

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101     125.233           0    125.233    125.233
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100    11674.22    6252.322    2504.66   19661.58
{txt}file Canada.dta saved
Cape Verde

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .04    .1969464          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        4.19    .5630903          3          5

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101      104.75           0     104.75     104.75
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        4.19    20.63013          0     104.75
{txt}file Cape Verde.dta saved
Central African Republic

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100         .51    4.298214        -41          4
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Central African Republic.dta saved
Chad

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100           0           0          0          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Chad.dta saved
Chile

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        12.5     6.52501          4         26

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      813.08    417.5749        287       1704

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101     65.0464           0    65.0464    65.0464
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      813.08    424.4284   260.1856   1691.206
{txt}file Chile.dta saved
China

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     3432.53     4351.98       -486      15271
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file China.dta saved
Colombia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       23.62    16.48616          4         51

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       667.6    567.9397         89       1986

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    28.26418           0   28.26418   28.26418
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       667.6    465.9679   113.0567   1441.473
{txt}file Colombia.dta saved
Congo

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .16    .3684529          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        1.96    2.874197          0         12

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101       12.25           0      12.25      12.25
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        1.96    4.513549          0      12.25
{txt}file Congo.dta saved
Costa Rica

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         1.2    .7247431          0          3

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       52.32    34.34403       -149        114

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101        43.6           0       43.6       43.6
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       52.32     31.5988          0      130.8
{txt}file Costa Rica.dta saved
Cote d'Ivoire

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100          .2    .4020151          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       24.42    5.460936         16         35

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101       122.1           0      122.1      122.1
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       24.42    49.08605          0      122.1
{txt}file Cote d'Ivoire.dta saved
Croatia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       23.09    19.89421          1         62

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      960.51    1016.962         51       3517

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    41.59853           0   41.59853   41.59853
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      960.51    827.5699   41.59853   2579.109
{txt}file Croatia.dta saved
Cuba

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .15    .3588703          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        18.6    24.30904          0         96

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101         124           0        124        124
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        18.6    44.49991          0        124
{txt}file Cuba.dta saved
Cyprus

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        1.13    .8721852          0          2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      125.32    164.2074          0        511

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    110.9027           0   110.9027   110.9027
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      125.32    96.72766          0   221.8053
{txt}file Cyprus.dta saved
Czech Republic

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       67.82    67.19659          0        188

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      2828.4    4260.026          2      14741

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    41.70451           0   41.70451   41.70451
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      2828.4    2802.401          0   7840.448
{txt}file Czech Republic.dta saved
Democratic Republic of the Congo

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .74    .4631905          0          2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       14.94    18.71683       -165         26

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    20.18919           0   20.18919   20.18919
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       14.94     9.35144          0   40.37838
{txt}file Democratic Republic of the Congo.dta saved
Denmark

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       10.55    2.965713          5         16

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     2974.33    1320.687       1129       4997

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101     281.927           0    281.927    281.927
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     2974.33    836.1146   1409.635   4510.832
{txt}file Denmark.dta saved
Diamond Princess

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100           0           0          0          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Diamond Princess.dta saved
Djibouti

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100           0    .1421338         -1          1
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Djibouti.dta saved
Dominica

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .11     .314466          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100         .97    1.997246         -1         10

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    8.818182           0   8.818182   8.818182
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100         .97    2.773019          0   8.818182
{txt}file Dominica.dta saved
Dominican Republic

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .23     .446196          0          2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        32.4    49.90253          0        209

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    140.8696           0   140.8696   140.8696
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        32.4    62.85544          0   281.7391
{txt}file Dominican Republic.dta saved
Ecuador

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       13.56    6.445294          4         24

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      139.11    100.6049       -312        345

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    10.25885           0   10.25885   10.25885
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      139.11     66.1213    41.0354   246.2124
{txt}file Ecuador.dta saved
Egypt

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       36.01    15.78997         10         57

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      443.62    256.6276         97        885

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    12.31936           0   12.31936   12.31936
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      443.62    194.5223   123.1936   702.2033
{txt}file Egypt.dta saved
El Salvador

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .35    .6092718          0          2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        3.98    81.69195       -791         53

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    11.37143           0   11.37143   11.37143
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        3.98    6.928291          0   22.74286
{txt}file El Salvador.dta saved
Equatorial Guinea

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .01          .1          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100         .31    .5807519          0          2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101          31           0         31         31
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100         .31         3.1          0         31
{txt}file Equatorial Guinea.dta saved
Eritrea

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        1.14    .5688905          0          2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        38.4    12.02103         -9         60

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    33.68421           0   33.68421   33.68421
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        38.4    19.16263          0   67.36842
{txt}file Eritrea.dta saved
Estonia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        1.24    1.223672          0          5

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      115.42    112.9334         11        417

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    93.08064           0   93.08064   93.08064
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      115.42    113.9002          0   465.4032
{txt}file Estonia.dta saved
Eswatini

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       24.53     24.5367          0         69

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     1029.12    911.5737         36       2702

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    41.95353           0   41.95353   41.95353
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     1029.12    1029.401          0   2894.793
{txt}file Eswatini.dta saved
Ethiopia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        1.58    2.025993          0          7

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       20.85    36.35692          0        121

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101     13.1962           0    13.1962    13.1962
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       20.85    26.73541          0   92.37341
{txt}file Ethiopia.dta saved
Fiji

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .02    .1407053          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100         .83    1.146404         -1          4

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101        41.5           0       41.5       41.5
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100         .83     5.83927          0       41.5
{txt}file Fiji.dta saved
Finland

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       18.73    5.387706          8         27

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     2295.75    563.2304       1278       3014

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    122.5707           0   122.5707   122.5707
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     2295.75    660.3751    980.566    3309.41
{txt}file Finland.dta saved
France

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100      216.46    149.8552         15        455

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100    14506.96    16403.02        342      47391

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    67.01913           0   67.01913   67.01913
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100    14506.96    10043.16   1005.287    30493.7
{txt}file France.dta saved
Gabon

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100          .1    .3015113          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        4.23    5.108628          0         20

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101        42.3           0       42.3       42.3
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        4.23    12.75393          0       42.3
{txt}file Gabon.dta saved
Georgia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       36.41    15.29712         14         61

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     1841.29    878.5174        667       3520

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101      50.571           0     50.571     50.571
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     1841.29    773.5907    707.994   3084.831
{txt}file Georgia.dta saved
Germany

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100      155.37     161.534          2        438

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100    10281.83     14439.1         99      50655

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    66.17642           0   66.17642   66.17642
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100    10281.83    10689.74   132.3528   28985.27
{txt}file Germany.dta saved
Ghana

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       39.58    72.97518          0        328

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100    33224.11    55624.14         55     201518

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    839.4166           0   839.4166   839.4166
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100    33224.11    61256.58          0   275328.6
{txt}file Ghana.dta saved
Greece

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       35.26    31.10641          2         93

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     1322.06    1498.554         59       5183

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    37.49461           0   37.49461   37.49461
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     1322.06    1166.323   74.98923   3486.999
{txt}file Greece.dta saved
Grenada

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100         .36    .5949281         -1          2
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Grenada.dta saved
Guatemala

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        4.32    3.437406          0         11

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       97.43    92.40406          8        326

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    22.55324           0   22.55324   22.55324
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       97.43    77.52463          0   248.0856
{txt}file Guatemala.dta saved
Guinea

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        5.64    1.059064          4          8
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Guinea.dta saved
Guinea-Bissau

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .02    .1407053          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100         .01          .1          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101          .5           0         .5         .5
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100         .01    .0703526          0         .5
{txt}file Guinea-Bissau.dta saved
Guyana

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        1.09     .712018          0          3

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       23.32    13.67064          6         52

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101     21.3945           0    21.3945    21.3945
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       23.32    15.23327          0   64.18349
{txt}file Guyana.dta saved
Haiti

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        1.26    .4845075          0          2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       20.72    4.601449         14         29

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    16.44444           0   16.44444   16.44444
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       20.72    7.967456          0   32.88889
{txt}file Haiti.dta saved
Holy See

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        -.04          .4         -4          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Holy See.dta saved
Honduras

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .54    .6578201          0          2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       12.16    18.07265          0         54

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    22.51852           0   22.51852   22.51852
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       12.16    14.81313          0   45.03703
{txt}file Honduras.dta saved
Hungary

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       77.34    86.31271          0        238

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     1317.24    2023.094          3       7508

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    17.03181           0   17.03181   17.03181
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     1317.24    1470.062          0   4053.571
{txt}file Hungary.dta saved
Iceland

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       16.14    23.46156          0         98
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Iceland.dta saved
India

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100      229.03    44.61563        180        369

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      6642.4    583.5761       6116       8207

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    29.00231           0   29.00231   29.00231
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      6642.4    1293.957   5220.417   10701.85
{txt}file India.dta saved
Indonesia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        2.58     2.75307          0         10

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       43.04    108.4759       -856        217

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    16.68217           0   16.68217   16.68217
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       43.04    45.92718          0   166.8217
{txt}file Indonesia.dta saved
Iran

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       21.79    20.65801          2         77

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      798.41    790.5213         73       2985

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    36.64112           0   36.64112   36.64112
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100    798.4099    756.9326   73.28223   2821.366
{txt}file Iran.dta saved
Iraq

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        5.72    3.992619          0         14

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      191.38    186.3141          4        596

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    33.45804           0   33.45804   33.45804
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      191.38    133.5852          0   468.4126
{txt}file Iraq.dta saved
Ireland

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        3.82    2.528145          0          8

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     1493.05    1211.309        239       4271

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    390.8508           0   390.8508   390.8508
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     1493.05    988.1273          0   3126.806
{txt}file Ireland.dta saved
Israel

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        3.01    .9155779          1          5

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      850.61    121.5283        573        970

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    282.5947           0   282.5947   282.5947
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100    850.6099    258.7374   282.5947   1412.973
{txt}file Israel.dta saved
Italy

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100      132.44    28.49892         83        169

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100    11696.59    3417.789       6283      16777

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    88.31614           0   88.31614   88.31614
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100    11696.59    2516.914    7330.24   14925.43
{txt}file Italy.dta saved
Jamaica

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        1.16    1.041755          0          4

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       12.33    10.97017          1         40

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    10.62931           0   10.62931   10.62931
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       12.33    11.07313          0   42.51724
{txt}file Jamaica.dta saved
Japan

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        1.59    .9959007          0          4

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      406.82    290.1228        109       1069

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    255.8616           0   255.8616   255.8616
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      406.82    254.8128          0   1023.447
{txt}file Japan.dta saved
Jordan

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       67.23    12.51573         31         84

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     4621.55    1234.717       2201       5915

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    68.74237           0   68.74237   68.74237
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     4621.55    860.3611   2131.013   5774.359
{txt}file Jordan.dta saved
Kazakhstan

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        5.06    4.629331          0         17

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       136.4    1060.479     -10208        685

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    26.95652           0   26.95652   26.95652
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       136.4    124.7907          0   458.2608
{txt}file Kazakhstan.dta saved
Kenya

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .69    .4648232          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       80.92    27.54452         25        113

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    117.2754           0   117.2754   117.2754
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       80.92    54.51231          0   117.2754
{txt}file Kenya.dta saved
Kosovo

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .09    .2876235          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        3.79    1.950369          1          8

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    42.11111           0   42.11111   42.11111
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        3.79    12.11214          0   42.11111
{txt}file Kosovo.dta saved
Kuwait

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100         9.2    12.01262          0         31
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Kuwait.dta saved
Kyrgyzstan

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .98    .6813534          0          2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       21.67    12.10814          6         48

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    22.11224           0   22.11224   22.11224
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       21.67    15.06625          0   44.22449
{txt}file Kyrgyzstan.dta saved
Laos

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        5.22    1.069126          3          7

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      858.65    195.0397        552       1181

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    164.4924           0   164.4924   164.4924
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100    858.6501     175.863   493.4771   1151.447
{txt}file Laos.dta saved
Latvia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        5.22    4.430336          0         17

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      181.96    173.8109         17        622

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    34.85824           0   34.85824   34.85824
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      181.96    154.4337          0   592.5901
{txt}file Latvia.dta saved
Lebanon

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       45.36    24.47985         10        100

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     5395.21    2212.671       1785       8326

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101     118.942           0    118.942    118.942
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     5395.21    2911.683    1189.42    11894.2
{txt}file Lebanon.dta saved
Liberia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100           0    .1421338         -1          1
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Liberia.dta saved
Libya

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        7.24    1.288018          5          9

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       352.1    70.61526        237        460

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101     48.6326           0    48.6326    48.6326
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       352.1    62.63965    243.163   437.6934
{txt}file Libya.dta saved
Liechtenstein

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       10.54    15.90465          0         51
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Liechtenstein.dta saved
Lithuania

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        9.22    5.861327          1         21

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      545.34    465.9209         85       1630

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    59.14751           0   59.14751   59.14751
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      545.34    346.6829   59.14751   1242.098
{txt}file Lithuania.dta saved
Luxembourg

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        1.75    1.217507          0          4

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      152.42    151.8869          5        447

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    87.09715           0   87.09715   87.09715
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      152.42    106.0414          0   348.3886
{txt}file Luxembourg.dta saved
MS Zaandam

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        -.01          .1         -1          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file MS Zaandam.dta saved
Macedonia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        6.28    4.230911          1         15

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      108.52    79.51691         21        293

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    17.28025           0   17.28025   17.28025
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      108.52    73.11121   17.28025   259.2038
{txt}file Macedonia.dta saved
Madagascar

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        7.96    3.884494          0         14

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      137.01    53.72667         61        232

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    17.21231           0   17.21231   17.21231
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      137.01    66.86112          0   240.9724
{txt}file Madagascar.dta saved
Malawi

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       29.78    43.20507          0        174

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     1407.37    1894.759         18       6586

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101     47.2589           0    47.2589    47.2589
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     1407.37    2041.824          0   8223.048
{txt}file Malawi.dta saved
Malaysia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       27.63    11.31965         11         45

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     2306.67    1132.814        875       4685

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    83.48425           0   83.48425   83.48425
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     2306.67    945.0124   918.3268   3756.792
{txt}file Malaysia.dta saved
Maldives

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .17    .3775252          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       43.17    35.47771          4        116

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    253.9412           0   253.9412   253.9412
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       43.17    95.86918          0   253.9412
{txt}file Maldives.dta saved
Mali

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        4.65    2.829766          0          9

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      125.97    99.70507          3        281

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    27.09032           0   27.09032   27.09032
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      125.97    76.65927          0   243.8129
{txt}file Mali.dta saved
Malta

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .59    .4943111          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       73.03     32.3661         19        110

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    123.7797           0   123.7797   123.7797
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       73.03    61.18566          0   123.7797
{txt}file Malta.dta saved
Mauritania

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        1.01    .7452882          0          2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       17.76    12.41953          4         47

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    17.58416           0   17.58416   17.58416
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       17.76    13.10527          0   35.16832
{txt}file Mauritania.dta saved
Mauritius

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .12    .3265986          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       30.56    67.15072       -591         90

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    254.6667           0   254.6667   254.6667
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       30.56    83.17379          0   254.6667
{txt}file Mauritius.dta saved
Mexico

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         157    10.56772        143        188

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     2947.78    507.2035       2508       4144

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    18.77567           0   18.77567   18.77567
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     2947.78     198.416   2684.921   3529.826
{txt}file Mexico.dta saved
Moldova

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        8.83    6.115149          1         23

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      172.29     129.243         31        475

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    19.51189           0   19.51189   19.51189
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      172.29    119.3181   19.51189   448.7735
{txt}file Moldova.dta saved
Monaco

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       18.26    4.772861          9         24
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Monaco.dta saved
Mongolia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           1    1.255292          0          5

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       28.91    342.6333      -3292        265

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101       28.91           0      28.91      28.91
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       28.91    36.29049          0     144.55
{txt}file Mongolia.dta saved
Montenegro

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        1.24    1.378918          0          5

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       40.79    52.09147       -106        186

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    32.89516           0   32.89516   32.89516
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       40.79    45.35972          0   164.4758
{txt}file Montenegro.dta saved
Morocco

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        3.32    1.626051          1          7

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      327.83     158.372        132        648

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    98.74397           0   98.74397   98.74397
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      327.83    160.5627   98.74397   691.2078
{txt}file Morocco.dta saved
Mozambique

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .16    .3684529          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100         7.9    3.023477          2         12

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101      49.375           0     49.375     49.375
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100         7.9    18.19236          0     49.375
{txt}file Mozambique.dta saved
Myanmar

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        1.78    1.951845          0          7

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       68.91    118.7267       -709        330

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    38.71349           0   38.71349   38.71349
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       68.91     75.5627          0   270.9944
{txt}file Myanmar.dta saved
Namibia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         4.4    4.811602          0         18

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      306.59    314.8772        -77       1073

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    69.67954           0   69.67954   69.67954
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      306.59    335.2702          0   1254.232
{txt}file Namibia.dta saved
Nepal

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        1.11    .9089343          0          3

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       73.85    72.24361          3        229

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    66.53153           0   66.53153   66.53153
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       73.85    60.47279          0   199.5946
{txt}file Nepal.dta saved
Netherlands

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       35.23     26.1981          2         76

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     6191.88    6506.338        255      20377

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    175.7559           0   175.7559   175.7559
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     6191.88    4604.471   351.5118   13357.45
{txt}file Netherlands.dta saved
New Zealand

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .11     .314466          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       17.32    26.49371          0        100

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    157.4545           0   157.4545   157.4545
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       17.32    49.51411          0   157.4545
{txt}file New Zealand.dta saved
Nicaragua

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .03    .1714466          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        1.59    2.429179          0          9

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101          53           0         53         53
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        1.59    9.086671          0         53
{txt}file Nicaragua.dta saved
Niger

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .49    .5411361          0          2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        3.86    3.238094          0         12

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    7.877551           0   7.877551   7.877551
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        3.86    4.262827          0    15.7551
{txt}file Niger.dta saved
Nigeria

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        1.38    .5822284          0          2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      164.53    45.17742         77        224

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    119.2246           0   119.2246   119.2246
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      164.53    69.41597          0   238.4493
{txt}file Nigeria.dta saved
Norway

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        8.02    6.518009          0         18

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     1183.28     1388.46         34       4320

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    147.5411           0   147.5411   147.5411
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     1183.28    961.6745          0    2655.74
{txt}file Norway.dta saved
Oman

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       73.19    58.40017         12        207
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Oman.dta saved
Pakistan

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        5.43    .6705192          4          8

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      385.18    31.72718        350        454

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    70.93555           0   70.93555   70.93555
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      385.18    47.56364   283.7422   567.4844
{txt}file Pakistan.dta saved
Panama

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        1.34    .6231234          0          2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       97.27    60.68446       -212        194

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    72.58955           0   72.58955   72.58955
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100    97.26999    45.23225          0   145.1791
{txt}file Panama.dta saved
Papua New Guinea

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .57    .8558179          0          3

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100          11    15.89994          0         59

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    19.29825           0   19.29825   19.29825
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100          11    16.51578          0   57.89474
{txt}file Papua New Guinea.dta saved
Paraguay

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       12.27    1.835976          7         17

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       72.18    7.399672          4         77

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101     5.88264           0    5.88264    5.88264
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       72.18    10.80039   41.17848   100.0049
{txt}file Paraguay.dta saved
Peru

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       85.09    20.80409         42        110

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     2130.62    445.4828       1294       2703

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    25.03961           0   25.03961   25.03961
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     2130.62    520.9262   1051.664   2754.357
{txt}file Peru.dta saved
Philippines

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       12.39    23.87928          0        110

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       31.35    61.94285          0        280

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    2.530266           0   2.530266   2.530266
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       31.35    60.42094          0   278.3293
{txt}file Philippines.dta saved
Poland

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100      264.98    205.3033          5        551

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     6350.49    7643.642         47      22810

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    23.96592           0   23.96592   23.96592
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     6350.49    4920.282   119.8296   13205.22
{txt}file Poland.dta saved
Portugal

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       18.12    17.34107          0         45

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      861.05    1328.854          0       4223

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    47.51931           0   47.51931   47.51931
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      861.05    824.0358          0   2138.369
{txt}file Portugal.dta saved
Qatar

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      271.16    53.15913        164        328
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Qatar.dta saved
Romania

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       16.57    23.93942          0        104

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      190.64    254.1549          6       1031

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    11.50513           0   11.50513   11.50513
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      190.64    275.4262          0   1196.533
{txt}file Romania.dta saved
Russian Federation

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100      680.02     298.807        230       1175

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100    14268.16    8038.621       4245      30258

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    20.98197           0   20.98197   20.98197
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100    14268.16    6269.559   4825.853   24653.81
{txt}file Russian Federation.dta saved
Rwanda

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .04    .1969464          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        2.42    3.587802          0         12

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101        60.5           0       60.5       60.5
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        2.42    11.91526          0       60.5
{txt}file Rwanda.dta saved
Saint Kitts and Nevis

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .01          .1          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100         .02    .4709758         -4          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101           2           0          2          2
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100         .02          .2          0          2
{txt}file Saint Kitts and Nevis.dta saved
Saint Lucia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .15    .3588703          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        2.69    2.038493          0          7

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    17.93333           0   17.93333   17.93333
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        2.69     6.43574          0   17.93333
{txt}file Saint Lucia.dta saved
Saint Vincent and the Grenadines

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .07    .2564324          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        6.64    10.75862        -92         16

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    94.85714           0   94.85714   94.85714
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        6.64    24.32444          0   94.85714
{txt}file Saint Vincent and the Grenadines.dta saved
San Marino

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .09    .2876235          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       20.33    17.57067          1         49

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    225.8889           0   225.8889   225.8889
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       20.33    64.97095          0   225.8889
{txt}file San Marino.dta saved
Sao Tome and Principe

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        -.63         6.3        -63          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Sao Tome and Principe.dta saved
Saudi Arabia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           1    .2010076          0          2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       34.12    2.262027         29         37

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101       34.12           0      34.12      34.12
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       34.12    6.858378          0      68.24
{txt}file Saudi Arabia.dta saved
Senegal

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .66    .6849021          0          2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       23.87    19.75642          4         70

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    36.16667           0   36.16667   36.16667
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       23.87    24.77063          0   72.33334
{txt}file Senegal.dta saved
Serbia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        9.19     10.0972          0         40

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      340.68    398.7628         15       1517

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    37.07073           0   37.07073   37.07073
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      340.68    374.3105          0   1482.829
{txt}file Serbia.dta saved
Seychelles

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100          .1    .3015113          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       12.08    15.11015        -94         36

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101       120.8           0      120.8      120.8
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       12.08    36.42257          0      120.8
{txt}file Seychelles.dta saved
Sierra Leone

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100           0    .1421338         -1          1
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Sierra Leone.dta saved
Singapore

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        1.55    1.898298          0          7

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      153.39    187.0946          6        731

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101     98.9613           0    98.9613    98.9613
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      153.39     187.858          0   692.7291
{txt}file Singapore.dta saved
Slovakia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       42.32    29.07979          3         84

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     3428.81    3217.668        299      10307

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    81.02103           0   81.02103   81.02103
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     3428.81    2356.074   243.0631   6805.767
{txt}file Slovakia.dta saved
Slovenia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        4.08    4.700484          0         17

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      324.75    383.5332         17       1479

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    79.59559           0   79.59559   79.59559
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      324.75    374.1378          0   1353.125
{txt}file Slovenia.dta saved
Somalia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .04    .1969464          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100         .13    3.471835        -33          4

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101        3.25           0       3.25       3.25
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100         .13    .6400758          0       3.25
{txt}file Somalia.dta saved
South Africa

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100      110.95    44.19067         35        223

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     1091.32     590.576        314       2236

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    9.836143           0   9.836143   9.836143
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     1091.32    434.6658    344.265    2193.46
{txt}file South Africa.dta saved
South Korea

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100      130.76    36.62398         51        179

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     8505.34    2621.923       3439      11809

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    65.04543           0   65.04543   65.04543
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     8505.34    2382.222   3317.317   11643.13
{txt}file South Korea.dta saved
South Sudan

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        4.42    16.50784       -158         10
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file South Sudan.dta saved
Spain

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100      112.37     42.2481         31        169

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     8529.58    4797.019       1698      14810

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101     75.9062           0    75.9062    75.9062
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     8529.58    3206.893   2353.092   12828.15
{txt}file Spain.dta saved
Sri Lanka

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       20.23    2.707472         16         26

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      599.39    60.05518        520        725

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    29.62877           0   29.62877   29.62877
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      599.39    80.21906   474.0603    770.348
{txt}file Sri Lanka.dta saved
Sudan

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       68.72     69.0535          5        293

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     2195.45    2130.282        198       7410

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    31.94776           0   31.94776   31.94776
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     2195.45    2206.104   159.7388   9360.693
{txt}file Sudan.dta saved
Suriname

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .32    .4688262          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        7.27    7.196878          0         27

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    22.71875           0   22.71875   22.71875
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        7.27    10.65114          0   22.71875
{txt}file Suriname.dta saved
Sweden

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        5.34    3.075547          1         11

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      742.46    651.4859        114       2145

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    139.0375           0   139.0375   139.0375
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      742.46    427.6163   139.0375   1529.412
{txt}file Sweden.dta saved
Switzerland

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       25.36    21.17151          0         59

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     2186.65    3019.419          6       9422

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    86.22437           0   86.22437   86.22437
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     2186.65      1825.5          0   5087.237
{txt}file Switzerland.dta saved
Syria

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        1.32    1.052942          0          5

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       34.21    22.17346        -39         84

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    25.91666           0   25.91666   25.91666
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       34.21    27.28874          0   129.5833
{txt}file Syria.dta saved
Tanzania

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       -1.96        19.6       -196          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Tanzania.dta saved
Thailand

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       20.37    6.670688         13         36

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     3382.76    352.4353       2795       4458

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    166.0658           0   166.0658   166.0658
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     3382.76    1107.773   2158.855   5978.368
{txt}file Thailand.dta saved
The Bahamas

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .11     .314466          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        4.36    2.783501         -7          9

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    39.63636           0   39.63636   39.63636
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        4.36    12.46429          0   39.63636
{txt}file The Bahamas.dta saved
The Gambia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        -.63         6.3        -63          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file The Gambia.dta saved
Timor-Leste

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100         .02          .2         -1          1
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Timor-Leste.dta saved
Togo

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        5.34    4.708085          0         12
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Togo.dta saved
Trinidad and Tobago

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       36.79      10.546         14         51

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      609.02    264.3162        167        911

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    16.55396           0   16.55396   16.55396
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      609.02     174.578   231.7554   844.2517
{txt}file Trinidad and Tobago.dta saved
Tunisia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        9.43    2.450541          4         13

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      250.02    33.86813        170        282

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    26.51326           0   26.51326   26.51326
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      250.02    64.97182    106.053   344.6723
{txt}file Tunisia.dta saved
Turkey

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100      125.85    39.37193         65        191

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     12481.9     4514.56       6315      20938

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    99.18078           0   99.18078   99.18078
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     12481.9    3904.939    6446.75   18943.53
{txt}file Turkey.dta saved
Uganda

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100          .3    .4605662          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       13.74    10.39582        -60         31

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101        45.8           0       45.8       45.8
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       13.74    21.09393          0       45.8
{txt}file Uganda.dta saved
Ukraine

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100      154.05    130.1758         20        481

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     3041.62        2650        415       9862

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    19.74437           0   19.74437   19.74437
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     3041.62     2570.24   394.8874   9497.042
{txt}file Ukraine.dta saved
United Arab Emirates

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .16    .3684529          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       28.15    12.41974         12         55

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    175.9375           0   175.9375   175.9375
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       28.15    64.82469          0   175.9375
{txt}file United Arab Emirates.dta saved
United Kingdom

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        79.8    48.64092         11        143

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100    13482.23     12030.5       1238      39855

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    168.9503           0   168.9503   168.9503
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100    13482.23    8217.896   1858.453   24159.89
{txt}file United Kingdom.dta saved
United States

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100      1085.5    366.0334        430       1601

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100    62094.69    29624.06      20400     110120

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    57.20377           0   57.20377   57.20377
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100    62094.69    20938.49   24597.62   91583.23
{txt}file United States.dta saved
Uruguay

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        2.23    .5290548          1          3

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      259.09    35.38592        178        296

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    116.1839           0   116.1839   116.1839
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      259.09    61.46763   116.1839   348.5516
{txt}file Uruguay.dta saved
Uzbekistan

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .73    1.052702          0          3

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       28.34     49.0955          0        184

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    38.82192           0   38.82192   38.82192
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       28.34    40.86792          0   116.4658
{txt}file Uzbekistan.dta saved
Venezuela

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        3.46    1.986927          1          8

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      240.99    138.8681         77        563

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    69.65029           0   69.65029   69.65029
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      240.99      138.39   69.65029   557.2023
{txt}file Venezuela.dta saved
Vietnam

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       212.9    96.26368         62        354

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     6513.37    4266.495       1312      14230

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    30.59357           0   30.59357   30.59357
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     6513.37    2945.049   1896.801   10830.12
{txt}file Vietnam.dta saved
West Bank and Gaza

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        2.35          .5          1          3

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      211.58    6.017114        169        216

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    90.03405           0   90.03405   90.03405
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      211.58    45.01702   90.03405   270.1021
{txt}file West Bank and Gaza.dta saved
Western Sahara

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100           0           0          0          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Western Sahara.dta saved
Yemen

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .37    .4852366          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        1.82    2.446932          0          6

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    4.918919           0   4.918919   4.918919
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        1.82     2.38684          0   4.918919
{txt}file Yemen.dta saved
Zambia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .07    .2564324          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        7.47    2.148314          3         11

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    106.7143           0   106.7143   106.7143
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        7.47      27.365          0   106.7143
{txt}file Zambia.dta saved
Zimbabwe

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22623{txt},{res}22623{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}09dec2021{txt},{res}09dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22623{col 40}{txt}09dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100      405.99    577.7637          1       2036

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100    36672.49    38772.22        345     102176

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    90.32855           0   90.32855   90.32855
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100    36672.49    52188.56   90.32855   183908.9
{txt}file Zimbabwe.dta saved

{com}. *       
. 
. 
. 
. * append country files
. 
. 
. clear   
{txt}
{com}. local list3 `" Afghanistan Albania Algeria Andorra Angola "Antigua and Barbuda" Argentina Armenia Australia Austria Azerbaijan Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bhutan Bolivia "Bosnia and Herzegovina" Botswana Brazil Brunei Bulgaria "Burkina Faso" Burundi Cambodia Cameroon Canada "Cape Verde" "Central African Republic" Chad Chile China Colombia Congo "Costa Rica" "Cote d'Ivoire" Croatia Cuba Cyprus "Czech Republic" "Democratic Republic of the Congo" Denmark "Diamond Princess" Djibouti Dominica "Dominican Republic" Ecuador Egypt "El Salvador" "Equatorial Guinea" Eritrea Estonia Eswatini Ethiopia Fiji Finland France Gabon Georgia Germany Ghana Greece Grenada Guatemala Guinea "Guinea-Bissau" Guyana Haiti "Holy See" Honduras Hungary Iceland India Indonesia Iran Iraq Ireland Israel Italy Jamaica Japan Jordan Kazakhstan Kenya Kosovo Kuwait Kyrgyzstan Laos Latvia Lebanon Liberia Libya Liechtenstein Lithuania Luxembourg "MS Zaandam" Macedonia Madagascar Malawi Malaysia Maldives Mali Malta Mauritania Mauritius Mexico Moldova Monaco Mongolia Montenegro Morocco Mozambique Myanmar Namibia Nepal Netherlands "New Zealand" Nicaragua Niger Nigeria Norway Oman Pakistan Panama "Papua New Guinea" Paraguay Peru Philippines Poland Portugal Qatar Romania "Russian Federation" Rwanda "Saint Kitts and Nevis" "Saint Lucia" "Saint Vincent and the Grenadines" "San Marino" "Sao Tome and Principe" "Saudi Arabia" Senegal Serbia Seychelles "Sierra Leone" Singapore Slovakia Slovenia Somalia "South Africa" "South Korea" "South Sudan" Spain "Sri Lanka" Sudan Suriname Sweden Switzerland Syria Tanzania Thailand "The Bahamas" "The Gambia" "Timor-Leste" Togo "Trinidad and Tobago" Tunisia Turkey Uganda Ukraine "United Arab Emirates" "United Kingdom" "United States" Uruguay Uzbekistan Venezuela Vietnam "West Bank and Gaza" "Western Sahara" Yemen Zambia Zimbabwe "'
{txt}
{com}. 
. foreach m of local list3 {c -(}
{txt}  2{com}.         di "`m'"
{txt}  3{com}.         append using "`m'"
{txt}  4{com}.         
. {c )-}       
Afghanistan
Albania
Algeria
Andorra
Angola
Antigua and Barbuda
Argentina
Armenia
Australia
Austria
Azerbaijan
Bahrain
Bangladesh
Barbados
Belarus
Belgium
Belize
Benin
Bhutan
Bolivia
Bosnia and Herzegovina
Botswana
Brazil
Brunei
Bulgaria
Burkina Faso
Burundi
Cambodia
Cameroon
Canada
Cape Verde
Central African Republic
Chad
Chile
China
Colombia
Congo
Costa Rica
Cote d'Ivoire
Croatia
Cuba
Cyprus
Czech Republic
Democratic Republic of the Congo
Denmark
Diamond Princess
Djibouti
Dominica
Dominican Republic
Ecuador
Egypt
El Salvador
Equatorial Guinea
Eritrea
Estonia
Eswatini
Ethiopia
Fiji
Finland
France
Gabon
Georgia
Germany
Ghana
Greece
Grenada
Guatemala
Guinea
Guinea-Bissau
Guyana
Haiti
Holy See
Honduras
Hungary
Iceland
India
Indonesia
Iran
Iraq
Ireland
Israel
Italy
Jamaica
Japan
Jordan
Kazakhstan
Kenya
Kosovo
Kuwait
Kyrgyzstan
Laos
Latvia
Lebanon
Liberia
Libya
Liechtenstein
Lithuania
Luxembourg
MS Zaandam
Macedonia
Madagascar
Malawi
Malaysia
Maldives
Mali
Malta
Mauritania
Mauritius
Mexico
Moldova
Monaco
Mongolia
Montenegro
Morocco
Mozambique
Myanmar
Namibia
Nepal
Netherlands
New Zealand
Nicaragua
Niger
Nigeria
Norway
Oman
Pakistan
Panama
Papua New Guinea
Paraguay
Peru
Philippines
Poland
Portugal
Qatar
Romania
Russian Federation
Rwanda
Saint Kitts and Nevis
Saint Lucia
Saint Vincent and the Grenadines
San Marino
Sao Tome and Principe
Saudi Arabia
Senegal
Serbia
Seychelles
Sierra Leone
Singapore
Slovakia
Slovenia
Somalia
South Africa
South Korea
South Sudan
Spain
Sri Lanka
Sudan
Suriname
Sweden
Switzerland
Syria
Tanzania
Thailand
The Bahamas
The Gambia
Timor-Leste
Togo
Trinidad and Tobago
Tunisia
Turkey
Uganda
Ukraine
United Arab Emirates
United Kingdom
United States
Uruguay
Uzbekistan
Venezuela
Vietnam
West Bank and Gaza
Western Sahara
Yemen
Zambia
Zimbabwe
{txt}
{com}. *       
. 
. rename country loc_grand_name
{res}{txt}
{com}. 
. order loc_grand_name date
{txt}
{com}. 
. sort loc_grand_name date
{txt}
{com}. 
. save "SRIV.dta", replace
{txt}file SRIV.dta saved

{com}.  
. 
. 
.  
. ***********
. 
. * gen global sum
. 
. use "SRIV.dta", clear 
{txt}
{com}. 
. collapse (sum) TotDeaMeRaA05S00-DayDMuMeRaA05S00, by(date)
{txt}
{com}.  
. foreach var of varlist DayDeaMeRaA05S00 DayDeaLoRaA05S00 DayDeaUpRaA05S00 ///
> DayCasMeRaA05S00 DayCasLoRaA05S00 DayCasUpRaA05S00 {c -(}
{txt}  2{com}.         replace `var' = . if `var' == 0
{txt}  3{com}. {c )-}
{txt}(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)

{com}. *       
.  
. label var TotDeaMeRaA05S00 "Total Deaths Mean SRIV"
{txt}
{com}. label var TotDeaLoRaA05S00 "Total Deaths Lower SRIV"
{txt}
{com}. label var TotDeaUpRaA05S00 "Total Deaths Upper SRIV"
{txt}
{com}. label var TotCasMeRaA05S00 "Total Cases Mean SRIV"
{txt}
{com}. label var TotCasLoRaA05S00 "Total Cases Lower SRIV"
{txt}
{com}. label var TotCasUpRaA05S00 "Total Cases Upper SRIV" 
{txt}
{com}. 
. label var DayDeaMeRaA05S00 "Daily Deaths Mean SRIV"
{txt}
{com}. label var DayDeaLoRaA05S00 "Daily Deaths Lower SRIV"
{txt}
{com}. label var DayDeaUpRaA05S00 "Daily Deaths Upper SRIV"
{txt}
{com}. label var DayCasMeRaA05S00 "Daily Cases Mean SRIV"
{txt}
{com}. label var DayCasLoRaA05S00 "Daily Cases Lower SRIV"
{txt}
{com}. label var DayCasUpRaA05S00 "Daily Cases Upper SRIV" 
{txt}
{com}. 
. label var DayDeMMeRaA05S00 "Daily deaths mean SRIV  DayDeM"
{txt}
{com}. label var DayCaMMeRaA05S00 "Daily cases mean SRIV  DayCaM"
{txt}
{com}. label var DayCbDMeRaA05S00 "Daily cases mean div by daily deaths mean SRIV  DayCbD"
{txt}
{com}. label var DayDMuMeRaA05S00 "Daily deaths scaled (times means of cases by deaths) SRIV"
{txt}
{com}.         
. gen loc_grand_name = " GLOBAL"
{txt}
{com}. 
. save "SRIV GLOBAL.dta", replace 
{txt}file SRIV GLOBAL.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. *****************************
. 
. * gen AFRO
. 
. use "SRIV.dta", clear
{txt}
{com}. 
. keep if ///
> loc_grand_name == "Algeria" | ///
> loc_grand_name == "Angola" | ///
> loc_grand_name == "Benin" | ///
> loc_grand_name == "Botswana" | ///
> loc_grand_name == "Burkina Faso" | ///
> loc_grand_name == "Burundi" | ///
> loc_grand_name == "Cameroon" | ///
> loc_grand_name == "Cape Verde" | ///
> loc_grand_name == "Central African Republic" | ///
> loc_grand_name == "Chad" | ///
> loc_grand_name == "Congo" | ///
> loc_grand_name == "Cote d'Ivoire" | ///
> loc_grand_name == "Democratic Republic of the Congo" | ///
> loc_grand_name == "Equatorial Guinea" | ///
> loc_grand_name == "Eritrea" | ///
> loc_grand_name == "Eswatini" | ///
> loc_grand_name == "Ethiopia" | ///
> loc_grand_name == "Gabon" | ///
> loc_grand_name == "Ghana" | ///
> loc_grand_name == "Guinea" | ///
> loc_grand_name == "Guinea-Bissau" | ///
> loc_grand_name == "Kenya" | ///
> loc_grand_name == "Liberia" | ///
> loc_grand_name == "Madagascar" | ///
> loc_grand_name == "Malawi" | ///
> loc_grand_name == "Mali" | ///
> loc_grand_name == "Mauritania" | ///
> loc_grand_name == "Mauritius" | ///
> loc_grand_name == "Mozambique" | ///
> loc_grand_name == "Namibia" | ///
> loc_grand_name == "Niger" | ///
> loc_grand_name == "Nigeria" | ///
> loc_grand_name == "Rwanda" | ///
> loc_grand_name == "Sao Tome and Principe" | ///
> loc_grand_name == "Senegal" | ///
> loc_grand_name == "Seychelles" | ///
> loc_grand_name == "Sierra Leone" | ///
> loc_grand_name == "South Africa" | ///
> loc_grand_name == "South Sudan" | ///
> loc_grand_name == "Tanzania" | ///
> loc_grand_name == "The Gambia" | ///
> loc_grand_name == "Togo" | ///
> loc_grand_name == "Uganda" | ///
> loc_grand_name == "Zambia" | ///
> loc_grand_name == "Zimbabwe" 
{txt}(14,039 observations deleted)

{com}. 
. drop loc_grand_name
{txt}
{com}. 
. collapse (sum) TotDeaMeRaA05S00-DayDMuMeRaA05S00, by(date)
{txt}
{com}. 
. foreach var of varlist DayDeaMeRaA05S00 DayDeaLoRaA05S00 DayDeaUpRaA05S00 ///
> DayCasMeRaA05S00 DayCasLoRaA05S00 DayCasUpRaA05S00 {c -(}
{txt}  2{com}.         replace `var' = . if `var' == 0
{txt}  3{com}. {c )-}
{txt}(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)

{com}. *
.  
. label var TotDeaMeRaA05S00 "Total Deaths Mean SRIV"
{txt}
{com}. label var TotDeaLoRaA05S00 "Total Deaths Lower SRIV"
{txt}
{com}. label var TotDeaUpRaA05S00 "Total Deaths Upper SRIV"
{txt}
{com}. label var TotCasMeRaA05S00 "Total Cases Mean SRIV"
{txt}
{com}. label var TotCasLoRaA05S00 "Total Cases Lower SRIV"
{txt}
{com}. label var TotCasUpRaA05S00 "Total Cases Upper SRIV" 
{txt}
{com}. 
. label var DayDeaMeRaA05S00 "Daily Deaths Mean SRIV"
{txt}
{com}. label var DayDeaLoRaA05S00 "Daily Deaths Lower SRIV"
{txt}
{com}. label var DayDeaUpRaA05S00 "Daily Deaths Upper SRIV"
{txt}
{com}. label var DayCasMeRaA05S00 "Daily Cases Mean SRIV"
{txt}
{com}. label var DayCasLoRaA05S00 "Daily Cases Lower SRIV"
{txt}
{com}. label var DayCasUpRaA05S00 "Daily Cases Upper SRIV" 
{txt}
{com}. 
. label var DayDeMMeRaA05S00 "Daily deaths mean SRIV  DayDeM"
{txt}
{com}. label var DayCaMMeRaA05S00 "Daily cases mean SRIV  DayCaM"
{txt}
{com}. label var DayCbDMeRaA05S00 "Daily cases mean div by daily deaths mean SRIV  DayCbD"
{txt}
{com}. label var DayDMuMeRaA05S00 "Daily deaths scaled (times means of cases by deaths) SRIV"
{txt}
{com}. 
. gen loc_grand_name = "AFRO"
{txt}
{com}. 
. order loc_grand_name date
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "SRIV AFRO.dta", replace 
{txt}file SRIV AFRO.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *****************************
. 
. * gen AMRO
. 
. use "SRIV.dta", clear
{txt}
{com}. 
. keep if ///
> loc_grand_name == "Antigua and Barbuda" | ///
> loc_grand_name == "Argentina" | ///
> loc_grand_name == "Barbados" | ///
> loc_grand_name == "Belize" | ///
> loc_grand_name == "Bolivia" | ///
> loc_grand_name == "Brazil" | ///
> loc_grand_name == "Canada" | ///
> loc_grand_name == "Chile" | ///
> loc_grand_name == "Colombia" | ///
> loc_grand_name == "Costa Rica" | ///
> loc_grand_name == "Cuba" | ///
> loc_grand_name == "Diamond Princess" | ///
> loc_grand_name == "Dominica" | ///
> loc_grand_name == "Dominican Republic" | ///
> loc_grand_name == "Ecuador" | ///
> loc_grand_name == "El Salvador" | ///
> loc_grand_name == "Grenada" | ///
> loc_grand_name == "Guatemala" | ///
> loc_grand_name == "Guyana" | ///
> loc_grand_name == "Haiti" | ///
> loc_grand_name == "Honduras" | ///
> loc_grand_name == "Jamaica" | ///
> loc_grand_name == "MS Zaandam" | ///
> loc_grand_name == "Mexico" | ///
> loc_grand_name == "Nicaragua" | ///
> loc_grand_name == "Panama" | ///
> loc_grand_name == "Paraguay" | ///
> loc_grand_name == "Peru" | ///
> loc_grand_name == "Saint Kitts and Nevis" | ///
> loc_grand_name == "Saint Lucia" | ///
> loc_grand_name == "Saint Vincent and the Grenadines" | ///
> loc_grand_name == "Suriname" | ///
> loc_grand_name == "The Bahamas" | ///
> loc_grand_name == "Trinidad and Tobago" | ///
> loc_grand_name == "United States" | ///
> loc_grand_name == "Uruguay" | ///
> loc_grand_name == "Venezuela" 
{txt}(14,847 observations deleted)

{com}. 
. drop loc_grand_name
{txt}
{com}. 
. collapse (sum) TotDeaMeRaA05S00-DayDMuMeRaA05S00, by(date)
{txt}
{com}. 
. foreach var of varlist DayDeaMeRaA05S00 DayDeaLoRaA05S00 DayDeaUpRaA05S00 ///
> DayCasMeRaA05S00 DayCasLoRaA05S00 DayCasUpRaA05S00 {c -(}
{txt}  2{com}.         replace `var' = . if `var' == 0
{txt}  3{com}. {c )-}
{txt}(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)

{com}. *
.  
. label var TotDeaMeRaA05S00 "Total Deaths Mean SRIV"
{txt}
{com}. label var TotDeaLoRaA05S00 "Total Deaths Lower SRIV"
{txt}
{com}. label var TotDeaUpRaA05S00 "Total Deaths Upper SRIV"
{txt}
{com}. label var TotCasMeRaA05S00 "Total Cases Mean SRIV"
{txt}
{com}. label var TotCasLoRaA05S00 "Total Cases Lower SRIV"
{txt}
{com}. label var TotCasUpRaA05S00 "Total Cases Upper SRIV" 
{txt}
{com}. 
. label var DayDeaMeRaA05S00 "Daily Deaths Mean SRIV"
{txt}
{com}. label var DayDeaLoRaA05S00 "Daily Deaths Lower SRIV"
{txt}
{com}. label var DayDeaUpRaA05S00 "Daily Deaths Upper SRIV"
{txt}
{com}. label var DayCasMeRaA05S00 "Daily Cases Mean SRIV"
{txt}
{com}. label var DayCasLoRaA05S00 "Daily Cases Lower SRIV"
{txt}
{com}. label var DayCasUpRaA05S00 "Daily Cases Upper SRIV" 
{txt}
{com}. 
. label var DayDeMMeRaA05S00 "Daily deaths mean SRIV  DayDeM"
{txt}
{com}. label var DayCaMMeRaA05S00 "Daily cases mean SRIV  DayCaM"
{txt}
{com}. label var DayCbDMeRaA05S00 "Daily cases mean div by daily deaths mean SRIV  DayCbD"
{txt}
{com}. label var DayDMuMeRaA05S00 "Daily deaths scaled (times means of cases by deaths) SRIV"
{txt}
{com}. 
. gen loc_grand_name = "AMRO"
{txt}
{com}. 
. order loc_grand_name date
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "SRIV AMRO.dta", replace 
{txt}file SRIV AMRO.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *****************************
. 
. * gen EMRO
. 
. use "SRIV.dta", clear
{txt}
{com}. 
. keep if ///
> loc_grand_name == "Afghanistan" | ///
> loc_grand_name == "Bahrain" | ///
> loc_grand_name == "Djibouti" | ///
> loc_grand_name == "Egypt" | ///
> loc_grand_name == "Iran" | ///
> loc_grand_name == "Iraq" | ///
> loc_grand_name == "Jordan" | ///
> loc_grand_name == "Kuwait" | ///
> loc_grand_name == "Lebanon" | ///
> loc_grand_name == "Libya" | ///
> loc_grand_name == "Morocco" | ///
> loc_grand_name == "Oman" | ///
> loc_grand_name == "Pakistan" | ///
> loc_grand_name == "Qatar" | ///
> loc_grand_name == "Saudi Arabia" | ///
> loc_grand_name == "Somalia" | ///
> loc_grand_name == "Sudan" | ///
> loc_grand_name == "Syria" | ///
> loc_grand_name == "Tunisia" | ///
> loc_grand_name == "United Arab Emirates" | ///
> loc_grand_name == "West Bank and Gaza" | ///
> loc_grand_name == "Western Sahara" | ///
> loc_grand_name == "Yemen" 
{txt}(16,261 observations deleted)

{com}. 
. 
. drop loc_grand_name
{txt}
{com}. 
. collapse (sum) TotDeaMeRaA05S00-DayDMuMeRaA05S00, by(date)
{txt}
{com}. 
. foreach var of varlist DayDeaMeRaA05S00 DayDeaLoRaA05S00 DayDeaUpRaA05S00 ///
> DayCasMeRaA05S00 DayCasLoRaA05S00 DayCasUpRaA05S00 {c -(}
{txt}  2{com}.         replace `var' = . if `var' == 0
{txt}  3{com}. {c )-}
{txt}(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)

{com}. *
.  
. label var TotDeaMeRaA05S00 "Total Deaths Mean SRIV"
{txt}
{com}. label var TotDeaLoRaA05S00 "Total Deaths Lower SRIV"
{txt}
{com}. label var TotDeaUpRaA05S00 "Total Deaths Upper SRIV"
{txt}
{com}. label var TotCasMeRaA05S00 "Total Cases Mean SRIV"
{txt}
{com}. label var TotCasLoRaA05S00 "Total Cases Lower SRIV"
{txt}
{com}. label var TotCasUpRaA05S00 "Total Cases Upper SRIV" 
{txt}
{com}. 
. label var DayDeaMeRaA05S00 "Daily Deaths Mean SRIV"
{txt}
{com}. label var DayDeaLoRaA05S00 "Daily Deaths Lower SRIV"
{txt}
{com}. label var DayDeaUpRaA05S00 "Daily Deaths Upper SRIV"
{txt}
{com}. label var DayCasMeRaA05S00 "Daily Cases Mean SRIV"
{txt}
{com}. label var DayCasLoRaA05S00 "Daily Cases Lower SRIV"
{txt}
{com}. label var DayCasUpRaA05S00 "Daily Cases Upper SRIV" 
{txt}
{com}. 
. label var DayDeMMeRaA05S00 "Daily deaths mean SRIV  DayDeM"
{txt}
{com}. label var DayCaMMeRaA05S00 "Daily cases mean SRIV  DayCaM"
{txt}
{com}. label var DayCbDMeRaA05S00 "Daily cases mean div by daily deaths mean SRIV  DayCbD"
{txt}
{com}. label var DayDMuMeRaA05S00 "Daily deaths scaled (times means of cases by deaths) SRIV"
{txt}
{com}. 
. gen loc_grand_name = "EMRO"
{txt}
{com}. 
. order loc_grand_name date
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "SRIV EMRO.dta", replace 
{txt}file SRIV EMRO.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *****************************
. 
. * gen EURO
. 
. use "SRIV.dta", clear
{txt}
{com}. 
. keep if ///
> loc_grand_name == "Albania" | ///
> loc_grand_name == "Andorra" | ///
> loc_grand_name == "Armenia" | ///
> loc_grand_name == "Austria" | ///
> loc_grand_name == "Azerbaijan" | ///
> loc_grand_name == "Belarus" | ///
> loc_grand_name == "Belgium" | ///
> loc_grand_name == "Bosnia and Herzegovina" | ///
> loc_grand_name == "Bulgaria" | ///
> loc_grand_name == "Croatia" | ///
> loc_grand_name == "Cyprus" | ///
> loc_grand_name == "Czech Republic" | ///
> loc_grand_name == "Denmark" | ///
> loc_grand_name == "Estonia" | ///
> loc_grand_name == "Finland" | ///
> loc_grand_name == "France" | ///
> loc_grand_name == "Georgia" | ///
> loc_grand_name == "Germany" | ///
> loc_grand_name == "Greece" | ///
> loc_grand_name == "Holy See" | ///
> loc_grand_name == "Hungary" | ///
> loc_grand_name == "Iceland" | ///
> loc_grand_name == "Ireland" | ///
> loc_grand_name == "Israel" | ///
> loc_grand_name == "Italy" | ///
> loc_grand_name == "Kazakhstan" | ///
> loc_grand_name == "Kosovo" | ///
> loc_grand_name == "Kyrgyzstan" | ///
> loc_grand_name == "Latvia" | ///
> loc_grand_name == "Liechtenstein" | ///
> loc_grand_name == "Lithuania" | ///
> loc_grand_name == "Luxembourg" | ///
> loc_grand_name == "Macedonia" | ///
> loc_grand_name == "Malta" | ///
> loc_grand_name == "Moldova" | ///
> loc_grand_name == "Monaco" | ///
> loc_grand_name == "Montenegro" | ///
> loc_grand_name == "Netherlands" | ///
> loc_grand_name == "Norway" | ///
> loc_grand_name == "Poland" | ///
> loc_grand_name == "Portugal" | ///
> loc_grand_name == "Romania" | ///
> loc_grand_name == "Russian Federation" | ///
> loc_grand_name == "San Marino" | ///
> loc_grand_name == "Serbia" | ///
> loc_grand_name == "Slovakia" | ///
> loc_grand_name == "Slovenia" | ///
> loc_grand_name == "Spain" | ///
> loc_grand_name == "Sweden" | ///
> loc_grand_name == "Switzerland" | ///
> loc_grand_name == "Turkey" | ///
> loc_grand_name == "Ukraine" | ///
> loc_grand_name == "United Kingdom" | ///
> loc_grand_name == "Uzbekistan" 
{txt}(13,130 observations deleted)

{com}. 
. 
. drop loc_grand_name
{txt}
{com}. 
. collapse (sum) TotDeaMeRaA05S00-DayDMuMeRaA05S00, by(date)
{txt}
{com}. 
. foreach var of varlist DayDeaMeRaA05S00 DayDeaLoRaA05S00 DayDeaUpRaA05S00 ///
> DayCasMeRaA05S00 DayCasLoRaA05S00 DayCasUpRaA05S00 {c -(}
{txt}  2{com}.         replace `var' = . if `var' == 0
{txt}  3{com}. {c )-}
{txt}(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)

{com}. *
.  
. label var TotDeaMeRaA05S00 "Total Deaths Mean SRIV"
{txt}
{com}. label var TotDeaLoRaA05S00 "Total Deaths Lower SRIV"
{txt}
{com}. label var TotDeaUpRaA05S00 "Total Deaths Upper SRIV"
{txt}
{com}. label var TotCasMeRaA05S00 "Total Cases Mean SRIV"
{txt}
{com}. label var TotCasLoRaA05S00 "Total Cases Lower SRIV"
{txt}
{com}. label var TotCasUpRaA05S00 "Total Cases Upper SRIV" 
{txt}
{com}. 
. label var DayDeaMeRaA05S00 "Daily Deaths Mean SRIV"
{txt}
{com}. label var DayDeaLoRaA05S00 "Daily Deaths Lower SRIV"
{txt}
{com}. label var DayDeaUpRaA05S00 "Daily Deaths Upper SRIV"
{txt}
{com}. label var DayCasMeRaA05S00 "Daily Cases Mean SRIV"
{txt}
{com}. label var DayCasLoRaA05S00 "Daily Cases Lower SRIV"
{txt}
{com}. label var DayCasUpRaA05S00 "Daily Cases Upper SRIV" 
{txt}
{com}. 
. label var DayDeMMeRaA05S00 "Daily deaths mean SRIV  DayDeM"
{txt}
{com}. label var DayCaMMeRaA05S00 "Daily cases mean SRIV  DayCaM"
{txt}
{com}. label var DayCbDMeRaA05S00 "Daily cases mean div by daily deaths mean SRIV  DayCbD"
{txt}
{com}. label var DayDMuMeRaA05S00 "Daily deaths scaled (times means of cases by deaths) SRIV"
{txt}
{com}. 
. gen loc_grand_name = "EURO"
{txt}
{com}. 
. order loc_grand_name date
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "SRIV EURO.dta", replace 
{txt}file SRIV EURO.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. *****************************
. 
. * gen SEARO
. 
. use "SRIV.dta", clear
{txt}
{com}. 
. keep if ///
> loc_grand_name == "Bangladesh" | ///
> loc_grand_name == "Bhutan" | ///
> loc_grand_name == "India" | ///
> loc_grand_name == "Indonesia" | ///
> loc_grand_name == "Maldives" | ///
> loc_grand_name == "Myanmar" | ///
> loc_grand_name == "Nepal" | ///
> loc_grand_name == "Sri Lanka" | ///
> loc_grand_name == "Thailand" | ///
> loc_grand_name == "Timor-Leste" 
{txt}(17,574 observations deleted)

{com}. 
. 
. drop loc_grand_name
{txt}
{com}. 
. collapse (sum) TotDeaMeRaA05S00-DayDMuMeRaA05S00, by(date)
{txt}
{com}. 
. foreach var of varlist DayDeaMeRaA05S00 DayDeaLoRaA05S00 DayDeaUpRaA05S00 ///
> DayCasMeRaA05S00 DayCasLoRaA05S00 DayCasUpRaA05S00 {c -(}
{txt}  2{com}.         replace `var' = . if `var' == 0
{txt}  3{com}. {c )-}
{txt}(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)

{com}. *
.  
. label var TotDeaMeRaA05S00 "Total Deaths Mean SRIV"
{txt}
{com}. label var TotDeaLoRaA05S00 "Total Deaths Lower SRIV"
{txt}
{com}. label var TotDeaUpRaA05S00 "Total Deaths Upper SRIV"
{txt}
{com}. label var TotCasMeRaA05S00 "Total Cases Mean SRIV"
{txt}
{com}. label var TotCasLoRaA05S00 "Total Cases Lower SRIV"
{txt}
{com}. label var TotCasUpRaA05S00 "Total Cases Upper SRIV" 
{txt}
{com}. 
. label var DayDeaMeRaA05S00 "Daily Deaths Mean SRIV"
{txt}
{com}. label var DayDeaLoRaA05S00 "Daily Deaths Lower SRIV"
{txt}
{com}. label var DayDeaUpRaA05S00 "Daily Deaths Upper SRIV"
{txt}
{com}. label var DayCasMeRaA05S00 "Daily Cases Mean SRIV"
{txt}
{com}. label var DayCasLoRaA05S00 "Daily Cases Lower SRIV"
{txt}
{com}. label var DayCasUpRaA05S00 "Daily Cases Upper SRIV" 
{txt}
{com}. 
. label var DayDeMMeRaA05S00 "Daily deaths mean SRIV  DayDeM"
{txt}
{com}. label var DayCaMMeRaA05S00 "Daily cases mean SRIV  DayCaM"
{txt}
{com}. label var DayCbDMeRaA05S00 "Daily cases mean div by daily deaths mean SRIV  DayCbD"
{txt}
{com}. label var DayDMuMeRaA05S00 "Daily deaths scaled (times means of cases by deaths) SRIV"
{txt}
{com}. 
. gen loc_grand_name = "SEARO"
{txt}
{com}. 
. order loc_grand_name date
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "SRIV SEARO.dta", replace 
{txt}file SRIV SEARO.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. *****************************
. 
. * gen WPRO
. 
. use "SRIV.dta", clear
{txt}
{com}. 
. keep if ///
> loc_grand_name == "Australia" | ///
> loc_grand_name == "Brunei" | ///
> loc_grand_name == "Cambodia" | ///
> loc_grand_name == "China" | ///
> loc_grand_name == "Fiji" | ///
> loc_grand_name == "Japan" | ///
> loc_grand_name == "Laos" | ///
> loc_grand_name == "Malaysia" | ///
> loc_grand_name == "Mongolia" | ///
> loc_grand_name == "New Zealand" | ///
> loc_grand_name == "Papua New Guinea" | ///
> loc_grand_name == "Philippines" | ///
> loc_grand_name == "Singapore" | ///
> loc_grand_name == "South Korea" | ///
> loc_grand_name == "Vietnam" 
{txt}(17,069 observations deleted)

{com}. 
. 
. drop loc_grand_name
{txt}
{com}. 
. collapse (sum) TotDeaMeRaA05S00-DayDMuMeRaA05S00, by(date)
{txt}
{com}. 
. foreach var of varlist DayDeaMeRaA05S00 DayDeaLoRaA05S00 DayDeaUpRaA05S00 ///
> DayCasMeRaA05S00 DayCasLoRaA05S00 DayCasUpRaA05S00 {c -(}
{txt}  2{com}.         replace `var' = . if `var' == 0
{txt}  3{com}. {c )-}
{txt}(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)

{com}. *
.  
. label var TotDeaMeRaA05S00 "Total Deaths Mean SRIV"
{txt}
{com}. label var TotDeaLoRaA05S00 "Total Deaths Lower SRIV"
{txt}
{com}. label var TotDeaUpRaA05S00 "Total Deaths Upper SRIV"
{txt}
{com}. label var TotCasMeRaA05S00 "Total Cases Mean SRIV"
{txt}
{com}. label var TotCasLoRaA05S00 "Total Cases Lower SRIV"
{txt}
{com}. label var TotCasUpRaA05S00 "Total Cases Upper SRIV" 
{txt}
{com}. 
. label var DayDeaMeRaA05S00 "Daily Deaths Mean SRIV"
{txt}
{com}. label var DayDeaLoRaA05S00 "Daily Deaths Lower SRIV"
{txt}
{com}. label var DayDeaUpRaA05S00 "Daily Deaths Upper SRIV"
{txt}
{com}. label var DayCasMeRaA05S00 "Daily Cases Mean SRIV"
{txt}
{com}. label var DayCasLoRaA05S00 "Daily Cases Lower SRIV"
{txt}
{com}. label var DayCasUpRaA05S00 "Daily Cases Upper SRIV" 
{txt}
{com}. 
. label var DayDeMMeRaA05S00 "Daily deaths mean SRIV  DayDeM"
{txt}
{com}. label var DayCaMMeRaA05S00 "Daily cases mean SRIV  DayCaM"
{txt}
{com}. label var DayCbDMeRaA05S00 "Daily cases mean div by daily deaths mean SRIV  DayCbD"
{txt}
{com}. label var DayDMuMeRaA05S00 "Daily deaths scaled (times means of cases by deaths) SRIV"
{txt}
{com}. 
. gen loc_grand_name = "WPRO"
{txt}
{com}. 
. order loc_grand_name date
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "SRIV WPRO.dta", replace 
{txt}file SRIV WPRO.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. ******************
. 
. * append regions
. 
. use "SRIV GLOBAL.dta", clear 
{txt}
{com}. 
. local list4 AFRO AMRO EMRO EURO SEARO WPRO
{txt}
{com}. 
. foreach region of local list4 {c -(}
{txt}  2{com}. 
.         append using "SRIV `region'.dta"
{txt}  3{com}.         
. {c )-}
{txt}
{com}. *
. 
. 
. 
. 
. * gen vars by location 
. 
. foreach var of varlist TotDeaMeRaA05S00-DayDMuMeRaA05S00 {c -(}
{txt}  2{com}. 
. 
.         qui gen `var'AFRO = `var' 
{txt}  3{com}.         qui replace `var'AFRO = . if loc_grand_name != "AFRO"
{txt}  4{com}.         
.         qui gen `var'AMRO = `var'
{txt}  5{com}.         qui replace `var'AMRO = . if loc_grand_name != "AMRO"
{txt}  6{com}.         
.         qui gen `var'EMRO = `var'
{txt}  7{com}.         qui replace `var'EMRO = . if loc_grand_name != "EMRO"
{txt}  8{com}.         
.         qui gen `var'EURO = `var'
{txt}  9{com}.         qui replace `var'EURO = . if loc_grand_name != "EURO"
{txt} 10{com}.         
.         qui gen `var'GLOBAL = `var'
{txt} 11{com}.         qui replace `var'GLOBAL = . if loc_grand_name != " GLOBAL"
{txt} 12{com}.         
.         qui gen `var'SEARO = `var'
{txt} 13{com}.         qui replace `var'SEARO = . if loc_grand_name != "SEARO"
{txt} 14{com}.         
.         qui gen `var'WPRO = `var'
{txt} 15{com}.         qui replace `var'WPRO = . if loc_grand_name != "WPRO"
{txt} 16{com}.         
.         
.         label var `var'AFRO "`var' AFRO"
{txt} 17{com}.         label var `var'AMRO "`var' AMRO"
{txt} 18{com}.         label var `var'EMRO "`var' EMRO"
{txt} 19{com}.         label var `var'EURO "`var' EURO"
{txt} 20{com}.         label var `var'GLOBAL "`var' GLOBAL"
{txt} 21{com}.         label var `var'SEARO "`var' SEARO"
{txt} 22{com}.         label var `var'WPRO "`var' WPRO"
{txt} 23{com}. 
.                                 
. {c )-}
{txt}
{com}. *
. 
. 
. 
. 
. 
. 
. order loc_grand_name date
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "CovidVisualizedGlobal SRIV.dta", replace 
{txt}file CovidVisualizedGlobal SRIV.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. ***********************
. 
. * graphs
. 
. 
. grstyle init
{res}{txt}
{com}. 
. grstyle color background white
{txt}
{com}. 
. 
. 
. local list5 GLOBAL AFRO AMRO EMRO EURO SEARO WPRO
{txt}
{com}. 
. foreach region of local list5 {c -(}
{txt}  2{com}. 
.         
. 
.         * daily deaths 
.         
.         twoway ///
>         (line DayDeaMeRaA05S00`region' date, sort lcolor(black)) ///
>         , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
>         xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
>         ytitle(Daily deaths) title("COVID-19 daily deaths, `region', SRIV, default scenario", size(medium)) ///
>         xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) 
{txt}  3{com}.         
.         qui graph save "graph `region' 1 COVID-19 daily deaths, default scenario, `region', SRIV.gph", replace
{txt}  4{com}.         qui graph export "graph `region' 1 COVID-19 daily deaths, default scenario, `region', SRIV.pdf", replace
{txt}  5{com}.         
.         
.         
.         
.         * daily deaths CI
.         
.         twoway ///
>         (rarea DayDeaLoRaA05S00`region' DayDeaUpRaA05S00`region' date, sort color(black*.2)) ///
>         (line DayDeaMeRaA05S00`region' date, sort lcolor(black)) ///
>         , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
>         xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
>         ytitle(Daily deaths) title("COVID-19 daily deaths, `region', SRIV, default scenario", size(medium)) ///
>         xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) ///
>         subtitle("with confidence limits", size(small))
{txt}  6{com}.         
.         qui graph save "graph `region' 2 COVID-19 daily deaths, default scenario, `region', SRIV.gph", replace
{txt}  7{com}.         qui graph export "graph `region' 2 COVID-19 daily deaths, default scenario, `region', SRIV.pdf", replace
{txt}  8{com}.         
.         
.         
.         
.         * daily cases 
.         
.         twoway ///
>         (line DayCasMeRaA05S00`region' date, sort lcolor(black)) ///
>         , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
>         xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
>         ytitle(Daily cases) title("COVID-19 daily cases, `region', SRIV, default scenario", size(medium)) ///
>         xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) 
{txt}  9{com}.         
.         qui graph save "graph `region' 3 COVID-19 daily cases, default scenario, `region', SRIV.gph", replace
{txt} 10{com}.         qui graph export "graph `region' 3 COVID-19 daily cases, default scenario, `region', SRIV.pdf", replace
{txt} 11{com}.         
.         
.         
.         
.         * daily cases CI
.         
.         twoway ///
>         (rarea DayCasLoRaA05S00`region' DayCasUpRaA05S00`region' date, sort color(black*.2)) ///
>         (line DayCasMeRaA05S00`region' date, sort lcolor(black)) ///
>         , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
>         xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
>         ytitle(Daily cases) title("COVID-19 daily cases, `region', SRIV, default scenario", size(medium)) ///
>         xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) ///
>         subtitle("with confidence limits", size(small))
{txt} 12{com}.         
.         qui graph save "graph `region' 4 COVID-19 daily cases, default scenario, `region', SRIV.gph", replace
{txt} 13{com}.         qui graph export "graph `region' 4 COVID-19 daily cases, default scenario, `region', SRIV.pdf", replace
{txt} 14{com}.         
.         
.         
.         
.         * total deaths 
.         
.         twoway ///
>         (line TotDeaMeRaA05S00`region' date, sort lcolor(black)) ///
>         , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
>         xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
>         ytitle(Total deaths) title("COVID-19 total deaths, `region', SRIV, default scenario", size(medium)) ///
>         xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) 
{txt} 15{com}.         
.         qui graph save "graph `region' 5 COVID-19 total deaths, default scenario, `region', SRIV.gph", replace
{txt} 16{com}.         qui graph export "graph `region' 5 COVID-19 total deaths, default scenario, `region', SRIV.pdf", replace
{txt} 17{com}.         
.         
.         
.         
.         * total deaths CI
.         
.         twoway ///
>         (rarea TotDeaLoRaA05S00`region' TotDeaUpRaA05S00`region' date, sort color(black*.2)) ///
>         (line TotDeaMeRaA05S00`region' date, sort lcolor(black)) ///
>         , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
>         xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
>         ytitle(Total deaths) title("COVID-19 total deaths, `region', SRIV, default scenario", size(medium)) ///
>         xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) ///
>         subtitle("with confidence limits", size(small))
{txt} 18{com}.         
.         qui graph save "graph `region' 6 COVID-19 total deaths, default scenario, `region', SRIV.gph", replace
{txt} 19{com}.         qui graph export "graph `region' 6 COVID-19 total deaths, default scenario, `region', SRIV.pdf", replace
{txt} 20{com}.         
.         
.         
.         
.         * total cases 
.         
.         twoway ///
>         (line TotCasMeRaA05S00`region' date, sort lcolor(black)) ///
>         , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
>         xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
>         ytitle(Total cases) title("COVID-19 total cases, `region', SRIV, default scenario", size(medium)) ///
>         xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) 
{txt} 21{com}.         
.         qui graph save "graph `region' 7 COVID-19 total cases, default scenario, `region', SRIV.gph", replace
{txt} 22{com}.         qui graph export "graph `region' 7 COVID-19 total cases, default scenario, `region', SRIV.pdf", replace
{txt} 23{com}.         
.         
.         
.         
.         * total cases CI
.         
.         twoway ///
>         (rarea TotCasLoRaA05S00`region' TotCasUpRaA05S00`region' date, sort color(black*.2)) ///
>         (line TotCasMeRaA05S00`region' date, sort lcolor(black)) ///
>         , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
>         xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
>         ytitle(Total cases) title("COVID-19 total cases, `region', SRIV, default scenario", size(medium)) ///
>         xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) ///
>         subtitle("with confidence limits", size(small))
{txt} 24{com}.         
.         qui graph save "graph `region' 8 COVID-19 total cases, default scenario, `region', SRIV.gph", replace
{txt} 25{com}.         qui graph export "graph `region' 8 COVID-19 total cases, default scenario, `region', SRIV.pdf", replace
{txt} 26{com}. 
.         
.         
.         
.         * DayCas DayDeaDay Dea_multip
.         
.         twoway ///
>         (line DayCasMeRaA05S00`region' date, sort lcolor(blue)) ///
>         (line DayDeaMeRaA05S00`region' date, sort lcolor(red)) ///
>         (line DayDMuMeRaA05S00`region' date, sort lpattern(dot) lcolor(red)) ///
>         if date > td(01jan2020) ///
>         , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
>         xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
>         ytitle(Daily cases and deaths) title("COVID-19 daily cases and deaths, `region', SRIV ", size(medium)) ///
>         xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) yscale(titlegap(4)) legend(region(lcolor(none)))  ///
>         legend(order(1 "Daily cases" 2 "Daily deaths" 3 "Daily deaths scaled for visualization") size(small)) ///
>         subtitle("Daily deaths, scaled = times (means of cases divided by deaths) for visualization only", size(small)) ///
>         note("Current scenario, mean estimate")
{txt} 27{com}.         
.         qui graph save "graph `region' 11 COVID-19 daily deaths and cases `region', SRIV .gph", replace
{txt} 28{com}.         qui graph export "graph `region' 11 COVID-19 daily deaths and cases `region', SRIV .pdf", replace
{txt} 29{com}. 
. 
.  
. {c )-}
{res}{txt}
{com}. *
. 
. 
. 
. 
. 
. 
. *******************************
. 
. * regions together
. 
. 
. 
. 
. * daily deaths, with GLOBAL
. 
. twoway ///
> (line DayDeaMeRaA05S00AFRO date, sort lcolor(brown)) ///
> (line DayDeaMeRaA05S00AMRO date, sort lcolor(red)) ///
> (line DayDeaMeRaA05S00EMRO date, sort lcolor(gold)) ///
> (line DayDeaMeRaA05S00EURO date, sort lcolor(green)) ///
> (line DayDeaMeRaA05S00SEARO date, sort lcolor(cyan)) ///
> (line DayDeaMeRaA05S00WPRO date, sort lcolor(blue)) ///
> (line DayDeaMeRaA05S00GLOBAL date, sort lcolor(black) lwidth(thick)) ///
> , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(forty_five)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, WHO regions, SRIV", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "AFRO" 2 "AMRO" 3 "EMRO" 4 "EURO" 5 "SEARO" 6 "WPRO" 7 "GLOBAL") size(small) rows (2)) ///
> subtitle("with GLOBAL", size(small))
{res}{txt}
{com}. 
. qui graph save "graph 1a COVID-19 daily deaths, regions together, SRIV.gph", replace
{txt}
{com}. qui graph export "graph 1a COVID-19 daily deaths, regions together, SRIV.pdf", replace
{txt}
{com}. 
. 
. 
. 
. * daily deaths, without GLOBAL
. 
. twoway ///
> (line DayDeaMeRaA05S00AFRO date, sort lcolor(brown)) ///
> (line DayDeaMeRaA05S00AMRO date, sort lcolor(red)) ///
> (line DayDeaMeRaA05S00EMRO date, sort lcolor(gold)) ///
> (line DayDeaMeRaA05S00EURO date, sort lcolor(green)) ///
> (line DayDeaMeRaA05S00SEARO date, sort lcolor(cyan)) ///
> (line DayDeaMeRaA05S00WPRO date, sort lcolor(blue)) ///
> , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(forty_five)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, WHO regions, SRIV", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "AFRO" 2 "AMRO" 3 "EMRO" 4 "EURO" 5 "SEARO" 6 "WPRO") size(small) rows (2)) ///
> subtitle("without GLOBAL", size(small))
{res}{txt}
{com}. 
. qui graph save "graph 1b COVID-19 daily deaths, regions together wo global, SRIV.gph", replace
{txt}
{com}. qui graph export "graph 1b COVID-19 daily deaths, regions together wo global, SRIV.pdf", replace
{txt}
{com}. 
. 
. 
. 
. * daily cases, with GLOBAL
. 
. twoway ///
> (line DayCasMeRaA05S00AFRO date, sort lcolor(brown)) ///
> (line DayCasMeRaA05S00AMRO date, sort lcolor(red)) ///
> (line DayCasMeRaA05S00EMRO date, sort lcolor(gold)) ///
> (line DayCasMeRaA05S00EURO date, sort lcolor(green)) ///
> (line DayCasMeRaA05S00SEARO date, sort lcolor(cyan)) ///
> (line DayCasMeRaA05S00WPRO date, sort lcolor(blue)) ///
> (line DayCasMeRaA05S00GLOBAL date, sort lcolor(black) lwidth(thick)) ///
> , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(forty_five)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, WHO regions, SRIV", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "AFRO" 2 "AMRO" 3 "EMRO" 4 "EURO" 5 "SEARO" 6 "WPRO" 7 "GLOBAL") size(small) rows (2)) ///
> subtitle("with GLOBAL", size(small))
{res}{txt}
{com}. 
. qui graph save "graph 2a COVID-19 daily cases, regions together, SRIV.gph", replace
{txt}
{com}. qui graph export "graph 2a COVID-19 daily cases, regions together, SRIV.pdf", replace
{txt}
{com}. 
. 
. 
. 
. * daily cases, without GLOBAL
. 
. twoway ///
> (line DayCasMeRaA05S00AFRO date, sort lcolor(brown)) ///
> (line DayCasMeRaA05S00AMRO date, sort lcolor(red)) ///
> (line DayCasMeRaA05S00EMRO date, sort lcolor(gold)) ///
> (line DayCasMeRaA05S00EURO date, sort lcolor(green)) ///
> (line DayCasMeRaA05S00SEARO date, sort lcolor(cyan)) ///
> (line DayCasMeRaA05S00WPRO date, sort lcolor(blue)) ///
> , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(forty_five)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, WHO regions, SRIV", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "AFRO" 2 "AMRO" 3 "EMRO" 4 "EURO" 5 "SEARO" 6 "WPRO") size(small) rows (2)) ///
> subtitle("without GLOBAL", size(small))
{res}{txt}
{com}. 
. qui graph save "graph 2b COVID-19 daily cases, regions together wo global, SRIV.gph", replace
{txt}
{com}. qui graph export "graph 2b COVID-19 daily cases, regions together wo global, SRIV.pdf", replace
{txt}
{com}. 
. 
. 
. 
. 
. * total deaths, with GLOBAL
. 
. twoway ///
> (line TotDeaMeRaA05S00AFRO date, sort lcolor(brown)) ///
> (line TotDeaMeRaA05S00AMRO date, sort lcolor(red)) ///
> (line TotDeaMeRaA05S00EMRO date, sort lcolor(gold)) ///
> (line TotDeaMeRaA05S00EURO date, sort lcolor(green)) ///
> (line TotDeaMeRaA05S00SEARO date, sort lcolor(cyan)) ///
> (line TotDeaMeRaA05S00WPRO date, sort lcolor(blue)) ///
> (line TotDeaMeRaA05S00GLOBAL date, sort lcolor(black) lwidth(thick)) ///
> , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(forty_five)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, WHO regions, SRIV", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "AFRO" 2 "AMRO" 3 "EMRO" 4 "EURO" 5 "SEARO" 6 "WPRO" 7 "GLOBAL") size(small) rows (2)) ///
> subtitle("with GLOBAL", size(small))
{res}{txt}
{com}. 
. qui graph save "graph 3a COVID-19 total deaths, regions together, SRIV.gph", replace
{txt}
{com}. qui graph export "graph 3a COVID-19 total deaths, regions together, SRIV.pdf", replace
{txt}
{com}. 
. 
. 
. * total deaths, without GLOBAL
. 
. twoway ///
> (line TotDeaMeRaA05S00AFRO date, sort lcolor(brown)) ///
> (line TotDeaMeRaA05S00AMRO date, sort lcolor(red)) ///
> (line TotDeaMeRaA05S00EMRO date, sort lcolor(gold)) ///
> (line TotDeaMeRaA05S00EURO date, sort lcolor(green)) ///
> (line TotDeaMeRaA05S00SEARO date, sort lcolor(cyan)) ///
> (line TotDeaMeRaA05S00WPRO date, sort lcolor(blue)) ///
> , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(forty_five)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, WHO regions, SRIV", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "AFRO" 2 "AMRO" 3 "EMRO" 4 "EURO" 5 "SEARO" 6 "WPRO") size(small) rows (2)) ///
> subtitle("without GLOBAL", size(small))
{res}{txt}
{com}. 
. qui graph save "graph 3b COVID-19 total deaths, regions together wo global, SRIV.gph", replace
{txt}
{com}. qui graph export "graph 3b COVID-19 total deaths, regions together wo global, SRIV.pdf", replace
{txt}
{com}. 
. 
. 
. 
. 
. * total cases, with GLOBAL
. 
. twoway ///
> (line TotCasMeRaA05S00AFRO date, sort lcolor(brown)) ///
> (line TotCasMeRaA05S00AMRO date, sort lcolor(red)) ///
> (line TotCasMeRaA05S00EMRO date, sort lcolor(gold)) ///
> (line TotCasMeRaA05S00EURO date, sort lcolor(green)) ///
> (line TotCasMeRaA05S00SEARO date, sort lcolor(cyan)) ///
> (line TotCasMeRaA05S00WPRO date, sort lcolor(blue)) ///
> (line TotCasMeRaA05S00GLOBAL date, sort lcolor(black) lwidth(thick)) ///
> , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(forty_five)) ///
> ytitle(Total cases) title("COVID-19 total cases, WHO regions, SRIV", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "AFRO" 2 "AMRO" 3 "EMRO" 4 "EURO" 5 "SEARO" 6 "WPRO" 7 "GLOBAL") size(small) rows (2)) ///
> subtitle("with GLOBAL", size(small))
{res}{txt}
{com}. 
. qui graph save "graph 4a COVID-19 total cases, regions together, SRIV.gph", replace
{txt}
{com}. qui graph export "graph 4a COVID-19 total cases, regions together, SRIV.pdf", replace
{txt}
{com}. 
. 
. 
. * total cases, without GLOBAL
. 
. twoway ///
> (line TotCasMeRaA05S00AFRO date, sort lcolor(brown)) ///
> (line TotCasMeRaA05S00AMRO date, sort lcolor(red)) ///
> (line TotCasMeRaA05S00EMRO date, sort lcolor(gold)) ///
> (line TotCasMeRaA05S00EURO date, sort lcolor(green)) ///
> (line TotCasMeRaA05S00SEARO date, sort lcolor(cyan)) ///
> (line TotCasMeRaA05S00WPRO date, sort lcolor(blue)) ///
> , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(forty_five)) ///
> ytitle(Total cases) title("COVID-19 total cases, WHO regions, SRIV", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "AFRO" 2 "AMRO" 3 "EMRO" 4 "EURO" 5 "SEARO" 6 "WPRO") size(small) rows (2)) ///
> subtitle("without GLOBAL", size(small))
{res}{txt}
{com}. 
. qui graph save "graph 4b COVID-19 total cases, regions together wo global, SRIV.gph", replace
{txt}
{com}. qui graph export "graph 4b COVID-19 total cases, regions together wo global, SRIV.pdf", replace
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. view "log CovidVisualizedGlobal SRIV 1.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211210/code/SRIV/log CovidVisualizedGlobal SRIV 1.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}13 Dec 2021, 08:40:26
{txt}{.-}
{smcl}
{txt}{sf}{ul off}