{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/log CovidVisualizedGlobal merge.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}22 Oct 2021, 11:10:02
{txt}
{com}. 
. 
. ***************************************************************************
. * This is "do CovidVisualizedGlobal merge.do"
. 
. * Project: Combine and visualize international periodically updating 
. * estimates of COVID-19 at the global level (CovidVisualizedGlobal)
. * Person: Farshad Pourmalek pourmalek_farshad at yahoo dot com
. * Time (initial): 2021-04-14
. ***************************************************************************
. 
. 
. 
. 
. /* studies / models:
> JOHN
> DELP 
> IHME
> IMPE
> LANL // The LANL COVID-19 Team made its last real-time forecast on September 27th, 2021. [for 20210926]. This is more than two weeks old and will not be used. 
> SRIV
> */
. 
. 
. 
. 
. * JOHN
. 
. if regexm(c(os),"Mac") == 1 {c -(}
. 
.         use "$pathCovidVisualizedGlobal/JOHN/CovidVisualizedGlobal JOHN.dta", clear 
. {c )-}
{txt}
{com}. else if regexm(c(os),"Windows") == 1 use "$pathCovidVisualizedGlobal\JOHN\CovidVisualizedGlobal JOHN.dta", clear 
{txt}
{com}. 
. 
. 
. * DELP 
. 
. if regexm(c(os),"Mac") == 1 {c -(}
. 
.         merge 1:1 date using "$pathCovidVisualizedGlobal/DELP/CovidVisualizedGlobal DELP.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             616
{txt}{col 9}from master{col 30}{res}             561{txt}  (_merge==1)
{col 9}from using{col 30}{res}              55{txt}  (_merge==2)

{col 5}matched{col 30}{res}              99{txt}  (_merge==3)
{col 5}{hline 41}
{com}. {c )-}
{txt}
{com}. else if regexm(c(os),"Windows") == 1 merge 1:1 date using "$pathCovidVisualizedGlobal\DELP\CovidVisualizedGlobal DELP.dta"
{txt}
{com}. 
. drop _merge
{txt}
{com}. 
. 
. 
. * IHME
. 
. if regexm(c(os),"Mac") == 1 {c -(}
. 
.         merge 1:1 date using "$pathCovidVisualizedGlobal/IHME/CovidVisualizedGlobal IHME.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              82
{txt}{col 9}from master{col 30}{res}              34{txt}  (_merge==1)
{col 9}from using{col 30}{res}              48{txt}  (_merge==2)

{col 5}matched{col 30}{res}             681{txt}  (_merge==3)
{col 5}{hline 41}
{com}. {c )-}
{txt}
{com}. else if regexm(c(os),"Windows") == 1 merge 1:1 date using "$pathCovidVisualizedGlobal\IHME\CovidVisualizedGlobal IHME.dta"
{txt}
{com}. 
. drop _merge
{txt}
{com}. 
. 
. 
. * IMPE
. 
. if regexm(c(os),"Mac") == 1 {c -(}
. 
.         merge 1:1 date using "$pathCovidVisualizedGlobal/IMPE/CovidVisualizedGlobal IMPE.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              62
{txt}{col 9}from master{col 30}{res}              29{txt}  (_merge==1)
{col 9}from using{col 30}{res}              33{txt}  (_merge==2)

{col 5}matched{col 30}{res}             734{txt}  (_merge==3)
{col 5}{hline 41}
{com}. {c )-}
{txt}
{com}. else if regexm(c(os),"Windows") == 1 merge 1:1 date using "$pathCovidVisualizedGlobal\IMPE\CovidVisualizedGlobal IMPE.dta"
{txt}
{com}. 
. drop _merge
{txt}
{com}. 
. 
. 
. /* LANL
> 
> if regexm(c(os),"Mac") == 1 {c -(}
> 
>         merge 1:1 date using "$pathCovidVisualizedGlobal/LANL/CovidVisualizedGlobal LANL.dta"
> {c )-}
> else if regexm(c(os),"Windows") == 1 merge 1:1 date using "$pathCovidVisualizedGlobal\LANL\CovidVisualizedGlobal LANL.dta"
> 
> drop _merge */
. 
. 
. * SRIV
. 
. 
. 
. if regexm(c(os),"Mac") == 1 {c -(}
. 
.         merge 1:1 date using "$pathCovidVisualizedGlobal/SRIV/CovidVisualizedGlobal SRIV.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             695
{txt}{col 9}from master{col 30}{res}             695{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}             101{txt}  (_merge==3)
{col 5}{hline 41}
{com}. {c )-}
{txt}
{com}. else if regexm(c(os),"Windows") == 1 merge 1:1 date using "$pathCovidVisualizedGlobal\SRIV\CovidVisualizedGlobal SRIV.dta"
{txt}
{com}. 
. drop _merge
{txt}
{com}. 
. 
. 
. * 
. 
. label var loc_grand_name "Location"
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. *************************************
. 
. 
. * Cases or infections to deaths ratio
. 
. 
. gen DayCTDMeRaA00S00 =  DayCasMeRaA00S00 / DayDeaMeRaA00S00
{txt}(136 missing values generated)

{com}. 
. label var DayCTDMeRaA00S00  "Daily Cases to Deaths S0 JOHN"
{txt}
{com}. 
. gen TotCTDMeRaA00S00 =  TotCasMeRaA00S00 / TotDeaMeRaA00S00
{txt}(136 missing values generated)

{com}. 
. label var TotCTDMeRaA00S00  "Total Cases to Deaths S0 JOHN"
{txt}
{com}. 
. 
. 
. 
. gen DayCTDMeRaA01S00 =  DayCasMeRaA01S00 / DayDeaMeRaA01S00
{txt}(643 missing values generated)

{com}. 
. label var DayCTDMeRaA01S00  "Daily Cases to Deaths S0 DELP"
{txt}
{com}. 
. gen TotCTDMeRaA01S00 =  TotCasMeRaA01S00 / TotDeaMeRaA01S00
{txt}(642 missing values generated)

{com}. 
. label var TotCTDMeRaA01S00  "Total Cases to Deaths S0 DELP"  
{txt}
{com}. 
. 
. 
. 
. gen DayITDMeSmA02S01  =  DayINFMeSmA02S01  / DayDeaMeSmA02S01 
{txt}(67 missing values generated)

{com}. 
. label var DayITDMeSmA02S01   "Daily infections to Deaths S1 IHME"
{txt}
{com}. 
. gen TotITDMeSmA02S01  =  TotINFMeSmA02S01  / TotDeaMeSmA02S01 
{txt}(67 missing values generated)

{com}. 
. label var TotITDMeSmA02S01   "Total infections to Deaths S1 IHME"
{txt}
{com}. 
. 
. 
. 
. gen DayITDMeSmA02S02 = DayINFMeSmA02S02 / DayDeaMeSmA02S02  
{txt}(67 missing values generated)

{com}. 
. label var DayITDMeSmA02S02 "Daily infections to Deaths S2 IHME"
{txt}
{com}. 
. gen TotITDMeSmA02S02 = TotINFMeSmA02S02 / TotDeaMeSmA02S02  
{txt}(67 missing values generated)

{com}. 
. label var TotITDMeSmA02S02 "Total infections to Deaths S2 IHME"
{txt}
{com}. 
. 
. 
. 
. gen DayITDMeSmA02S03  = DayINFMeSmA02S03  / DayDeaMeSmA02S03   
{txt}(67 missing values generated)

{com}. 
. label var DayITDMeSmA02S03  "Daily infections to Deaths S3 IHME"
{txt}
{com}. 
. gen TotITDMeSmA02S03  = TotINFMeSmA02S03  / TotDeaMeSmA02S03   
{txt}(67 missing values generated)

{com}. 
. label var TotITDMeSmA02S03  "Total infections to Deaths S3 IHME"
{txt}
{com}. 
. 
. 
. 
. gen DayITDMeRaA03S01  = DayINFMeRaA03S01  / DayDeaMeRaA03S01   
{txt}(44 missing values generated)

{com}. 
. label var DayITDMeRaA03S01  "Daily infections to Deaths S1 IMPE"
{txt}
{com}. 
. gen TotITDMeRaA03S01  = TotINFMeRaA03S01  / TotDeaMeRaA03S01   
{txt}(41 missing values generated)

{com}. 
. label var TotITDMeRaA03S01  "Total infections to Deaths S1 IMPE"
{txt}
{com}. 
. 
. 
. 
. gen DayITDMeRaA03S02  = DayINFMeRaA03S02  / DayDeaMeRaA03S02   
{txt}(44 missing values generated)

{com}. 
. label var DayITDMeRaA03S02  "Daily infections to Deaths S2 IMPE"
{txt}
{com}. 
. gen TotITDMeRaA03S02  = TotINFMeRaA03S02  / TotDeaMeRaA03S02   
{txt}(41 missing values generated)

{com}. 
. label var TotITDMeRaA03S02  "Total infections to Deaths S2 IMPE"
{txt}
{com}. 
. 
. 
. 
. gen DayITDMeRaA03S03  = DayINFMeRaA03S03  / DayDeaMeRaA03S03   
{txt}(44 missing values generated)

{com}. 
. label var DayITDMeRaA03S03  "Daily infections to Deaths S3 IMPE"
{txt}
{com}. 
. gen TotITDMeRaA03S03  = TotINFMeRaA03S03  / TotDeaMeRaA03S03   
{txt}(41 missing values generated)

{com}. 
. label var TotITDMeRaA03S03  "Total infections to Deaths S3 IMPE"
{txt}
{com}. 
. 
. 
. gen DayCTDMeRaA05S00  = DayCasMeRaA05S00  / DayDeaMeRaA05S00   
{txt}(696 missing values generated)

{com}. 
. label var DayCTDMeRaA05S00  "Daily Cases to Deaths S0 SRIV"
{txt}
{com}. 
. gen TotCTDMeRaA05S00  = TotCasMeRaA05S00  / TotDeaMeRaA05S00   
{txt}(695 missing values generated)

{com}. 
. label var TotCTDMeRaA05S00  "Total Cases to Deaths S0 SRIV"
{txt}
{com}. 
. 
. 
. 
. ***********************
. 
. * daily deaths estimated to reported  
. 
.     
. gen DayDERMeRaA00S00 = DayDeaMeRaA00S00 / DayDeaMeRaA00S00
{txt}(136 missing values generated)

{com}. 
. label var DayDERMeRaA00S00 "Daily Deaths estim to reported JOHN = 1" 
{txt}
{com}. 
. 
. gen DayDERMeRaA01S00 = DayDeaMeRaA01S00 / DayDeaMeRaA00S00
{txt}(698 missing values generated)

{com}. 
. label var DayDERMeRaA01S00 "Daily Deaths estim to reported Mean DELP S0"
{txt}
{com}. 
. 
. gen DayDERMeSmA02S01 = DayDeaMeSmA02S01 / DayDeaMeRaA00S00
{txt}(170 missing values generated)

{com}. 
. label var DayDERMeSmA02S01 "Daily Deaths estim to reported Mean smoothed IHME S1"
{txt}
{com}. 
. 
. gen DayDERMeSmA02S02 = DayDeaMeSmA02S02 / DayDeaMeRaA00S00
{txt}(170 missing values generated)

{com}. 
. label var DayDERMeSmA02S02 "Daily Deaths estim to reported Mean smoothed IHME S2"
{txt}
{com}. 
. 
. gen DayDERMeSmA02S03 = DayDeaMeSmA02S03 / DayDeaMeSmA00S00
{txt}(170 missing values generated)

{com}. 
. label var DayDERMeSmA02S03 "Daily Deaths estim to reported Mean smoothed IHME S3"
{txt}
{com}. 
. 
. gen DayDERMeRaA03S01 = DayDeaMeRaA03S01 / DayDeaMeRaA00S00
{txt}(136 missing values generated)

{com}. 
. label var DayDERMeRaA03S01 "Daily Deaths estim to reported Mean S1 IMPE"
{txt}
{com}. 
. 
. gen DayDERMeRaA03S02 = DayDeaMeRaA03S02 / DayDeaMeRaA00S00
{txt}(136 missing values generated)

{com}. 
. label var DayDERMeRaA03S02 "Daily Deaths estim to reported Mean S2 IMPE"
{txt}
{com}. 
. 
. gen DayDERMeRaA03S03 = DayDeaMeRaA03S03 / DayDeaMeRaA00S00
{txt}(136 missing values generated)

{com}. 
. label var DayDERMeRaA03S03 "Daily Deaths estim to reported Mean S3 IMPE"
{txt}
{com}. 
. 
. gen DayDERMeRaA05S00  = DayDeaMeRaA05S00 / DayDeaMeRaA00S00
{txt}(791 missing values generated)

{com}. 
. label var DayDERMeRaA05S00 "Daily Deaths estim to reported S0 SRIV"
{txt}
{com}. 
. 
. 
. 
. 
. 
. * daily cases or infections estimated, to reported cases 
. 
. 
. gen DayCERMeRaA00S00 = DayCasMeRaA00S00 / DayCasMeRaA00S00
{txt}(136 missing values generated)

{com}. 
. label var DayCERMeRaA00S00 "Daily Cases estim to reported JOHN = 1" 
{txt}
{com}. 
. 
. gen DayCERMeRaA01S00 = DayCasMeRaA01S00 / DayCasMeRaA00S00
{txt}(698 missing values generated)

{com}. 
. label var DayCERMeRaA01S00 "Daily Cases estim to reported Mean DELP S0"
{txt}
{com}. 
. 
. gen DayIERMeSmA02S01 = DayINFMeSmA02S01 / DayCasMeRaA00S00
{txt}(170 missing values generated)

{com}. 
. label var DayIERMeSmA02S01 "Daily infections estim to reported cases Mean smoothed IHME S1"
{txt}
{com}. 
. 
. gen DayIERMeSmA02S02 = DayINFMeSmA02S02 / DayCasMeRaA00S00
{txt}(170 missing values generated)

{com}. 
. label var DayIERMeSmA02S02 "Daily infections estim to reported cases Mean smoothed IHME S2"
{txt}
{com}. 
. 
. gen DayIERMeSmA02S03 = DayINFMeSmA02S03 / DayCasMeRaA00S00
{txt}(170 missing values generated)

{com}. 
. label var DayIERMeSmA02S03 "Daily infections estim to reported cases Mean smoothed IHME S3"
{txt}
{com}. 
. 
. gen DayIERMeRaA03S01 = DayINFMeRaA03S01 / DayCasMeRaA00S00
{txt}(136 missing values generated)

{com}. 
. label var DayIERMeRaA03S01 "Daily infections estim to reported cases Mean S1 IMPE"
{txt}
{com}. 
. 
. gen DayIERMeRaA03S02 = DayINFMeRaA03S02 / DayCasMeRaA00S00
{txt}(136 missing values generated)

{com}. 
. label var DayIERMeRaA03S02 "Daily infections estim to reported cases Mean S2 IMPE"
{txt}
{com}. 
. 
. gen DayIERMeRaA03S03 = DayINFMeRaA03S03 / DayCasMeRaA00S00
{txt}(136 missing values generated)

{com}. 
. label var DayIERMeRaA03S03 "Daily infections estim to reported cases Mean S3 IMPE"
{txt}
{com}. 
. 
. gen DayCERMeRaA05S00  = DayCasMeRaA05S00 / DayCasMeRaA00S00
{txt}(791 missing values generated)

{com}. 
. label var DayCERMeRaA05S00 "Daily Cases estim to reported S0 SRIV"
{txt}
{com}. 
. 
. 
. 
. 
. 
. * Total deaths estimated to reported  
. 
. 
. gen TotDERMeRaA00S00 = TotDeaMeRaA00S00 / TotDeaMeRaA00S00
{txt}(136 missing values generated)

{com}. 
. label var TotDERMeRaA00S00 "Total Deaths estim to reported JOHN = 1" 
{txt}
{com}. 
. 
. gen TotDERMeRaA01S00 = TotDeaMeRaA01S00 / TotDeaMeRaA00S00
{txt}(697 missing values generated)

{com}. 
. label var TotDERMeRaA01S00 "Total Deaths estim to reported Mean DELP S0"
{txt}
{com}. 
. 
. gen TotDERMeSmA02S01 = TotDeaMeSmA02S01 / TotDeaMeRaA00S00
{txt}(170 missing values generated)

{com}. 
. label var TotDERMeSmA02S01 "Total Deaths estim to reported Mean smoothed IHME S1"
{txt}
{com}. 
. 
. gen TotDERMeSmA02S02 = TotDeaMeSmA02S02 / TotDeaMeRaA00S00
{txt}(170 missing values generated)

{com}. 
. label var TotDERMeSmA02S02 "Total Deaths estim to reported Mean smoothed IHME S2"
{txt}
{com}. 
. 
. gen TotDERMeSmA02S03 = TotDeaMeSmA02S03 / TotDeaMeRaA00S00
{txt}(170 missing values generated)

{com}. 
. label var TotDERMeSmA02S03 "Total Deaths estim to reported Mean smoothed IHME S3"
{txt}
{com}. 
. 
. gen TotDERMeRaA03S01 = TotDeaMeRaA03S01 / TotDeaMeRaA00S00
{txt}(136 missing values generated)

{com}. 
. label var TotDERMeRaA03S01 "Total Deaths estim to reported Mean S1 IMPE"
{txt}
{com}. 
. 
. gen TotDERMeRaA03S02 = TotDeaMeRaA03S02 / TotDeaMeRaA00S00
{txt}(136 missing values generated)

{com}. 
. label var TotDERMeRaA03S02 "Total Deaths estim to reported Mean S2 IMPE"
{txt}
{com}. 
. 
. gen TotDERMeRaA03S03 = TotDeaMeRaA03S03 / TotDeaMeRaA00S00
{txt}(136 missing values generated)

{com}. 
. label var TotDERMeRaA03S03 "Total Deaths estim to reported Mean S3 IMPE"
{txt}
{com}. 
. 
. gen TotDERMeRaA05S00  = TotDeaMeRaA05S00 / TotDeaMeRaA00S00
{txt}(790 missing values generated)

{com}. 
. label var TotDERMeRaA05S00 "Total Deaths estim to reported S0 SRIV"
{txt}
{com}. 
. 
. 
. 
. 
. 
. * Total cases or infections estimated to reported  
. 
. 
. gen TotCERMeRaA00S00 = TotCasMeRaA00S00 / TotCasMeRaA00S00
{txt}(136 missing values generated)

{com}. 
. label var TotCERMeRaA00S00 "Total Cases estim to reported JOHN = 1" 
{txt}
{com}. 
. 
. gen TotCERMeRaA01S00 = TotCasMeRaA01S00 / TotCasMeRaA00S00
{txt}(697 missing values generated)

{com}. 
. label var TotCERMeRaA01S00 "Total Cases estim to reported Mean DELP S0"
{txt}
{com}. 
. 
. gen TotIERMeSmA02S01 = TotINFMeSmA02S01 / TotCasMeRaA00S00
{txt}(170 missing values generated)

{com}. 
. label var TotIERMeSmA02S01 "Total infections estim to reported cases Mean smoothed IHME S1"
{txt}
{com}. 
. 
. gen TotIERMeSmA02S02 = TotINFMeSmA02S02 / TotCasMeRaA00S00
{txt}(170 missing values generated)

{com}. 
. label var TotIERMeSmA02S02 "Total infections estim to reported cases Mean smoothed IHME S2"
{txt}
{com}. 
. 
. gen TotIERMeSmA02S03 = TotINFMeSmA02S03 / TotCasMeRaA00S00
{txt}(170 missing values generated)

{com}. 
. label var TotIERMeSmA02S03 "Total infections estim to reported cases Mean smoothed IHME S3"
{txt}
{com}. 
. 
. gen TotIERMeRaA03S01 = TotINFMeRaA03S01 / TotCasMeRaA00S00
{txt}(136 missing values generated)

{com}. 
. label var TotIERMeRaA03S01 "Total infections estim to reported cases Mean S1 IMPE"
{txt}
{com}. 
. 
. gen TotIERMeRaA03S02 = TotINFMeRaA03S02 / TotCasMeRaA00S00
{txt}(136 missing values generated)

{com}. 
. label var TotIERMeRaA03S02 "Total infections estim to reported cases Mean S2 IMPE"
{txt}
{com}. 
. 
. gen TotIERMeRaA03S03 = TotINFMeRaA03S03 / TotCasMeRaA00S00
{txt}(136 missing values generated)

{com}. 
. label var TotIERMeRaA03S03 "Total infections estim to reported cases Mean S3 IMPE"
{txt}
{com}. 
. 
. gen TotCERMeRaA05S00  = TotCasMeRaA05S00 / TotCasMeRaA00S00
{txt}(790 missing values generated)

{com}. 
. label var TotCERMeRaA05S00 "Total Cases estim to reported S0 SRIV"
{txt}
{com}. 
. 
.  
. *
. 
. sort date
{txt}
{com}. 
. save "CovidVisualizedGlobal merge.dta", replace
{txt}(note: file CovidVisualizedGlobal merge.dta not found)
file CovidVisualizedGlobal merge.dta saved

{com}. 
. 
. *
. 
. 
. * gen calendar file
. 
. 
. clear
{txt}
{com}. 
. di td(01jan2020) // 21915
{res}21915
{txt}
{com}. 
. di td(01jan2022) // 22646
{res}22646
{txt}
{com}. 
. di td(01jan2022) - td(01jan2020) // 731 + 1 = 732
{res}731
{txt}
{com}. 
. 
. 
. set obs 732
{txt}{p}
number of observations (_N)  was 0,
now 732
{p_end}

{com}. 
. gen date = .
{txt}(732 missing values generated)

{com}. 
. replace date = 21915 in 1
{txt}(1 real change made)

{com}. 
. replace date = date[_n-1] + 1 in 2/l
{txt}(731 real changes made)

{com}. 
. replace date = date[_n-1] + 1 in 2/732
{txt}(0 real changes made)

{com}. 
. format date %tdDDMonCCYY
{txt}
{com}. 
. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21915{txt},{res}22646{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}01jan2020{txt},{res}01jan2022{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}732{col 51}{txt}missing .:  {res}0{txt}/{res}732

{txt}{col 19}mean:{res}{col 26} 22280.5{txt} = {res}31dec2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 211.454

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21988{col 37} 22097.5{col 47} 22280.5{col 57} 22463.5{col 67}   22573
{col 26}14mar2020{col 36}01jul2020{col 46}31dec2020{col 56}02jul2021{col 66}20oct2021
{txt}
{com}. 
. 
. merge m:m date using "CovidVisualizedGlobal merge.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              64
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}              64{txt}  (_merge==2)

{col 5}matched{col 30}{res}             732{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. replace loc_grand_name = "global"
{txt}(0 real changes made)

{com}. 
. sort date loc_grand_name
{txt}
{com}. 
. isid date loc_grand_name
{txt}
{com}. 
. drop _merge
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. 
. save "CovidVisualizedGlobal merge.dta", replace
{txt}file CovidVisualizedGlobal merge.dta saved

{com}. 
. export delimited using "CovidVisualizedGlobal merge.csv", replace 
{res}{txt}(note: file CovidVisualizedGlobal merge.csv not found)
{txt}file CovidVisualizedGlobal merge.csv saved

{com}. 
. 
. 
. 
. *
. 
. di in red "********* Description of vars in this final file named CovidVisualizedGlobal merge.dta *********" 
{res}{err}********* Description of vars in this final file named CovidVisualizedGlobal merge.dta *********
{txt}
{com}. 
. 
. desc, fullnames

{txt}Contains data from {res}CovidVisualizedGlobal merge.dta
{txt}  obs:{res}           796                          
{txt} vars:{res}           487                          22 Oct 2021 11:10
{txt} size:{res}     1,556,180                          
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:date           }{txt}{bind: int     }{bind:{txt}%td..     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:loc_grand_name }{txt}{bind: str6    }{bind:{txt}%9s       }{space 1}{bind:         }{bind:  }{res}{res}Location{p_end}
{p 0 48}DayDeaMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths raw A00 JOHN{p_end}
{p 0 48}TotDeaMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total deaths raw A00 JOHN{p_end}
{p 0 48}DayCasMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases raw A00 JOHN{p_end}
{p 0 48}TotCasMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total cases raw A00 JOHN{p_end}
{p 0 48}DayRecMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily recovered raw A00 JOHN{p_end}
{p 0 48}TotRecMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total recovered raw A00 JOHN{p_end}
{p 0 48}DayCfrMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR raw JOHN{p_end}
{p 0 48}DayDeMMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths raw mean JOHN DayDeM{p_end}
{p 0 48}DayCaMMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases raw mean JOHN DayCaM{p_end}
{p 0 48}DayCbDMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases mean div by daily deaths mean JOHN DayCbD{p_end}
{p 0 48}DayDeaMeRaA00multip{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths scaled (times means of cases by deaths) only for visualization JOHN{p_end}
{p 0 48}DayDeaMeSmA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths smooth A00 JOHN{p_end}
{p 0 48}DayCasMeSmA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases smooth A00 JOHN{p_end}
{p 0 48}DayCfrMeSmA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR smooth A00 JOHN{p_end}
{p 0 48}DayRecMeSmA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily recovered smooth A00 JOHN{p_end}
{p 0 48}DayDeaMeSmA00multip{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths scaled smooth A00 JOHN{p_end}
{p 0 48}TotDeaMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean DELP S0{p_end}
{p 0 48}TotDeaLoRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower DELP S0{p_end}
{p 0 48}TotDeaUpRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper DELP S0{p_end}
{p 0 48}DayDeaMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean DELP S0{p_end}
{p 0 48}DayDeaLoRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower DELP S0{p_end}
{p 0 48}DayDeaUpRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper DELP S0{p_end}
{p 0 48}TotCasMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Mean DELP S0{p_end}
{p 0 48}TotCasLoRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Lower DELP S0{p_end}
{p 0 48}TotCasUpRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Upper DELP S0{p_end}
{p 0 48}DayCasMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Mean DELP S0{p_end}
{p 0 48}DayCasLoRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Lower DELP S0{p_end}
{p 0 48}DayCasUpRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Upper DELP S0{p_end}
{p 0 48}DayActMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Active Mean DELP S0{p_end}
{p 0 48}DayHosMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Active Hospitalized Mean DELP S0{p_end}
{p 0 48}DayVenMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Active Ventilated Mean DELP S0{p_end}
{p 0 48}TotHosMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Active Mean DELP S0{p_end}
{p 0 48}DayCfrMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Mean DELP S0{p_end}
{p 0 48}DayCfrLoRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Lower DELP S0{p_end}
{p 0 48}DayCfrUpRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Upper DELP S0{p_end}
{p 0 48}DayDeMMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths mean DELP DayDeM{p_end}
{p 0 48}DayCaMMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases mean DELP DayCaM{p_end}
{p 0 48}DayCbDMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases mean div by daily deaths mean DELP DayCbD{p_end}
{p 0 48}DayDMuMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths scaled (times means of cases by deaths) only for visualization DELP{p_end}
{p 0 48}DayINFMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Mean smoothed IHME S1{p_end}
{p 0 48}DayINFUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Upper smoothed IHME S1{p_end}
{p 0 48}DayINFLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Lower smoothed IHME S1{p_end}
{p 0 48}TotDeXMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Excess Deaths Mean smoothed IHME S1{p_end}
{p 0 48}TotDeXLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Excess Deaths Lower smoothed IHME S1{p_end}
{p 0 48}TotDeXUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Excess Deaths Upper smoothed IHME S1{p_end}
{p 0 48}TotINFMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total infections Mean smoothed IHME S1{p_end}
{p 0 48}TotINFLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total infections Lower smoothed IHME S1{p_end}
{p 0 48}TotINFUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total infections Upper smoothed IHME S1{p_end}
{p 0 48}DayDeXMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Excess Deaths Mean smoothed IHME S1{p_end}
{p 0 48}DayDeXLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Excess Deaths Lower smoothed IHME S1{p_end}
{p 0 48}DayDeXUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Excess Deaths Upper smoothed IHME S1{p_end}
{p 0 48}DayDeaMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Reported Deaths Mean smoothed IHME S1{p_end}
{p 0 48}DayDeaLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Reported Deaths Lower smoothed IHME S1{p_end}
{p 0 48}DayDeaUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Reported Deaths Upper smoothed IHME S1{p_end}
{p 0 48}TotDeaMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Reported Deaths Mean smoothed IHME S1{p_end}
{p 0 48}TotDeaLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Reported Deaths Lower smoothed IHME S1{p_end}
{p 0 48}TotDeaUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Reported Deaths Upper smoothed IHME S1{p_end}
{p 0 48}reff_mean_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME R effective (mean estimate) S1{p_end}
{p 0 48}reff_lower_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME R effective (lower 95% confidence interval) S1{p_end}
{p 0 48}reff_upper_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME R effective (upper 95% confidence interval) S1{p_end}
{p 0 48}cumulative_deaths_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Cumulative deaths (raw data with excess mortality scalar applied) S1{p_end}
{p 0 48}daily_deaths_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily deaths (raw data with excess mortality scalar applied) S1{p_end}
{p 0 48}cumulative_cases_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Cumulative cases (raw data) S1{p_end}
{p 0 48}cumul_deaths_unscaled_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME umulative deaths (raw data without excess mortality scalar applied) S1{p_end}
{p 0 48}cumulative_hosp_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Cumulative hospitalizations (raw data) S1{p_end}
{p 0 48}dai_dea_unscaled_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily deaths (raw data without excess mortality scalar applied) S1{p_end}
{p 0 48}{bind:dai_inf_A02S01 }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily infections (raw data without excess mortality scalar applied){p_end}
{p 0 48}{bind:population     }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Population size{p_end}
{p 0 48}mobility_mean_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Percent change in mobility from baseline (mean)  S1{p_end}
{p 0 48}{bind:mobility_obs   }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Indicator for whether mobility estimate comes from observed data (1) or mod{p_end}
{p 0 48}{bind:testing_mean   }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Tests per 100,000 (mean estimate){p_end}
{p 0 48}{bind:testing_lower  }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Tests per 100,000 (lower 95% confidence interval){p_end}
{p 0 48}{bind:testing_upper  }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Tests per 100,000 (upper 95% confidence interval){p_end}
{p 0 48}{bind:testing_obs    }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Indicator for whether testing estimate comes from observed data (1) or mode{p_end}
{p 0 48}{bind:pneumonia_mean }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Ratio of pneumonia deaths in a given week to the average weekly pneumonia d{p_end}
{p 0 48}{bind:pneumonia_obs  }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Indicator for whether pneumonia estimate comes from observed data (1) or mo{p_end}
{p 0 48}mask_use_mean_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Percent of population reporting always wearing a mask when leaving home  S1{p_end}
{p 0 48}{bind:mask_use_obs   }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Indicator for whether mask estimate comes from observed data (1) or modelle{p_end}
{p 0 48}cumulative_all_vaccinated{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Initially vaccinated (one dose of two doses){p_end}
{p 0 48}cumulative_all_fully_vaccinated{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Fully vaccinated (one of one and†two†of two doses){p_end}
{p 0 48}cumulative_all_effectively_vacci{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Effectively vaccinated (one and two dose with efficacy){p_end}
{p 0 48}DayBedMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital beds needed (mean estimate) S1{p_end}
{p 0 48}DayBedLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital beds needed (upper 95% confidence interval) S1{p_end}
{p 0 48}DayBedUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital beds needed (lower 95% confidence interval) S1{p_end}
{p 0 48}DayIcuMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 ICU beds needed (mean estimate) S1{p_end}
{p 0 48}DayIcuUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 ICU beds needed (lower 95% confidence interval) S1{p_end}
{p 0 48}DayIcuLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 ICU beds needed (upper 95% confidence interval) S1{p_end}
{p 0 48}DayAdmMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital admissions (mean estimate) S1{p_end}
{p 0 48}DayAdmUpSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital admissions (mean estimate) S1{p_end}
{p 0 48}DayAdmLoSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital admissions (mean estimate) S1{p_end}
{p 0 48}{bind:DayBEDMeSmA02  }{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME Total number of beds that exist at a location{p_end}
{p 0 48}{bind:DayICUMeSmA02  }{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME Total number of ICU beds that exist at a location{p_end}
{p 0 48}infection_fatality_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Infection fatality ratio S1{p_end}
{p 0 48}infection_detection_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Infection detection ratio S1{p_end}
{p 0 48}infection_hospitalization_A02S01{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Infection hospitalization ratio S1{p_end}
{p 0 48}DayINFMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Mean smoothed IHME S2{p_end}
{p 0 48}DayINFUpSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Upper smoothed IHME S2{p_end}
{p 0 48}DayINFLoSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Lower smoothed IHME S2{p_end}
{p 0 48}TotDeXMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Excess Deaths Mean smoothed IHME S2{p_end}
{p 0 48}TotDeXLoSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Excess Deaths Lower smoothed IHME S2{p_end}
{p 0 48}TotDeXUpSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Excess Deaths Upper smoothed IHME S2{p_end}
{p 0 48}TotINFMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total infections Mean smoothed IHME S2{p_end}
{p 0 48}TotINFLoSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total infections Lower smoothed IHME S2{p_end}
{p 0 48}TotINFUpSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total infections Upper smoothed IHME S2{p_end}
{p 0 48}DayDeXMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Excess Deaths Mean smoothed IHME S2{p_end}
{p 0 48}DayDeXLoSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Excess Deaths Lower smoothed IHME S2{p_end}
{p 0 48}DayDeXUpSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Excess Deaths Upper smoothed IHME S2{p_end}
{p 0 48}DayDeaMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Reported Deaths Mean smoothed IHME S2{p_end}
{p 0 48}DayDeaLoSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Reported Deaths Lower smoothed IHME S2{p_end}
{p 0 48}DayDeaUpSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Reported Deaths Upper smoothed IHME S2{p_end}
{p 0 48}TotDeaMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Reported Deaths Mean smoothed IHME S2{p_end}
{p 0 48}TotDeaLoSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Reported Deaths Lower smoothed IHME S2{p_end}
{p 0 48}TotDeaUpSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Reported Deaths Upper smoothed IHME S2{p_end}
{p 0 48}reff_mean_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME R effective (mean estimate) S2{p_end}
{p 0 48}reff_lower_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME R effective (lower 95% confidence interval) S2{p_end}
{p 0 48}reff_upper_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME R effective (upper 95% confidence interval) S2{p_end}
{p 0 48}cumulative_deaths_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Cumulative deaths (raw data with excess mortality scalar applied) S2{p_end}
{p 0 48}daily_deaths_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily deaths (raw data with excess mortality scalar applied) S2{p_end}
{p 0 48}cumulative_cases_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Cumulative cases (raw data) S2{p_end}
{p 0 48}cumul_deaths_unscaled_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME umulative deaths (raw data without excess mortality scalar applied) S2{p_end}
{p 0 48}cumulative_hosp_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Cumulative hospitalizations (raw data) S2{p_end}
{p 0 48}dai_dea_unscaled_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily deaths (raw data without excess mortality scalar applied) S2{p_end}
{p 0 48}{bind:dai_inf_A02S02 }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily infections (raw data without excess mortality scalar applied){p_end}
{p 0 48}mobility_mean_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Percent change in mobility from baseline (mean) S2{p_end}
{p 0 48}mask_use_mean_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Percent of population reporting always wearing a mask when leaving home S2{p_end}
{p 0 48}DayBedMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital beds needed (mean estimate) S2{p_end}
{p 0 48}DayBedLoSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital beds needed (upper 95% confidence interval) S2{p_end}
{p 0 48}DayBedUpSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital beds needed (lower 95% confidence interval) S2{p_end}
{p 0 48}DayIcuMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 ICU beds needed (mean estimate) S2{p_end}
{p 0 48}DayIcuUpSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 ICU beds needed (lower 95% confidence interval) S2{p_end}
{p 0 48}DayIcuLoSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 ICU beds needed (upper 95% confidence interval) S2{p_end}
{p 0 48}DayAdmMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital admissions (mean estimate) S2{p_end}
{p 0 48}DayAdmUpSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital admissions (mean estimate) S2{p_end}
{p 0 48}DayAdmLoSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital admissions (mean estimate) S2{p_end}
{p 0 48}infection_fatality_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Infection fatality ratio S2{p_end}
{p 0 48}infection_detection_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Infection detection ratio S2{p_end}
{p 0 48}infection_hospitalization_A02S02{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Infection hospitalization ratio S2{p_end}
{p 0 48}DayINFMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Mean smoothed IHME S3{p_end}
{p 0 48}DayINFUpSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Upper smoothed IHME S3{p_end}
{p 0 48}DayINFLoSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Lower smoothed IHME S3{p_end}
{p 0 48}TotDeXMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Excess Deaths Mean smoothed IHME S3{p_end}
{p 0 48}TotDeXLoSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Excess Deaths Lower smoothed IHME S3{p_end}
{p 0 48}TotDeXUpSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Excess Deaths Upper smoothed IHME S3{p_end}
{p 0 48}TotINFMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total infections Mean smoothed IHME S3{p_end}
{p 0 48}TotINFLoSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total infections Lower smoothed IHME S3{p_end}
{p 0 48}TotINFUpSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total infections Upper smoothed IHME S3{p_end}
{p 0 48}DayDeXMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Excess Deaths Mean smoothed IHME S3{p_end}
{p 0 48}DayDeXLoSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Excess Deaths Lower smoothed IHME S3{p_end}
{p 0 48}DayDeXUpSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Excess Deaths Upper smoothed IHME S3{p_end}
{p 0 48}DayDeaMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Reported Deaths Mean smoothed IHME S3{p_end}
{p 0 48}DayDeaLoSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Reported Deaths Lower smoothed IHME S3{p_end}
{p 0 48}DayDeaUpSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Reported Deaths Upper smoothed IHME S3{p_end}
{p 0 48}TotDeaMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Reported Deaths Mean smoothed IHME S3{p_end}
{p 0 48}TotDeaLoSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Reported Deaths Lower smoothed IHME S3{p_end}
{p 0 48}TotDeaUpSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Reported Deaths Upper smoothed IHME S3{p_end}
{p 0 48}reff_mean_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}IHME R effective (mean estimate) S3{p_end}
{p 0 48}reff_lower_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME R effective (lower 95% confidence interval) S3{p_end}
{p 0 48}reff_upper_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME R effective (upper 95% confidence interval) S3{p_end}
{p 0 48}cumulative_deaths_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Cumulative deaths (raw data with excess mortality scalar applied) S3{p_end}
{p 0 48}daily_deaths_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily deaths (raw data with excess mortality scalar applied) S3{p_end}
{p 0 48}cumulative_cases_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Cumulative cases (raw data) S3{p_end}
{p 0 48}cumul_deaths_unscaled_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME umulative deaths (raw data without excess mortality scalar applied) S3{p_end}
{p 0 48}cumulative_hosp_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Cumulative hospitalizations (raw data) S3{p_end}
{p 0 48}dai_dea_unscaled_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily deaths (raw data without excess mortality scalar applied) S3{p_end}
{p 0 48}{bind:dai_inf_A02S03 }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily infections (raw data without excess mortality scalar applied){p_end}
{p 0 48}mobility_mean_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Percent change in mobility from baseline (mean) S3{p_end}
{p 0 48}mask_use_mean_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Percent of population reporting always wearing a mask when leaving home S3{p_end}
{p 0 48}DayBedMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital beds needed (mean estimate) S3{p_end}
{p 0 48}DayBedLoSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital beds needed (upper 95% confidence interval) S3{p_end}
{p 0 48}DayBedUpSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital beds needed (lower 95% confidence interval) S3{p_end}
{p 0 48}DayIcuMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 ICU beds needed (mean estimate) S3{p_end}
{p 0 48}DayIcuUpSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 ICU beds needed (lower 95% confidence interval) S3{p_end}
{p 0 48}DayIcuLoSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 ICU beds needed (upper 95% confidence interval) S3{p_end}
{p 0 48}DayAdmMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital admissions (mean estimate) S3{p_end}
{p 0 48}DayAdmUpSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital admissions (mean estimate) S3{p_end}
{p 0 48}DayAdmLoSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Daily COVID-19 hospital admissions (mean estimate) S3{p_end}
{p 0 48}infection_fatality_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Infection fatality ratio S3{p_end}
{p 0 48}infection_detection_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Infection detection ratio S3{p_end}
{p 0 48}infection_hospitalization_A02S03{p_end}
{p 0 48}{space 15}{txt}{bind: double  }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}IHME Infection hospitalization ratio S3{p_end}
{p 0 48}DayDeMMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths mean IHME DayDeM{p_end}
{p 0 48}DayCaMMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections mean IHME DayCaM{p_end}
{p 0 48}DayCbDMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections mean div by daily deaths mean IHME DayCbD{p_end}
{p 0 48}DayDMuMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths scaled (times means of infections by deaths) IHME{p_end}
{p 0 48}cumulative_all_vaccin_pct{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}% population IHME Initially vaccinated (one dose of two doses){p_end}
{p 0 48}cumul_all_effect_vacci_pct{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}% population IHME Effectively vaccinated (one and two dose with efficacy){p_end}
{p 0 48}cumul_all_fully_vacci_pct{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}% population IHME Fully vaccinated (one of one and two of two doses){p_end}
{p 0 48}daily_all_vaccinated{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily population IHME Initially vaccinated (one dose of two doses){p_end}
{p 0 48}daily_all_effectively_vacci{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily population IHME Effectively vaccinated (one and two dose with efficacy){p_end}
{p 0 48}daily_all_fully_vaccinated{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily population IHME Fully vaccinated (one of one and two of two doses){p_end}
{p 0 48}daily_all_vaccin_pct{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}% Daily population IHME Initially vaccinated (one dose of two doses){p_end}
{p 0 48}daily_all_effect_vacci_pct{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}% Daily population IHME Effectively vaccinated (one and two dose with efficacy){p_end}
{p 0 48}daily_all_fully_vacci_pct{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}% Daily population IHME Fully vaccinated (one of one and two of two doses){p_end}
{p 0 48}TotDeaMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean A03 S01 {p_end}
{p 0 48}TotDeaLoRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower A03 S01 {p_end}
{p 0 48}TotDeaUpRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper A03 S01 {p_end}
{p 0 48}TotDeaMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean A03 S02 {p_end}
{p 0 48}TotDeaLoRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower A03 S02 {p_end}
{p 0 48}TotDeaUpRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper A03 S02 {p_end}
{p 0 48}TotDeaMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean A03 S03 {p_end}
{p 0 48}TotDeaLoRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower A03 S03 {p_end}
{p 0 48}TotDeaUpRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper A03 S03 {p_end}
{p 0 48}TotDeaMeRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean A03 S04 {p_end}
{p 0 48}TotDeaLoRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower A03 S04 {p_end}
{p 0 48}TotDeaUpRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper A03 S04 {p_end}
{p 0 48}TotDeaMeRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean A03 S05 {p_end}
{p 0 48}TotDeaLoRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower A03 S05 {p_end}
{p 0 48}TotDeaUpRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper A03 S05 {p_end}
{p 0 48}TotDeaMeRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean A03 S06 {p_end}
{p 0 48}TotDeaLoRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower A03 S06 {p_end}
{p 0 48}TotDeaUpRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper A03 S06 {p_end}
{p 0 48}DayDeaMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean A03 S01 {p_end}
{p 0 48}DayDeaLoRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower A03 S01 {p_end}
{p 0 48}DayDeaUpRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper A03 S01 {p_end}
{p 0 48}DayDeaMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean A03 S02 {p_end}
{p 0 48}DayDeaLoRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower A03 S02 {p_end}
{p 0 48}DayDeaUpRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper A03 S02 {p_end}
{p 0 48}DayDeaMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean A03 S03 {p_end}
{p 0 48}DayDeaLoRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower A03 S03 {p_end}
{p 0 48}DayDeaUpRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper A03 S03 {p_end}
{p 0 48}DayDeaMeRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean A03 S04 {p_end}
{p 0 48}DayDeaLoRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower A03 S04 {p_end}
{p 0 48}DayDeaUpRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper A03 S04 {p_end}
{p 0 48}DayDeaMeRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean A03 S05 {p_end}
{p 0 48}DayDeaLoRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower A03 S05 {p_end}
{p 0 48}DayDeaUpRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper A03 S05 {p_end}
{p 0 48}DayDeaMeRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean A03 S06 {p_end}
{p 0 48}DayDeaLoRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower A03 S06 {p_end}
{p 0 48}DayDeaUpRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper A03 S06 {p_end}
{p 0 48}TotINFMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Mean A03 S01 {p_end}
{p 0 48}TotINFLoRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Lower A03 S01 {p_end}
{p 0 48}TotINFUpRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Upper A03 S01 {p_end}
{p 0 48}TotINFMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Mean A03 S02 {p_end}
{p 0 48}TotINFLoRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Lower A03 S02 {p_end}
{p 0 48}TotINFUpRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Upper A03 S02 {p_end}
{p 0 48}TotINFMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Mean A03 S03 {p_end}
{p 0 48}TotINFLoRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Lower A03 S03 {p_end}
{p 0 48}TotINFUpRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Upper A03 S03 {p_end}
{p 0 48}TotINFMeRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Mean A03 S04 {p_end}
{p 0 48}TotINFLoRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Lower A03 S04 {p_end}
{p 0 48}TotINFUpRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Upper A03 S04 {p_end}
{p 0 48}TotINFMeRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Mean A03 S05 {p_end}
{p 0 48}TotINFLoRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Lower A03 S05 {p_end}
{p 0 48}TotINFUpRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Upper A03 S05 {p_end}
{p 0 48}TotINFMeRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Mean A03 S06 {p_end}
{p 0 48}TotINFLoRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Lower A03 S06 {p_end}
{p 0 48}TotINFUpRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections Upper A03 S06 {p_end}
{p 0 48}DayINFMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Mean A03 S01 {p_end}
{p 0 48}DayINFLoRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Lower A03 S01 {p_end}
{p 0 48}DayINFUpRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Upper A03 S01 {p_end}
{p 0 48}DayINFMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Mean A03 S02 {p_end}
{p 0 48}DayINFLoRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Lower A03 S02 {p_end}
{p 0 48}DayINFUpRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Upper A03 S02 {p_end}
{p 0 48}DayINFMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Mean A03 S03 {p_end}
{p 0 48}DayINFLoRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Lower A03 S03 {p_end}
{p 0 48}DayINFUpRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Upper A03 S03 {p_end}
{p 0 48}DayINFMeRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Mean A03 S04 {p_end}
{p 0 48}DayINFLoRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Lower A03 S04 {p_end}
{p 0 48}DayINFUpRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Upper A03 S04 {p_end}
{p 0 48}DayINFMeRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Mean A03 S05 {p_end}
{p 0 48}DayINFLoRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Lower A03 S05 {p_end}
{p 0 48}DayINFUpRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Upper A03 S05 {p_end}
{p 0 48}DayINFMeRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Mean A03 S06 {p_end}
{p 0 48}DayINFLoRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Lower A03 S06 {p_end}
{p 0 48}DayINFUpRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections Upper A03 S06 {p_end}
{p 0 48}DayHodLoRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Lower A03 S01 {p_end}
{p 0 48}DayHodMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Mean A03 S01 {p_end}
{p 0 48}DayHodUpRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Upper A03 S01 {p_end}
{p 0 48}DayHodLoRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Lower A03 S02 {p_end}
{p 0 48}DayHodMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Mean A03 S02 {p_end}
{p 0 48}DayHodUpRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Upper A03 S02 {p_end}
{p 0 48}DayHodLoRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Lower A03 S03 {p_end}
{p 0 48}DayHodMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Mean A03 S03 {p_end}
{p 0 48}DayHodUpRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Upper A03 S03 {p_end}
{p 0 48}DayHodLoRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Lower A03 S04 {p_end}
{p 0 48}DayHodMeRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Mean A03 S04 {p_end}
{p 0 48}DayHodUpRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Upper A03 S04 {p_end}
{p 0 48}DayHodLoRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Lower A03 S05 {p_end}
{p 0 48}DayHodMeRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Mean A03 S05 {p_end}
{p 0 48}DayHodUpRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Upper A03 S05 {p_end}
{p 0 48}DayHodLoRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Lower A03 S06 {p_end}
{p 0 48}DayHodMeRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Mean A03 S06 {p_end}
{p 0 48}DayHodUpRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital demand Upper A03 S06 {p_end}
{p 0 48}DayHoiLoRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Lower A03 S01 {p_end}
{p 0 48}DayHoiMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Mean A03 S01 {p_end}
{p 0 48}DayHoiUpRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Upper A03 S01 {p_end}
{p 0 48}DayHoiLoRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Lower A03 S02 {p_end}
{p 0 48}DayHoiMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Mean A03 S02 {p_end}
{p 0 48}DayHoiUpRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Upper A03 S02 {p_end}
{p 0 48}DayHoiLoRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Lower A03 S03 {p_end}
{p 0 48}DayHoiMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Mean A03 S03 {p_end}
{p 0 48}DayHoiUpRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Upper A03 S03 {p_end}
{p 0 48}DayHoiLoRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Lower A03 S04 {p_end}
{p 0 48}DayHoiMeRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Mean A03 S04 {p_end}
{p 0 48}DayHoiUpRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Upper A03 S04 {p_end}
{p 0 48}DayHoiLoRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Lower A03 S05 {p_end}
{p 0 48}DayHoiMeRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Mean A03 S05 {p_end}
{p 0 48}DayHoiUpRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Upper A03 S05 {p_end}
{p 0 48}DayHoiLoRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Lower A03 S06 {p_end}
{p 0 48}DayHoiMeRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Mean A03 S06 {p_end}
{p 0 48}DayHoiUpRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily hospital incidence Upper A03 S06 {p_end}
{p 0 48}DayIcdLoRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Lower A03 S01 {p_end}
{p 0 48}DayIcdMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Mean A03 S01 {p_end}
{p 0 48}DayIcdUpRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Upper A03 S01 {p_end}
{p 0 48}DayIcdLoRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Lower A03 S02 {p_end}
{p 0 48}DayIcdMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Mean A03 S02 {p_end}
{p 0 48}DayIcdUpRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Upper A03 S02 {p_end}
{p 0 48}DayIcdLoRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Lower A03 S03 {p_end}
{p 0 48}DayIcdMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Mean A03 S03 {p_end}
{p 0 48}DayIcdUpRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Upper A03 S03 {p_end}
{p 0 48}DayIcdLoRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Lower A03 S04 {p_end}
{p 0 48}DayIcdMeRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Mean A03 S04 {p_end}
{p 0 48}DayIcdUpRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Upper A03 S04 {p_end}
{p 0 48}DayIcdLoRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Lower A03 S05 {p_end}
{p 0 48}DayIcdMeRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Mean A03 S05 {p_end}
{p 0 48}DayIcdUpRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Upper A03 S05 {p_end}
{p 0 48}DayIcdLoRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Lower A03 S06 {p_end}
{p 0 48}DayIcdMeRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Mean A03 S06 {p_end}
{p 0 48}DayIcdUpRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU demand Upper A03 S06 {p_end}
{p 0 48}DayIciLoRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Lower A03 S01 {p_end}
{p 0 48}DayIciMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Mean A03 S01 {p_end}
{p 0 48}DayIciUpRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Upper A03 S01 {p_end}
{p 0 48}DayIciLoRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Lower A03 S02 {p_end}
{p 0 48}DayIciMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Mean A03 S02 {p_end}
{p 0 48}DayIciUpRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Upper A03 S02 {p_end}
{p 0 48}DayIciLoRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Lower A03 S03 {p_end}
{p 0 48}DayIciMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Mean A03 S03 {p_end}
{p 0 48}DayIciUpRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Upper A03 S03 {p_end}
{p 0 48}DayIciLoRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Lower A03 S04 {p_end}
{p 0 48}DayIciMeRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Mean A03 S04 {p_end}
{p 0 48}DayIciUpRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Upper A03 S04 {p_end}
{p 0 48}DayIciLoRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Lower A03 S05 {p_end}
{p 0 48}DayIciMeRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Mean A03 S05 {p_end}
{p 0 48}DayIciUpRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Upper A03 S05 {p_end}
{p 0 48}DayIciLoRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Lower A03 S06 {p_end}
{p 0 48}DayIciMeRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Mean A03 S06 {p_end}
{p 0 48}DayIciUpRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily ICU incidence Upper A03 S06 {p_end}
{p 0 48}DayPreLoRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Lower A03 S01 {p_end}
{p 0 48}DayPreMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Mean A03 S01 {p_end}
{p 0 48}DayPreUpRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Upper A03 S01 {p_end}
{p 0 48}DayPreLoRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Lower A03 S02 {p_end}
{p 0 48}DayPreMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Mean A03 S02 {p_end}
{p 0 48}DayPreUpRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Upper A03 S02 {p_end}
{p 0 48}DayPreLoRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Lower A03 S03 {p_end}
{p 0 48}DayPreMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Mean A03 S03 {p_end}
{p 0 48}DayPreUpRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Upper A03 S03 {p_end}
{p 0 48}DayPreLoRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Lower A03 S04 {p_end}
{p 0 48}DayPreMeRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Mean A03 S04 {p_end}
{p 0 48}DayPreUpRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Upper A03 S04 {p_end}
{p 0 48}DayPreLoRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Lower A03 S05 {p_end}
{p 0 48}DayPreMeRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Mean A03 S05 {p_end}
{p 0 48}DayPreUpRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Upper A03 S05 {p_end}
{p 0 48}DayPreLoRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Lower A03 S06 {p_end}
{p 0 48}DayPreMeRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Mean A03 S06 {p_end}
{p 0 48}DayPreUpRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily prevalence Upper A03 S06 {p_end}
{p 0 48}DayRefLoRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Lower A03 S01 {p_end}
{p 0 48}DayRefMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Mean A03 S01 {p_end}
{p 0 48}DayRefUpRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Upper A03 S01 {p_end}
{p 0 48}DayRefLoRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Lower A03 S02 {p_end}
{p 0 48}DayRefMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Mean A03 S02 {p_end}
{p 0 48}DayRefUpRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Upper A03 S02 {p_end}
{p 0 48}DayRefLoRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Lower A03 S03 {p_end}
{p 0 48}DayRefMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Mean A03 S03 {p_end}
{p 0 48}DayRefUpRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Upper A03 S03 {p_end}
{p 0 48}DayRefLoRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Lower A03 S04 {p_end}
{p 0 48}DayRefMeRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Mean A03 S04 {p_end}
{p 0 48}DayRefUpRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Upper A03 S04 {p_end}
{p 0 48}DayRefLoRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Lower A03 S05 {p_end}
{p 0 48}DayRefMeRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Mean A03 S05 {p_end}
{p 0 48}DayRefUpRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Upper A03 S05 {p_end}
{p 0 48}DayRefLoRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Lower A03 S06 {p_end}
{p 0 48}DayRefMeRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Mean A03 S06 {p_end}
{p 0 48}DayRefUpRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R effective Upper A03 S06 {p_end}
{p 0 48}DayRttLoRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Lower A03 S01 {p_end}
{p 0 48}DayRttMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Mean A03 S01 {p_end}
{p 0 48}DayRttUpRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Upper A03 S01 {p_end}
{p 0 48}DayRttLoRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Lower A03 S02 {p_end}
{p 0 48}DayRttMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Mean A03 S02 {p_end}
{p 0 48}DayRttUpRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Upper A03 S02 {p_end}
{p 0 48}DayRttLoRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Lower A03 S03 {p_end}
{p 0 48}DayRttMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Mean A03 S03 {p_end}
{p 0 48}DayRttUpRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Upper A03 S03 {p_end}
{p 0 48}DayRttLoRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Lower A03 S04 {p_end}
{p 0 48}DayRttMeRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Mean A03 S04 {p_end}
{p 0 48}DayRttUpRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Upper A03 S04 {p_end}
{p 0 48}DayRttLoRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Lower A03 S05 {p_end}
{p 0 48}DayRttMeRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Mean A03 S05 {p_end}
{p 0 48}DayRttUpRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Upper A03 S05 {p_end}
{p 0 48}DayRttLoRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Lower A03 S06 {p_end}
{p 0 48}DayRttMeRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Mean A03 S06 {p_end}
{p 0 48}DayRttUpRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily R t Upper A03 S06 {p_end}
{p 0 48}DayIFRMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily IFR Mean A03 S01 {p_end}
{p 0 48}DayIFRLoRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily IFR Lower A03 S01 {p_end}
{p 0 48}DayIFRUpRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily IFR Upper A03 S01 {p_end}
{p 0 48}DayIFRMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily IFR Mean A03 S02 {p_end}
{p 0 48}DayIFRLoRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily IFR Lower A03 S02 {p_end}
{p 0 48}DayIFRUpRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily IFR Upper A03 S02 {p_end}
{p 0 48}DayIFRMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily IFR Mean A03 S03 {p_end}
{p 0 48}DayIFRLoRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily IFR Lower A03 S03 {p_end}
{p 0 48}DayIFRUpRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily IFR Upper A03 S03 {p_end}
{p 0 48}DayIFRMeRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily IFR Mean A03 S04 {p_end}
{p 0 48}DayIFRLoRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily IFR Lower A03 S04 {p_end}
{p 0 48}DayIFRUpRaA03S04{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily IFR Upper A03 S04 {p_end}
{p 0 48}DayIFRMeRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily IFR Mean A03 S05 {p_end}
{p 0 48}DayIFRLoRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily IFR Lower A03 S05 {p_end}
{p 0 48}DayIFRUpRaA03S05{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily IFR Upper A03 S05 {p_end}
{p 0 48}DayIFRMeRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily IFR Mean A03 S06 {p_end}
{p 0 48}DayIFRLoRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily IFR Lower A03 S06 {p_end}
{p 0 48}DayIFRUpRaA03S06{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily IFR Upper A03 S06 {p_end}
{p 0 48}DayDeMMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths mean IMPE DayDeM{p_end}
{p 0 48}DayCaMMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections mean IMPE DayCaM{p_end}
{p 0 48}DayCbDMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections mean div by daily deaths mean IMPE DayCbD{p_end}
{p 0 48}DayDMuMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths scaled (times means of infections by deaths) IMPE{p_end}
{p 0 48}TotCasUpRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Upper SRIV{p_end}
{p 0 48}TotDeaMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Mean SRIV{p_end}
{p 0 48}TotDeaLoRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Lower SRIV{p_end}
{p 0 48}TotDeaUpRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths Upper SRIV{p_end}
{p 0 48}TotCasMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Mean SRIV{p_end}
{p 0 48}TotCasLoRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Total Cases Lower SRIV{p_end}
{p 0 48}DayDeaMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Mean SRIV{p_end}
{p 0 48}DayDeaLoRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Lower SRIV{p_end}
{p 0 48}DayDeaUpRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: int     }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths Upper SRIV{p_end}
{p 0 48}DayCasMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Mean SRIV{p_end}
{p 0 48}DayCasLoRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Lower SRIV{p_end}
{p 0 48}DayCasUpRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases Upper SRIV{p_end}
{p 0 48}DayCfrMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Mean SRIV{p_end}
{p 0 48}DayCfrLoRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Lower SRIV{p_end}
{p 0 48}DayCfrUpRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily CFR Upper SRIV{p_end}
{p 0 48}DayDeMMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths mean SRIV  DayDeM{p_end}
{p 0 48}DayCaMMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases mean SRIV  DayCaM{p_end}
{p 0 48}DayCbDMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily cases mean div by daily deaths mean SRIV  DayCbD{p_end}
{p 0 48}DayDMuMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily deaths scaled (times means of cases by deaths) SRIV {p_end}
{p 0 48}DayCTDMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases to Deaths S0 JOHN{p_end}
{p 0 48}TotCTDMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases to Deaths S0 JOHN{p_end}
{p 0 48}DayCTDMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases to Deaths S0 DELP{p_end}
{p 0 48}TotCTDMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases to Deaths S0 DELP{p_end}
{p 0 48}DayITDMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections to Deaths S1 IHME{p_end}
{p 0 48}TotITDMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections to Deaths S1 IHME{p_end}
{p 0 48}DayITDMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections to Deaths S2 IHME{p_end}
{p 0 48}TotITDMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections to Deaths S2 IHME{p_end}
{p 0 48}DayITDMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections to Deaths S3 IHME{p_end}
{p 0 48}TotITDMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections to Deaths S3 IHME{p_end}
{p 0 48}DayITDMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections to Deaths S1 IMPE{p_end}
{p 0 48}TotITDMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections to Deaths S1 IMPE{p_end}
{p 0 48}DayITDMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections to Deaths S2 IMPE{p_end}
{p 0 48}TotITDMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections to Deaths S2 IMPE{p_end}
{p 0 48}DayITDMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections to Deaths S3 IMPE{p_end}
{p 0 48}TotITDMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections to Deaths S3 IMPE{p_end}
{p 0 48}DayCTDMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases to Deaths S0 SRIV{p_end}
{p 0 48}TotCTDMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases to Deaths S0 SRIV{p_end}
{p 0 48}DayDERMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported JOHN = 1{p_end}
{p 0 48}DayDERMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported Mean DELP S0{p_end}
{p 0 48}DayDERMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported Mean smoothed IHME S1{p_end}
{p 0 48}DayDERMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported Mean smoothed IHME S2{p_end}
{p 0 48}DayDERMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported Mean smoothed IHME S3{p_end}
{p 0 48}DayDERMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported Mean S1 IMPE{p_end}
{p 0 48}DayDERMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported Mean S2 IMPE{p_end}
{p 0 48}DayDERMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported Mean S3 IMPE{p_end}
{p 0 48}DayDERMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Deaths estim to reported S0 SRIV{p_end}
{p 0 48}DayCERMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases estim to reported JOHN = 1{p_end}
{p 0 48}DayCERMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases estim to reported Mean DELP S0{p_end}
{p 0 48}DayIERMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections estim to reported cases Mean smoothed IHME S1{p_end}
{p 0 48}DayIERMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections estim to reported cases Mean smoothed IHME S2{p_end}
{p 0 48}DayIERMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections estim to reported cases Mean smoothed IHME S3{p_end}
{p 0 48}DayIERMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections estim to reported cases Mean S1 IMPE{p_end}
{p 0 48}DayIERMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections estim to reported cases Mean S2 IMPE{p_end}
{p 0 48}DayIERMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily infections estim to reported cases Mean S3 IMPE{p_end}
{p 0 48}DayCERMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Daily Cases estim to reported S0 SRIV{p_end}
{p 0 48}TotDERMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported JOHN = 1{p_end}
{p 0 48}TotDERMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported Mean DELP S0{p_end}
{p 0 48}TotDERMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported Mean smoothed IHME S1{p_end}
{p 0 48}TotDERMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported Mean smoothed IHME S2{p_end}
{p 0 48}TotDERMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported Mean smoothed IHME S3{p_end}
{p 0 48}TotDERMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported Mean S1 IMPE{p_end}
{p 0 48}TotDERMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported Mean S2 IMPE{p_end}
{p 0 48}TotDERMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported Mean S3 IMPE{p_end}
{p 0 48}TotDERMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Deaths estim to reported S0 SRIV{p_end}
{p 0 48}TotCERMeRaA00S00{p_end}
{p 0 48}{space 15}{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases estim to reported JOHN = 1{p_end}
{p 0 48}TotCERMeRaA01S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases estim to reported Mean DELP S0{p_end}
{p 0 48}TotIERMeSmA02S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections estim to reported cases Mean smoothed IHME S1{p_end}
{p 0 48}TotIERMeSmA02S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections estim to reported cases Mean smoothed IHME S2{p_end}
{p 0 48}TotIERMeSmA02S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections estim to reported cases Mean smoothed IHME S3{p_end}
{p 0 48}TotIERMeRaA03S01{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections estim to reported cases Mean S1 IMPE{p_end}
{p 0 48}TotIERMeRaA03S02{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections estim to reported cases Mean S2 IMPE{p_end}
{p 0 48}TotIERMeRaA03S03{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total infections estim to reported cases Mean S3 IMPE{p_end}
{p 0 48}TotCERMeRaA05S00{p_end}
{p 0 48}{space 15}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Total Cases estim to reported S0 SRIV{p_end}
{txt}{hline}
Sorted by: {res}date  loc_grand_name
{txt}
{com}.  
. 
. 
.  
. ***************
. 
. ***************
. 
. * graphs 
. 
. 
. grstyle init
{res}{txt}
{com}. 
. grstyle color background white
{txt}
{com}. 
. 
. summ date 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}date {c |}{res}        796     22279.5    229.9297      21882      22677
{txt}
{com}. 
. gen datemax = r(max)
{txt}
{com}. 
. gen datesince01jan2020 = datemax - td(01jan2020)
{txt}
{com}. 
. gen monthssince01jan2020 = datesince01jan2020 / 30
{txt}
{com}. 
. replace monthssince01jan2020 = (ceil(monthssince01jan2020))
{txt}(796 real changes made)

{com}. 
. global yticknalltime = monthssince01jan2020
{txt}
{com}. 
. 
. gen datesince01jan2021 = datemax - td(01jan2021)
{txt}
{com}. 
. gen monthssince01jan2021 = datesince01jan2021 / 30
{txt}
{com}. 
. replace monthssince01jan2021 = (ceil(monthssince01jan2021))
{txt}(796 real changes made)

{com}. 
. global ytickn2021 = monthssince01jan2021
{txt}
{com}. 
. 
. ******************
. 
. *****************
. 
. * daily deaths (graph numbers start w/ 11)
. 
. 
. 
. ****
. * daily deaths, reference scenarios, all time
. 
. twoway ///
> (line DayDeaMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(medium) lpattern(tight_dot)) /// 1 "JOHN raw"
> (line DayDeaMeSmA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 2 "JOHN smooth"
> (line DayDeaMeRaA01S00 date, sort lcolor(red)) /// 3 "DELP"
> (line DayDeaMeSmA02S01 date, sort lcolor(black)) /// 4 "IHME"
> (line DayDeaMeRaA03S02 date, sort lcolor(magenta)) /// 5 "IMPE"
> (line DayDeaMeRaA05S00 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$yticknalltime, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, global, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN raw" 2 "JOHN smooth" 3 "DELP" 4 "IHME" 5 "IMPE" 6 "SRIV") size(small) row(2)) ///
> subtitle("  .", size(small) color(white)) 
{res}{txt}
{com}. 
. graph save "graph 11a COVID-19 daily deaths, global, reference scenarios, all time.gph", replace
{txt}(note: file graph 11a COVID-19 daily deaths, global, reference scenarios, all time.gph not found)
{res}{txt}(file graph 11a COVID-19 daily deaths, global, reference scenarios, all time.gph saved)

{com}. graph export "graph 11a COVID-19 daily deaths, global, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 11a COVID-19 daily deaths, global, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. ****
. * daily deaths, reference scenarios, all time, with IHME excess deaths
. 
. twoway ///
> (line DayDeaMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(medium) lpattern(tight_dot)) /// 1 "JOHN raw"
> (line DayDeaMeSmA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 2 "JOHN smooth"
> (line DayDeaMeRaA01S00 date, sort lcolor(red)) /// 3 "DELP"
> (line DayDeaMeSmA02S01 date, sort lcolor(black)) /// 4 "IHME"
> (line DayDeXMeSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 5 "IHME"
> (line DayDeaMeRaA03S02 date, sort lcolor(magenta)) /// 6 "IMPE"
> (line DayDeaMeRaA05S00 date, sort lcolor(green)) /// 7 "SRIV"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$yticknalltime, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, global, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN raw" 2 "JOHN smooth" 3 "DELP" 4 "IHME" 5 "IHME excess" 6 "IMPE" 7 "SRIV") size(small) row(2)) ///
> subtitle("  .", size(small) color(white)) 
{res}{txt}
{com}. 
. graph save "graph 11b COVID-19 daily deaths, global, reference scenarios, all time with IHME excess deaths.gph", replace
{txt}(note: file graph 11b COVID-19 daily deaths, global, reference scenarios, all time with IHME excess deaths.gph not found)
{res}{txt}(file graph 11b COVID-19 daily deaths, global, reference scenarios, all time with IHME excess deaths.gph saved)

{com}. graph export "graph 11b COVID-19 daily deaths, global, reference scenarios, all time with IHME excess deaths.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 11b COVID-19 daily deaths, global, reference scenarios, all time with IHME excess deaths.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * daily deaths, reference scenarios, 2021
. 
. 
. twoway ///
> (line DayDeaMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(medium) lpattern(tight_dot)) /// 1 "JOHN raw"
> (line DayDeaMeSmA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 2 "JOHN smooth"
> (line DayDeaMeRaA01S00 date, sort lcolor(red)) /// 3 "DELP"
> (line DayDeaMeSmA02S01 date, sort lcolor(black)) /// 4 "IHME"
> (line DayDeaMeRaA03S02 date, sort lcolor(magenta)) /// 5 "IMPE"
> (line DayDeaMeRaA05S00 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(01jan2021)  ///
> , xtitle(Date) xlabel(#$ytickn2021, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, global, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN raw" 2 "JOHN smooth" 3 "DELP" 4 "IHME" 5 "IMPE" 6 "SRIV") size(small) row(2)) ///
> subtitle("after 2021-01-01", size(small))
{res}{txt}
{com}. 
. graph save "graph 12a COVID-19 daily deaths, global, reference scenarios, 2021.gph", replace
{txt}(note: file graph 12a COVID-19 daily deaths, global, reference scenarios, 2021.gph not found)
{res}{txt}(file graph 12a COVID-19 daily deaths, global, reference scenarios, 2021.gph saved)

{com}. graph export "graph 12a COVID-19 daily deaths, global, reference scenarios, 2021.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 12a COVID-19 daily deaths, global, reference scenarios, 2021.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * daily deaths, reference scenarios, 2021
. 
. twoway ///
> (line DayDeaMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(medium) lpattern(tight_dot)) /// 1 "JOHN raw"
> (line DayDeaMeSmA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 2 "JOHN smooth"
> (line DayDeaMeRaA01S00 date, sort lcolor(red)) /// 3 "DELP"
> (line DayDeaMeSmA02S01 date, sort lcolor(black)) /// 4 "IHME"
> (line DayDeXMeSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 5 "IHME"
> (line DayDeaMeRaA03S02 date, sort lcolor(magenta)) /// 6 "IMPE"
> (line DayDeaMeRaA05S00 date, sort lcolor(green)) /// 7 "SRIV"
> if date >= td(01jan2021)  ///
> , xtitle(Date) xlabel(#$ytickn2021, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, global, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN raw" 2 "JOHN smooth" 3 "DELP" 4 "IHME" 5 "IHME excess" 6 "IMPE" 7 "SRIV") size(small) row(2)) ///
> subtitle("after 2021-01-01", size(small))
{res}{txt}
{com}. 
. graph save "graph 12b COVID-19 daily deaths, global, reference scenarios, 2021 with IHME excess deaths.gph", replace
{txt}(note: file graph 12b COVID-19 daily deaths, global, reference scenarios, 2021 with IHME excess deaths.gph not found)
{res}{txt}(file graph 12b COVID-19 daily deaths, global, reference scenarios, 2021 with IHME excess deaths.gph saved)

{com}. graph export "graph 12b COVID-19 daily deaths, global, reference scenarios, 2021 with IHME excess deaths.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 12b COVID-19 daily deaths, global, reference scenarios, 2021 with IHME excess deaths.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. ****
. * daily deaths, reference scenarios, 2021, uncertainty
. 
. twoway ///
> (line DayDeaMeSmA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN smooth"
> (line DayDeaMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP" mean
> (line DayDeaLoRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 3 "DELP" lower
> (line DayDeaUpRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 4 "DELP" upper
> (line DayDeaMeSmA02S01 date, sort lcolor(black)) /// 5 IHME mean
> (line DayDeaLoSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 6 IHME lower
> (line DayDeaUpSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 7 IHME upper
> (line DayDeaMeRaA03S02 date, sort lcolor(magenta)) /// 8 IMPE mean
> (line DayDeaLoRaA03S02 date, sort lcolor(magenta) lpattern(dash)) /// 9 IMPE lower
> (line DayDeaUpRaA03S02 date, sort lcolor(magenta) lpattern(dash)) /// 10 IMPE upper
> (line DayDeaMeRaA05S00 date, sort lcolor(green)) /// 11 "SRIV" mean
> (line DayDeaLoRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 12 "SRIV" lower
> (line DayDeaUpRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 13 "SRIV" upper
> if date >= td(01jan2021)  ///
> , xtitle(Date) xlabel(#$ytickn2021, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, global, reference scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN smooth" 2 "DELP" 5 "IHME" 8 "IMPE" 11 "SRIV") size(small) row(2)) ///
> subtitle("after 2021-01-01, w/ uncertainty", size(small)) ///
> note("Uncertainty limits: dashed curves") 
{res}{txt}
{com}. 
. graph save "graph 13 COVID-19 daily deaths, global, reference scenarios, 2021, uncertainty.gph", replace
{txt}(note: file graph 13 COVID-19 daily deaths, global, reference scenarios, 2021, uncertainty.gph not found)
{res}{txt}(file graph 13 COVID-19 daily deaths, global, reference scenarios, 2021, uncertainty.gph saved)

{com}. graph export "graph 13 COVID-19 daily deaths, global, reference scenarios, 2021, uncertainty.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 13 COVID-19 daily deaths, global, reference scenarios, 2021, uncertainty.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * daily deaths, 3 scenarios, 2021
. 
. twoway ///
> (line DayDeaMeSmA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN smooth"
> (line DayDeaMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP" mean
> (line DayDeaMeSmA02S01 date, sort lcolor(black)) /// 3 IHME mean, reference scenario
> (line DayDeaMeSmA02S02 date, sort lcolor(black) lwidth(thick) lpattern(tight_dot)) /// 4 IHME mean, better scenario
> (line DayDeaMeSmA02S03 date, sort lcolor(black) lwidth(thick) lpattern(tight_dot)) /// 5 IHME mean, worse scenario
> (line DayDeaMeRaA03S02 date, sort lcolor(magenta)) /// 6 IMPE mean, reference scenario
> (line DayDeaMeRaA03S01 date, sort lcolor(magenta) lwidth(thick) lpattern(tight_dot)) /// 7 IMPE mean, better scenario
> (line DayDeaMeRaA03S03 date, sort lcolor(magenta) lwidth(thick) lpattern(tight_dot)) /// 8 IMPE mean, worse scenario
> (line DayDeaMeRaA05S00 date, sort lcolor(green)) /// 9 "SRIV" mean
> if date >= td(01jan2021)  ///
> , xtitle(Date) xlabel(#$ytickn2021, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, global, 3 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN smooth" 2 "DELP" 3 "IHME" 6 "IMPE" 9 "SRIV") size(small) row(2)) ///
> subtitle("after 2021-01-01", size(small)) ///
> note("Better and worse scenarios: tight dot (|||||) curves; IHME and IMPE") 
{res}{txt}
{com}. 
. graph save "graph 14 COVID-19 daily deaths, global, 3 scenarios, 2021.gph", replace
{txt}(note: file graph 14 COVID-19 daily deaths, global, 3 scenarios, 2021.gph not found)
{res}{txt}(file graph 14 COVID-19 daily deaths, global, 3 scenarios, 2021.gph saved)

{com}. graph export "graph 14 COVID-19 daily deaths, global, 3 scenarios, 2021.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 14 COVID-19 daily deaths, global, 3 scenarios, 2021.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * daily deaths, reference scenario, uncertainty, 2021, IHME 
. 
. twoway ///
> (line DayDeaMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(medium) lpattern(tight_dot)) /// 1 "JOHN raw"
> (line DayDeaMeSmA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 2 "JOHN smooth"
> (line DayDeaMeSmA02S01 date, sort lcolor(black)) /// 3 IHME reference mean
> (line DayDeaLoSmA02S01 date, sort lcolor(green) lpattern(dash)) /// 4 IHME reference lower
> (line DayDeaUpSmA02S01 date, sort lcolor(red) lpattern(dash)) /// 5 IHME reference upper
> if date >= td(01jan2021)  ///
> , xtitle(Date) xlabel(#$ytickn2021, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, global, reference scenario w/ uncertainty, IHME", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN raw" 2 "JOHN smooth" 3 "IHME mean" 4 "IHME lower" ///
> 5 "IHME upper") size(small) row(2)) ///
> subtitle("after 2021-01-01", size(small)) ///
> note("Uncertainty limits: dashed (– – –) curves")
{res}{txt}
{com}. 
. graph save "graph 15 COVID-19 daily deaths, global, reference scenario, uncertainty, 2021, IHME.gph", replace
{txt}(note: file graph 15 COVID-19 daily deaths, global, reference scenario, uncertainty, 2021, IHME.gph not found)
{res}{txt}(file graph 15 COVID-19 daily deaths, global, reference scenario, uncertainty, 2021, IHME.gph saved)

{com}. graph export "graph 15 COVID-19 daily deaths, global, reference scenario, uncertainty, 2021, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 15 COVID-19 daily deaths, global, reference scenario, uncertainty, 2021, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * daily deaths, 3 scenarios, uncertainty, 2021, IHME 
. 
. twoway ///
> (line DayDeaMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(medium) lpattern(tight_dot)) /// 1 "JOHN raw"
> (line DayDeaMeSmA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 2 "JOHN smooth"
> (line DayDeaMeSmA02S01 date, sort lcolor(black)) /// 3 IHME reference mean
> (line DayDeaMeSmA02S02 date, sort lcolor(green) lwidth(thick) lpattern(tight_dot)) /// 4 IHME best mean
> (line DayDeaMeSmA02S03 date, sort lcolor(red) lwidth(thick) lpattern(tight_dot)) /// 5 IHME worse mean
> (line DayDeaUpSmA02S03 date, sort lcolor(red) lpattern(dash)) /// 6 IHME worse upper
> if date >= td(01jan2021)  ///
> , xtitle(Date) xlabel(#$ytickn2021, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, global, 3 scenarios, IHME", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN raw" 2 "JOHN smooth" 3 "IHME reference" 4 " IHME best" ///
> 5 "IHME worse" 6 "IHME worse upper") size(small) row(2)) ///
> subtitle("after 2021-01-01", size(small)) ///
> note("Better and worse scenarios: tight dot (|||||) curves; Uncertainty limits: dashed (– – –) curves") 
{res}{txt}
{com}. 
. graph save "graph 16 COVID-19 daily deaths, global, 3 scenarios, uncertainty, 2021, IHME.gph", replace
{txt}(note: file graph 16 COVID-19 daily deaths, global, 3 scenarios, uncertainty, 2021, IHME.gph not found)
{res}{txt}(file graph 16 COVID-19 daily deaths, global, 3 scenarios, uncertainty, 2021, IHME.gph saved)

{com}. graph export "graph 16 COVID-19 daily deaths, global, 3 scenarios, uncertainty, 2021, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 16 COVID-19 daily deaths, global, 3 scenarios, uncertainty, 2021, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * daily deaths, reference scenario, uncertainty, 2021, IMPE 
. 
. twoway ///
> (line DayDeaMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(medium) lpattern(tight_dot)) /// 1 "JOHN raw"
> (line DayDeaMeSmA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 2 "JOHN smooth"
> (line DayDeaMeRaA03S02 date, sort lcolor(black)) /// 3 IMPE reference mean
> (line DayDeaLoRaA03S02 date, sort lcolor(green) lpattern(dash)) /// 4 IMPE reference lower
> (line DayDeaUpRaA03S02 date, sort lcolor(red) lpattern(dash)) /// 5 IMPE reference upper
> if date >= td(01jan2021)  ///
> , xtitle(Date) xlabel(#$ytickn2021, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, global, reference scenario w/ uncertainty, IMPE", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN raw" 2 "JOHN smooth" 3 "IMPE mean" 4 "IMPE lower" 5 "IMPE upper") size(small) row(2)) ///
> subtitle("after 2021-01-01", size(small)) ///
> note("Uncertainty limits: dashed (– – –) curves") 
{res}{txt}
{com}. 
. graph save "graph 17 COVID-19 daily deaths, global, reference scenario, uncertainty, 2021, IMPE.gph", replace
{txt}(note: file graph 17 COVID-19 daily deaths, global, reference scenario, uncertainty, 2021, IMPE.gph not found)
{res}{txt}(file graph 17 COVID-19 daily deaths, global, reference scenario, uncertainty, 2021, IMPE.gph saved)

{com}. graph export "graph 17 COVID-19 daily deaths, global, reference scenario, uncertainty, 2021, IMPE.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 17 COVID-19 daily deaths, global, reference scenario, uncertainty, 2021, IMPE.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * daily deaths, 3 scenarios, uncertainty, 2021, IMPE 
. 
. twoway ///
> (line DayDeaMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(medium) lpattern(tight_dot)) /// 1 "JOHN raw"
> (line DayDeaMeSmA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 2 "JOHN smooth"
> (line DayDeaMeRaA03S02 date, sort lcolor(black)) /// 3 IMPE reference mean
> (line DayDeaMeRaA03S01 date, sort lcolor(green) lwidth(thick) lpattern(tight_dot)) /// 4 IMPE better mean
> (line DayDeaMeRaA03S03 date, sort lcolor(red) lwidth(thick) lpattern(tight_dot)) /// 5 IMPE worse mean
> (line DayDeaUpRaA03S03 date, sort lcolor(red) lpattern(dash)) /// 6 IMPE worse upper
> if date >= td(01jan2021)  ///
> , xtitle(Date) xlabel(#$ytickn2021, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, global, 3 scenarios, IMPE", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN raw" 2 "JOHN smooth" 3 "IMPE reference" 4 "IMPE better" 5 "IMPE worse" ///
> 6 "IMPE worse upper") size(small) row(3)) ///
> subtitle("after 2021-01-01", size(small)) ///
> note("Better and worse scenarios: tight dot (|||||) curves; Uncertainty limits: dashed (– – –) curves") 
{res}{txt}
{com}. 
. graph save "graph 18 COVID-19 daily deaths, global, 3 scenarios, uncertainty, 2021, IMPE.gph", replace
{txt}(note: file graph 18 COVID-19 daily deaths, global, 3 scenarios, uncertainty, 2021, IMPE.gph not found)
{res}{txt}(file graph 18 COVID-19 daily deaths, global, 3 scenarios, uncertainty, 2021, IMPE.gph saved)

{com}. graph export "graph 18 COVID-19 daily deaths, global, 3 scenarios, uncertainty, 2021, IMPE.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 18 COVID-19 daily deaths, global, 3 scenarios, uncertainty, 2021, IMPE.pdf written in PDF format)

{com}. 
. 
. 
. 
. ***********************
. 
. * Daily cases or infections (graph numbers start w/ 21)
. 
. 
. 
. ****
. * daily cases or infections, reference scenarios, all time
. 
. twoway ///
> (line DayDeaMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN raw"
> (line DayCasMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayINFMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayINFMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayCasMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$yticknalltime, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections) title("COVID-19 daily cases or infections, global, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections" 4 "IMPE infections" ///
> 5 "SRIV cases" ) size(small) row(2)) ///
> subtitle("  .", size(small) color(white)) 
{res}{txt}
{com}. 
. graph save "graph 21 COVID-19 daily cases, global, reference scenarios.gph", replace
{txt}(note: file graph 21 COVID-19 daily cases, global, reference scenarios.gph not found)
{res}{txt}(file graph 21 COVID-19 daily cases, global, reference scenarios.gph saved)

{com}. graph export "graph 21 COVID-19 daily cases, global, reference scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 21 COVID-19 daily cases, global, reference scenarios.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * daily cases or infections, reference scenarios, 2021
. 
. twoway ///
> (line DayCasMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN"
> (line DayCasMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayINFMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayINFMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayCasMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$ytickn2021, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections) title("COVID-19 daily cases or infections, global, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections" 4 "IMPE infections" ///
> 5 "SRIV cases" ) size(small) row(2)) ///
> subtitle("after 2021-01-01", size(small)) 
{res}{txt}
{com}. 
. graph save "graph 22 COVID-19 daily cases, global, reference scenarios, 2021.gph", replace
{txt}(note: file graph 22 COVID-19 daily cases, global, reference scenarios, 2021.gph not found)
{res}{txt}(file graph 22 COVID-19 daily cases, global, reference scenarios, 2021.gph saved)

{com}. graph export "graph 22 COVID-19 daily cases, global, reference scenarios, 2021.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 22 COVID-19 daily cases, global, reference scenarios, 2021.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * daily cases, reference scenarios, 2021
. 
. twoway ///
> (line DayCasMeRaA00S00 date, sort lcolor(cyan) lwidth(medium)) /// 1 "JOHN"
> (line DayCasMeSmA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 2 "JOHN"
> (line DayCasMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayCasMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$ytickn2021, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, global, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases raw" 2 "JOHN cases smooth" 3 "DELP cases" 4 "SRIV cases") size(small) row(2)) ///
> subtitle("after 2021-01-01", size(small)) 
{res}{txt}
{com}. 
. graph save "graph 22b COVID-19 daily cases, global, reference scenarios, 2021.gph", replace
{txt}(note: file graph 22b COVID-19 daily cases, global, reference scenarios, 2021.gph not found)
{res}{txt}(file graph 22b COVID-19 daily cases, global, reference scenarios, 2021.gph saved)

{com}. graph export "graph 22b COVID-19 daily cases, global, reference scenarios, 2021.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 22b COVID-19 daily cases, global, reference scenarios, 2021.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * daily cases or infections, reference scenario, 2021, uncertainty 
. 
. twoway ///
> (line DayCasMeSmA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 JOHN
> (line DayCasMeRaA01S00 date, sort lcolor(red)) /// 2 DELP mean
> (line DayCasLoRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 3 DELP lower
> (line DayCasUpRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 4 DELP upper
> (line DayINFMeSmA02S01 date, sort lcolor(black)) /// 5 IHME mean
> (line DayINFLoSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 6 IHME lower
> (line DayINFUpSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 7 IHME upper
> (line DayINFMeRaA03S02 date, sort lcolor(magenta)) /// 8 IMPE mean
> (line DayINFLoRaA03S02 date, sort lcolor(magenta) lpattern(dash)) /// 9 IMPE lower
> (line DayINFUpRaA03S02 date, sort lcolor(magenta) lpattern(dash)) /// 10 IMPE upper
> (line DayCasMeRaA05S00 date, sort lcolor(green)) /// 11 "SRIV" mean
> (line DayCasLoRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 12 "SRIV" lower
> (line DayCasUpRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 13 "SRIV" upper
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$ytickn2021, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections) title("COVID-19 daily cases or infections, global, reference scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 5 "IHME infections" 8 ///
> "IMPE infections" 11 "SRIV cases") size(small) row(2)) ///
> note("Uncertainty limits: dashed curves") ///
> subtitle("after 2021-01-01, w/ uncertainty", size(small))
{res}{txt}
{com}. 
. graph save "graph 23 COVID-19 daily cases, global, reference scenarios, 2021, uncertainty.gph", replace
{txt}(note: file graph 23 COVID-19 daily cases, global, reference scenarios, 2021, uncertainty.gph not found)
{res}{txt}(file graph 23 COVID-19 daily cases, global, reference scenarios, 2021, uncertainty.gph saved)

{com}. graph export "graph 23 COVID-19 daily cases, global, reference scenarios, 2021, uncertainty.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 23 COVID-19 daily cases, global, reference scenarios, 2021, uncertainty.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * daily cases or infections, 3 scenarios, 2021
. 
. twoway ///
> (line DayCasMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 JOHN
> (line DayCasMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP" mean
> (line DayINFMeSmA02S01 date, sort lcolor(black)) /// 3 IHME mean, reference scenario
> (line DayINFMeSmA02S02 date, sort lcolor(black) lwidth(thick) lpattern(tight_dot)) /// 4 IHME mean, better scenario
> (line DayINFMeSmA02S03 date, sort lcolor(black) lwidth(thick) lpattern(tight_dot)) /// 5 IHME mean, worse scenario
> (line DayINFMeRaA03S02 date, sort lcolor(magenta)) /// 6 IMPE mean, reference scenario
> (line DayINFMeRaA03S01 date, sort lcolor(magenta) lwidth(thick) lpattern(tight_dot)) /// 7 IMPE mean, better scenario
> (line DayINFMeRaA03S03 date, sort lcolor(magenta) lwidth(thick) lpattern(tight_dot)) /// 8 IMPE mean, worse scenario
> (line DayCasMeRaA05S00 date, sort lcolor(green)) /// 9 "SRIV" mean
> if date >= td(01jan2021)  ///
> , xtitle(Date) xlabel(#$ytickn2021, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases or infections) title("COVID-19 daily cases or infections, global, 3 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections" 6 ///
> "IMPE infections" 9 "SRIV cases") size(small) row(2)) ///
> subtitle("after 2021-01-01", size(small)) ///
> note("Better and worse scenarios: tight dot (|||||) curves; IHME and IMPE") 
{res}{txt}
{com}. 
. graph save "graph 24 COVID-19 daily cases, global, 3 scenarios, 2021, uncertainty.gph", replace
{txt}(note: file graph 24 COVID-19 daily cases, global, 3 scenarios, 2021, uncertainty.gph not found)
{res}{txt}(file graph 24 COVID-19 daily cases, global, 3 scenarios, 2021, uncertainty.gph saved)

{com}. graph export "graph 24 COVID-19 daily cases, global, 3 scenarios, 2021, uncertainty.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 24 COVID-19 daily cases, global, 3 scenarios, 2021, uncertainty.pdf written in PDF format)

{com}. 
. 
. 
. 
. *****************
. 
. * total deaths (graph numbers start w/ 31)
. 
. 
. ****
. * total deaths, reference scenarios, all time
. 
. twoway ///
> (line TotDeaMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN"
> (line TotDeaMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotDeaMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotDeaMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line TotDeaMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$yticknalltime, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, global, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "SRIV") size(small) row(1)) ///
> subtitle("  .", size(small) color(white))
{res}{txt}
{com}. 
. graph save "graph 31a COVID-19 total deaths, global, reference scenarios, all time.gph", replace
{txt}(note: file graph 31a COVID-19 total deaths, global, reference scenarios, all time.gph not found)
{res}{txt}(file graph 31a COVID-19 total deaths, global, reference scenarios, all time.gph saved)

{com}. graph export "graph 31a COVID-19 total deaths, global, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 31a COVID-19 total deaths, global, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. ****
. * total deaths, reference scenarios, all time, with IHME excess mortality 
. 
. twoway ///
> (line TotDeaMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN"
> (line TotDeaMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotDeaMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotDeXMeSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 4 "IHME"
> (line TotDeaMeRaA03S02 date, sort lcolor(magenta)) /// 5 "IMPE"
> (line TotDeaMeRaA05S00 date, sort lcolor(green)) /// 6 "SRIV"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$yticknalltime, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, global, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IHME excess" 5 "IMPE" 6 "SRIV") size(small) row(2)) ///
> subtitle("  .", size(small) color(white))
{res}{txt}
{com}. 
. graph save "graph 31b COVID-19 total deaths, global, reference scenarios, all time.gph", replace
{txt}(note: file graph 31b COVID-19 total deaths, global, reference scenarios, all time.gph not found)
{res}{txt}(file graph 31b COVID-19 total deaths, global, reference scenarios, all time.gph saved)

{com}. graph export "graph 31b COVID-19 total deaths, global, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 31b COVID-19 total deaths, global, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. ****
. * total deaths, reference scenarios, 2021
. 
. twoway ///
> (line TotDeaMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN"
> (line TotDeaMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotDeaMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotDeaMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line TotDeaMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$ytickn2021, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, global, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "SRIV") size(small) row(1)) ///
> subtitle("after 2021-01-01", size(small))
{res}{txt}
{com}. 
. graph save "graph 32 COVID-19 total deaths, global, reference scenarios, 2021.gph", replace
{txt}(note: file graph 32 COVID-19 total deaths, global, reference scenarios, 2021.gph not found)
{res}{txt}(file graph 32 COVID-19 total deaths, global, reference scenarios, 2021.gph saved)

{com}. graph export "graph 32 COVID-19 total deaths, global, reference scenarios, 2021.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 32 COVID-19 total deaths, global, reference scenarios, 2021.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * total deaths, reference scenarios, 2021, uncertainty 
. 
. twoway ///
> (line TotDeaMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 JOHN
> (line TotDeaMeRaA01S00 date, sort lcolor(red)) /// 2 DELP mean
> (line TotDeaLoRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 3 DELP lower
> (line TotDeaUpRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 4 DELP upper
> (line TotDeaMeSmA02S01 date, sort lcolor(black)) /// 5 IHME mean
> (line TotDeaLoSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 6 IHME lower
> (line TotDeaUpSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 7 IHME upper
> (line TotDeaMeRaA03S02 date, sort lcolor(magenta)) /// 8 IMPE mean
> (line TotDeaLoRaA03S02 date, sort lcolor(magenta) lpattern(dash)) /// 9 IMPE lower
> (line TotDeaUpRaA03S02 date, sort lcolor(magenta) lpattern(dash)) /// 10 IMPE upper
> (line TotDeaMeRaA05S00 date, sort lcolor(green)) /// 11 "SRIV" mean
> (line TotDeaLoRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 12 "SRIV" lower
> (line TotDeaUpRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 13 "SRIV" upper
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$ytickn2021, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, global, reference scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 5 "IHME" 8 "IMPE" 11 "SRIV") size(small) row(1)) ///
> note("Uncertainty limits: dashed curves") ///
> subtitle("after 2021-01-01, w/ uncertainty", size(small))
{res}{txt}
{com}. 
. graph save "graph 33 COVID-19 total deaths, global, reference scenarios, 2021, uncertainty.gph", replace
{txt}(note: file graph 33 COVID-19 total deaths, global, reference scenarios, 2021, uncertainty.gph not found)
{res}{txt}(file graph 33 COVID-19 total deaths, global, reference scenarios, 2021, uncertainty.gph saved)

{com}. graph export "graph 33 COVID-19 total deaths, global, reference scenarios, 2021, uncertainty.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 33 COVID-19 total deaths, global, reference scenarios, 2021, uncertainty.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. *****************
. 
. * total cases or infections (graph numbers start w/ 41)
. 
. 
. 
. ****
. * total cases or infections, reference scenarios, all time
. 
. twoway ///
> (line TotCasMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN"
> (line TotCasMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotINFMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotINFMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line TotCasMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$yticknalltime, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases or infections) title("COVID-19 total cases or infections, global, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections" 4 "IMPE infections" ///
> 5 "SRIV cases") size(small) row(2)) ///
> subtitle("  .", size(small) color(white))
{res}{txt}
{com}. 
. graph save "graph 41 COVID-19 total cases, global, reference scenarios, all time.gph", replace
{txt}(note: file graph 41 COVID-19 total cases, global, reference scenarios, all time.gph not found)
{res}{txt}(file graph 41 COVID-19 total cases, global, reference scenarios, all time.gph saved)

{com}. graph export "graph 41 COVID-19 total cases, global, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 41 COVID-19 total cases, global, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * total cases or infections, reference scenarios, 2021
. 
. twoway ///
> (line TotCasMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN"
> (line TotCasMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotINFMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotINFMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line TotCasMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$ytickn2021, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases or infections) title("COVID-19 total cases or infections, global, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections" 4 "IMPE infections" ///
> 5 "SRIV cases") size(small) row(2)) ///
> subtitle("after 2021-01-01", size(small))
{res}{txt}
{com}. 
. graph save "graph 42 COVID-19 total cases, global, reference scenarios, 2021.gph", replace
{txt}(note: file graph 42 COVID-19 total cases, global, reference scenarios, 2021.gph not found)
{res}{txt}(file graph 42 COVID-19 total cases, global, reference scenarios, 2021.gph saved)

{com}. graph export "graph 42 COVID-19 total cases, global, reference scenarios, 2021.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 42 COVID-19 total cases, global, reference scenarios, 2021.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * total cases or infections, reference scenarios, 2021, uncertainty
. 
. twoway ///
> (line TotCasMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 JOHN
> (line TotCasMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotCasLoRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 3 "DELP"
> (line TotCasUpRaA01S00 date, sort lcolor(red) lpattern(dash)) /// 4 "DELP"
> (line TotINFMeSmA02S01 date, sort lcolor(black)) /// 5 IHME mean
> (line TotINFLoSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 6 IHME lower
> (line TotINFUpSmA02S01 date, sort lcolor(black) lpattern(dash)) /// 7 IHME upper
> (line TotINFMeRaA03S02 date, sort lcolor(magenta)) /// 8 IMPE mean
> (line TotINFLoRaA03S02 date, sort lcolor(magenta) lpattern(dash)) /// 9 IMPE lower
> (line TotINFUpRaA03S02 date, sort lcolor(magenta) lpattern(dash)) /// 10 IMPE upper
> (line TotCasMeRaA05S00 date, sort lcolor(green)) /// 11 "SRIV" mean
> (line TotCasMeRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 12 "SRIV" lower
> (line TotCasMeRaA05S00 date, sort lcolor(green) lpattern(dash)) /// 13 "SRIV" upper
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$ytickn2021, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases or infections) title("COVID-19 total cases or infections, global, reference scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 5 "IHME infections" 8 "IMPE infections" ///
> 11 "SRIV cases") size(small) row(2)) ///
> note("Uncertainty limits: dashed curves") ///
> subtitle("after 2021-01-01, w/ uncertainty", size(small))
{res}{txt}
{com}. 
. graph save "graph 43 COVID-19 total cases, global, reference scenarios, 2021, uncertainty.gph", replace
{txt}(note: file graph 43 COVID-19 total cases, global, reference scenarios, 2021, uncertainty.gph not found)
{res}{txt}(file graph 43 COVID-19 total cases, global, reference scenarios, 2021, uncertainty.gph saved)

{com}. graph export "graph 43 COVID-19 total cases, global, reference scenarios, 2021, uncertainty.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 43 COVID-19 total cases, global, reference scenarios, 2021, uncertainty.pdf written in PDF format)

{com}. 
. 
. 
. 
. *****************
. 
. * daily CFR or IFR (graph numbers start w/ 51)
. 
. ****
. * CFR or IFR  all studies, reference scenarios, all time
. 
. twoway ///
> (line DayCfrMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN"
> (line DayCfrMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line infection_fatality_A02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayIFRMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayCfrMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$yticknalltime, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR or IFR) title("COVID-19 daily CFR or IFR, global, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN CFR" 2 "DELP CFR" 3 "IHME IFR" 4 "IMPE IFR" ///
> 5 "SRIV CFR") size(small) row(2)) ///
> subtitle("  .", size(small) color(white))
{res}{txt}
{com}. 
. graph save "graph 51 COVID-19 daily CFR, global, reference scenarios, all time.gph", replace
{txt}(note: file graph 51 COVID-19 daily CFR, global, reference scenarios, all time.gph not found)
{res}{txt}(file graph 51 COVID-19 daily CFR, global, reference scenarios, all time.gph saved)

{com}. graph export "graph 51 COVID-19 daily CFR, global, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 51 COVID-19 daily CFR, global, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * CFR or IFR all studies, reference scenarios, 2021
. 
. twoway ///
> (line DayCfrMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN"
> (line DayCfrMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line infection_fatality_A02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayIFRMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayCfrMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$ytickn2021, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR or IFR) title("COVID-19 daily CFR or IFR, global, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN CFR" 2 "DELP CFR" 3 "IHME IFR" 4 "IMPE IFR" ///
> 5 "SRIV CFR") size(small) row(2)) ///
> subtitle("after 2021-01-01", size(small))
{res}{txt}
{com}. 
. graph save "graph 52 COVID-19 daily CFR, global, reference scenarios, 2021.gph", replace
{txt}(note: file graph 52 COVID-19 daily CFR, global, reference scenarios, 2021.gph not found)
{res}{txt}(file graph 52 COVID-19 daily CFR, global, reference scenarios, 2021.gph saved)

{com}. graph export "graph 52 COVID-19 daily CFR, global, reference scenarios, 2021.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 52 COVID-19 daily CFR, global, reference scenarios, 2021.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * CFR or IFR wo JOHN, reference scenarios, 2021, uncertainty
. 
. twoway ///
> (line DayCfrMeRaA01S00 date, sort lcolor(red)) /// 1 "DELP" mean
> (line DayCfrLoRaA01S00 date, sort lcolor(red*.3) lpattern(dash)) /// 2 "DELP" lower
> (line DayCfrUpRaA01S00 date, sort lcolor(red*.3) lpattern(dash)) /// 3 "DELP" upper
> (line infection_fatality_A02S01 date, sort lcolor(black)) /// 4 "IHME" mean
> (line DayIFRMeRaA03S02 date, sort lcolor(magenta)) /// 5 "IMPE" mean
> (line DayIFRLoRaA03S02 date, sort lcolor(magenta*.2) lpattern(dash)) /// 6 "IMPE" lower
> (line DayIFRUpRaA03S02 date, sort lcolor(magenta*.2) lpattern(dash)) /// 7 "IMPE" upper
> (line DayCfrMeRaA05S00 date, sort lcolor(green)) /// 8 "SRIV" mean
> (line DayCfrMeRaA05S00 date, sort lcolor(green*.2) lpattern(dash)) /// 9 "SRIV" lower
> (line DayCfrMeRaA05S00 date, sort lcolor(green*.2) lpattern(dash)) /// 10 "SRIV" upper
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$ytickn2021, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR or IFR) title("COVID-19 daily CFR or IFR, global, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "DELP CFR" 4 "IHME IFR" 5 "IMPE IFR" 8 "SRIV CFR") size(small) row(1)) ///
> note("Uncertainty limits: dashed light curves.") ///
> subtitle("after 2021-01-01, without JOHN, with uncertainty", size(small))
{res}{txt}
{com}. 
. graph save "graph 53 COVID-19 daily CFR, global, reference scenarios, reference scenarios, 2021, uncertainty.gph", replace
{txt}(note: file graph 53 COVID-19 daily CFR, global, reference scenarios, reference scenarios, 2021, uncertainty.gph not found)
{res}{txt}(file graph 53 COVID-19 daily CFR, global, reference scenarios, reference scenarios, 2021, uncertainty.gph saved)

{com}. graph export "graph 53 COVID-19 daily CFR, global, reference scenarios, reference scenarios, 2021, uncertainty.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 53 COVID-19 daily CFR, global, reference scenarios, reference scenarios, 2021, uncertainty.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. ************************
. 
. * other outcomes (graph numbers start w/ 61)
. 
. ****
. * daily hospital-related outcomes
. 
. twoway ///
> (line DayHosMeRaA01S00 date, sort lcolor(red)  lwidth(thick)) /// 1 DELP Hospitalized (Daily Cases Active Hospitalized Mean DELP S0)
> (line DayVenMeRaA01S00 date, sort lcolor(red) lpattern(dash)  lwidth(thick)) /// 2 DELP Ventilated (Daily Cases Active Ventilated Mean DELP S0)
> (line DayBedMeSmA02S01 date, sort lcolor(black)) /// 3 IHME Bed need (Daily Beds needed Mean IHME S1)
> (line DayIcuMeSmA02S01 date, sort lcolor(green)) /// 4 IHME ICU need (Daily ICU beds needed Mean IHME S1)
> (line DayAdmMeSmA02S01 date, sort lcolor(yellow)) /// 5 IHME Admissions (Daily hospital admissions Mean IHME S1)
> (line DayHodMeRaA03S01 date, sort lcolor(magenta)) /// 6 IMPE Hosp demand (Daily hospital demand Mean A03 S01 )
> (line DayHoiMeRaA03S01 date, sort lcolor(magenta) lpattern(dash)) /// 7 IMPE Hosp incidence (Daily hospital incidence Mean A03 S01 )
> (line DayIcdMeRaA03S01 date, sort lcolor(magenta) lpattern(dash_dot)) /// 8 IMPE ICU demand (Daily ICU demand Mean A03 S01 )
> (line DayIciMeRaA03S01 date, sort lcolor(magenta) lpattern(longdash_shortdash)) /// 9 IMPE ICU incidence (Daily ICU incidence Mean A03 S01 )
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$yticknalltime, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcomes) title("COVID-19 daily hospital-related outcomes global, reference scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "DELP Hospitalized" 2 "DELP Ventilated" 3 "IHME Bed need" 4 "IHME ICU need" ///
> 5 "IHME Admissions" 6 "IMPE Hosp demand" ///
> 7 "IMPE Hosp incidence" 8 "IMPE ICU demand" 9 "IMPE ICU incidence") rows(4) size(small)) ///
> subtitle("  .", size(small) color(white))
{res}{txt}
{com}. 
. * ICU new of IHME retired
. 
. graph save "graph 61a COVID-19 hospital-related outcomes.gph", replace
{txt}(note: file graph 61a COVID-19 hospital-related outcomes.gph not found)
{res}{txt}(file graph 61a COVID-19 hospital-related outcomes.gph saved)

{com}. graph export "graph 61a COVID-19 hospital-related outcomes.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 61a COVID-19 hospital-related outcomes.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * daily hospital-related outcomes, with IHME bed capcity
. 
. twoway ///
> (line DayHosMeRaA01S00 date, sort lcolor(red)  lwidth(thick)) /// 1 DELP Hospitalized (Daily Cases Active Hospitalized Mean DELP S0)
> (line DayVenMeRaA01S00 date, sort lcolor(red) lpattern(dash)  lwidth(thick)) /// 2 DELP Ventilated (Daily Cases Active Ventilated Mean DELP S0)
> (line DayBedMeSmA02S01 date, sort lcolor(black)) /// 3 IHME Bed need (Daily Beds needed Mean IHME S1)
> (line DayIcuMeSmA02S01 date, sort lcolor(green)) /// 4 IHME ICU need (Daily ICU beds needed Mean IHME S1)
> (line DayAdmMeSmA02S01 date, sort lcolor(yellow)) /// 5 IHME Admissions (Daily hospital admissions Mean IHME S1)
> (line DayHodMeRaA03S01 date, sort lcolor(magenta)) /// 6 IMPE Hosp demand (Daily hospital demand Mean A03 S01 )
> (line DayHoiMeRaA03S01 date, sort lcolor(magenta) lpattern(dash)) /// 7 IMPE Hosp incidence (Daily hospital incidence Mean A03 S01 )
> (line DayIcdMeRaA03S01 date, sort lcolor(magenta) lpattern(dash_dot)) /// 8 IMPE ICU demand (Daily ICU demand Mean A03 S01 )
> (line DayIciMeRaA03S01 date, sort lcolor(magenta) lpattern(longdash_shortdash)) /// 9 IMPE ICU incidence (Daily ICU incidence Mean A03 S01 )
> (line DayBEDMeSmA02    date, sort lcolor(black) lpattern(dash)) /// 10
> (line DayICUMeSmA02    date, sort lcolor(cyan) lpattern(dash)) /// 11
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$yticknalltime, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcomes) title("COVID-19 daily hospital-related outcomes global, reference scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "DELP Hospitalized" 2 "DELP Ventilated" 3 "IHME Bed need" 4 "IHME ICU need" ///
> 5 "IHME Admissions" 6 "IMPE Hosp demand" ///
> 7 "IMPE Hosp incidence" 8 "IMPE ICU demand" 9 "IMPE ICU incidence" ///
> 10 "IHME All bed capcity" 11 "IHME ICU bed capacity") rows(5) size(small)) ///
> subtitle("  .", size(small) color(white))
{res}{txt}
{com}. 
. * ICU new of IHME retired
. 
. graph save "graph 61b COVID-19 hospital-related outcomes with bed capcity.gph", replace
{txt}(note: file graph 61b COVID-19 hospital-related outcomes with bed capcity.gph not found)
{res}{txt}(file graph 61b COVID-19 hospital-related outcomes with bed capcity.gph saved)

{com}. graph export "graph 61b COVID-19 hospital-related outcomes with bed capcity.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 61b COVID-19 hospital-related outcomes with bed capcity.pdf written in PDF format)

{com}. 
. 
. 
. ****
. * daily hospital-related outcomes, DELP, IHME, IMPE, wo IHME Bed need, IMPE Hosp demand, with IHME ICU bed capcity
. 
. twoway ///
> (line DayHosMeRaA01S00 date, sort lcolor(red)  lwidth(thick)) /// 1 DELP Hospitalized (Daily Cases Active Hospitalized Mean DELP S0)
> (line DayVenMeRaA01S00 date, sort lcolor(red) lpattern(dash)  lwidth(thick)) /// 2 DELP Ventilated (Daily Cases Active Ventilated Mean DELP S0)
> (line DayIcuMeSmA02S01 date, sort lcolor(green)) /// 3 IHME ICU need (Daily ICU beds needed Mean IHME S1)
> (line DayAdmMeSmA02S01 date, sort lcolor(yellow)) /// 4 IHME Admissions (Daily hospital admissions Mean IHME S1)
> (line DayHoiMeRaA03S01 date, sort lcolor(magenta) lpattern(dash)) /// 5 IMPE Hosp incidence (Daily hospital incidence Mean A03 S01 )
> (line DayIcdMeRaA03S01 date, sort lcolor(magenta) lpattern(dash_dot)) /// 6 IMPE ICU demand (Daily ICU demand Mean A03 S01 )
> (line DayIciMeRaA03S01 date, sort lcolor(magenta) lpattern(longdash_shortdash)) /// 7 IMPE ICU incidence (Daily ICU incidence Mean A03 S01 )
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$yticknalltime, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcomes) title("COVID-19 daily hospital-related outcomes global, reference scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "DELP Hospitalized" 2 "DELP Ventilated" 3 "IHME ICU need" ///
> 4 "IHME Admissions" 5 "IMPE Hosp incidence" 6 "IMPE ICU demand" 7 "IMPE ICU incidence") rows(3) size(small)) ///
> subtitle("without IHME Bed need, IMPE Hosp demand", size(small))
{res}{txt}
{com}. 
. graph save "graph 62a COVID-19 hospital-related outcomes, wo extremes.gph", replace
{txt}(note: file graph 62a COVID-19 hospital-related outcomes, wo extremes.gph not found)
{res}{txt}(file graph 62a COVID-19 hospital-related outcomes, wo extremes.gph saved)

{com}. graph export "graph 62a COVID-19 hospital-related outcomes, wo extremes.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 62a COVID-19 hospital-related outcomes, wo extremes.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * daily hospital-related outcomes, DELP, IHME, IMPE, wo IHME Bed need, IMPE Hosp demand
. 
. twoway ///
> (line DayHosMeRaA01S00 date, sort lcolor(red)  lwidth(thick)) /// 1 DELP Hospitalized (Daily Cases Active Hospitalized Mean DELP S0)
> (line DayVenMeRaA01S00 date, sort lcolor(red) lpattern(dash)  lwidth(thick)) /// 2 DELP Ventilated (Daily Cases Active Ventilated Mean DELP S0)
> (line DayIcuMeSmA02S01 date, sort lcolor(green)) /// 3 IHME ICU need (Daily ICU beds needed Mean IHME S1)
> (line DayAdmMeSmA02S01 date, sort lcolor(yellow)) /// 4 IHME Admissions (Daily hospital admissions Mean IHME S1)
> (line DayHoiMeRaA03S01 date, sort lcolor(magenta) lpattern(dash)) /// 5 IMPE Hosp incidence (Daily hospital incidence Mean A03 S01 )
> (line DayIcdMeRaA03S01 date, sort lcolor(magenta) lpattern(dash_dot)) /// 6 IMPE ICU demand (Daily ICU demand Mean A03 S01 )
> (line DayIciMeRaA03S01 date, sort lcolor(magenta) lpattern(longdash_shortdash)) /// 7 IMPE ICU incidence (Daily ICU incidence Mean A03 S01 )
> (line DayICUMeSmA02    date, sort lcolor(cyan) lpattern(dash)) /// 8
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$yticknalltime, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcomes) title("COVID-19 daily hospital-related outcomes global, reference scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "DELP Hospitalized" 2 "DELP Ventilated" 3 "IHME ICU need" ///
> 4 "IHME Admissions" 5 "IMPE Hosp incidence" 6 "IMPE ICU demand" 7 "IMPE ICU incidence" 8 "IHME ICU bed capacity") rows(4) size(small)) ///
> subtitle("without IHME Bed need, IMPE Hosp demand", size(small))
{res}{txt}
{com}. 
. graph save "graph 62b COVID-19 hospital-related outcomes, wo extremes ICU bed capcity.gph", replace
{txt}(note: file graph 62b COVID-19 hospital-related outcomes, wo extremes ICU bed capcity.gph not found)
{res}{txt}(file graph 62b COVID-19 hospital-related outcomes, wo extremes ICU bed capcity.gph saved)

{com}. graph export "graph 62b COVID-19 hospital-related outcomes, wo extremes ICU bed capcity.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 62b COVID-19 hospital-related outcomes, wo extremes ICU bed capcity.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * daily hospital-related outcomes, DELP, IHME, IMPE, wo IHME Bed need, IMPE Hosp demand, 2021
. 
. twoway ///
> (line DayHosMeRaA01S00 date, sort lcolor(red)  lwidth(thick)) /// 1 DELP Hospitalized (Daily Cases Active Hospitalized Mean DELP S0)
> (line DayVenMeRaA01S00 date, sort lcolor(red) lpattern(dash)  lwidth(thick)) /// 2 DELP Ventilated (Daily Cases Active Ventilated Mean DELP S0)
> (line DayIcuMeSmA02S01 date, sort lcolor(green)) /// 3 IHME ICU need (Daily ICU beds needed Mean IHME S1)
> (line DayAdmMeSmA02S01 date, sort lcolor(yellow)) /// 4 IHME Admissions (Daily hospital admissions Mean IHME S1)
> (line DayHoiMeRaA03S01 date, sort lcolor(magenta) lpattern(dash)) /// 5 IMPE Hosp incidence (Daily hospital incidence Mean A03 S01 )
> (line DayIcdMeRaA03S01 date, sort lcolor(magenta) lpattern(dash_dot)) /// 6 IMPE ICU demand (Daily ICU demand Mean A03 S01 )
> (line DayIciMeRaA03S01 date, sort lcolor(magenta) lpattern(longdash_shortdash)) /// 7 IMPE ICU incidence (Daily ICU incidence Mean A03 S01 )
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$ytickn2021, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily outcomes) title("COVID-19 daily hospital-related outcomes global, reference scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "DELP Hospitalized" 2 "DELP Ventilated" 3 "IHME ICU need" ///
> 4 "IHME Admissions" 5 "IMPE Hosp incidence" 6 "IMPE ICU demand" 7 "IMPE ICU incidence") rows(3) size(small)) ///
> subtitle("after 2021-01-01, without IHME Bed need, IMPE Hosp demand", size(small))
{res}{txt}
{com}. 
. graph save "graph 63 COVID-19 hospital-related outcomes, wo extremes, 2021.gph", replace
{txt}(note: file graph 63 COVID-19 hospital-related outcomes, wo extremes, 2021.gph not found)
{res}{txt}(file graph 63 COVID-19 hospital-related outcomes, wo extremes, 2021.gph saved)

{com}. graph export "graph 63 COVID-19 hospital-related outcomes, wo extremes, 2021.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 63 COVID-19 hospital-related outcomes, wo extremes, 2021.pdf written in PDF format)

{com}. 
. 
. 
. *******************************
. 
. * daily cases or infections to deaths (CTD) (graph numbers start w/ 71)
. 
. 
. 
. ****
. * Daily cases or infections to deaths (CTD) all studies, reference scenarios, all time
. 
. twoway ///
> (line DayCTDMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN"
> (line DayCTDMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayITDMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayITDMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayCTDMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$yticknalltime, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases to deaths) title("COVID-19 daily cases to deaths, global, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections" 4 "IMPE infections" ///
> 5 "SRIV cases") size(small) row(2)) ///
> subtitle("daily cases or infections to deaths", size(small))
{res}{txt}
{com}. 
. graph save "graph 71 COVID-19 daily cases to deaths, global, reference scenarios, all time.gph", replace
{txt}(note: file graph 71 COVID-19 daily cases to deaths, global, reference scenarios, all time.gph not found)
{res}{txt}(file graph 71 COVID-19 daily cases to deaths, global, reference scenarios, all time.gph saved)

{com}. graph export "graph 71 COVID-19 daily cases to deaths, global, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 71 COVID-19 daily cases to deaths, global, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * Daily cases or infections to deaths (CTD) all studies, reference scenarios, 2021
. 
. twoway ///
> (line DayCTDMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN"
> (line DayCTDMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayITDMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayITDMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayCTDMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$ytickn2021, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases to deaths) title("COVID-19 daily cases to deaths, global, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections" 4 "IMPE infections" ///
> 5 "SRIV cases") size(small) row(2)) ///
> subtitle("daily cases or infections to deaths; after 2021-01-01", size(small))
{res}{txt}
{com}. 
. graph save "graph 72 COVID-19 daily cases to deaths, global, reference scenarios, 2021.gph", replace
{txt}(note: file graph 72 COVID-19 daily cases to deaths, global, reference scenarios, 2021.gph not found)
{res}{txt}(file graph 72 COVID-19 daily cases to deaths, global, reference scenarios, 2021.gph saved)

{com}. graph export "graph 72 COVID-19 daily cases to deaths, global, reference scenarios, 2021.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 72 COVID-19 daily cases to deaths, global, reference scenarios, 2021.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * Total cases or infections to deaths (CTD) all studies, reference scenarios, all time
. 
. twoway ///
> (line TotCTDMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN"
> (line TotCTDMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotITDMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotITDMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line TotCTDMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$yticknalltime, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases to deaths) title("COVID-19 total cases to deaths, global, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections" 4 "IMPE infections" ///
> 5 "SRIV cases") size(small) row(2)) ///
> subtitle("daily cases or infections to deaths", size(small))
{res}{txt}
{com}. 
. graph save "graph 73 COVID-19 total cases to deaths, global, reference scenarios, all time.gph", replace
{txt}(note: file graph 73 COVID-19 total cases to deaths, global, reference scenarios, all time.gph not found)
{res}{txt}(file graph 73 COVID-19 total cases to deaths, global, reference scenarios, all time.gph saved)

{com}. graph export "graph 73 COVID-19 total cases to deaths, global, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 73 COVID-19 total cases to deaths, global, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * Total cases or infections to deaths (CTD) all studies, reference scenarios, 2021
. 
. twoway ///
> (line TotCTDMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN"
> (line TotCTDMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotITDMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotITDMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line TotCTDMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$ytickn2021, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases to deaths) title("COVID-19 total cases to deaths, global, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections" 4 "IMPE infections" ///
> 5 "SRIV cases") size(small) row(2)) ///
> subtitle("daily cases or infections to deaths; after 2021-01-01", size(small))
{res}{txt}
{com}. 
. graph save "graph 74 COVID-19 total cases to deaths, global, reference scenarios, 2021.gph", replace
{txt}(note: file graph 74 COVID-19 total cases to deaths, global, reference scenarios, 2021.gph not found)
{res}{txt}(file graph 74 COVID-19 total cases to deaths, global, reference scenarios, 2021.gph saved)

{com}. graph export "graph 74 COVID-19 total cases to deaths, global, reference scenarios, 2021.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 74 COVID-19 total cases to deaths, global, reference scenarios, 2021.pdf written in PDF format)

{com}. 
. 
. 
. 
. *******************************
. 
. *  estimated to reported (graph numbers start w/ 81)
. 
. 
. * daily deaths estimated to reported  
. 
. 
. 
. ****
. * daily deaths estimated to reported (DER) all studies, reference scenarios, all time
. 
. twoway ///
> (line DayDERMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN"
> (line DayDERMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayDERMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayDERMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayDERMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$yticknalltime, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.1fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths estimated to reported) title("COVID-19 daily deaths estimated to reported, global, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "SRIV") size(small) row(1)) ///
> subtitle("  .", size(small) color(white)) yscale(titlegap(2))
{res}{txt}
{com}. 
. graph save "graph 81 COVID-19 daily deaths estimated to reported, global, reference scenarios, all time.gph", replace
{txt}(note: file graph 81 COVID-19 daily deaths estimated to reported, global, reference scenarios, all time.gph not found)
{res}{txt}(file graph 81 COVID-19 daily deaths estimated to reported, global, reference scenarios, all time.gph saved)

{com}. graph export "graph 81 COVID-19 daily deaths estimated to reported, global, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 81 COVID-19 daily deaths estimated to reported, global, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * daily deaths estimated to reported (DER) all studies, reference scenarios, 2021
. 
. twoway ///
> (line DayDERMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN"
> (line DayDERMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayDERMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayDERMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayDERMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$ytickn2021, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.1fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths estimated to reported) title("COVID-19 daily deaths estimated to reported, global, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "SRIV") size(small) row(1)) ///
> subtitle("  .", size(small) color(white)) yscale(titlegap(2))
{res}{txt}
{com}. 
. graph save "graph 82 COVID-19 daily deaths estimated to reported, global, reference scenarios, 2021.gph", replace
{txt}(note: file graph 82 COVID-19 daily deaths estimated to reported, global, reference scenarios, 2021.gph not found)
{res}{txt}(file graph 82 COVID-19 daily deaths estimated to reported, global, reference scenarios, 2021.gph saved)

{com}. graph export "graph 82 COVID-19 daily deaths estimated to reported, global, reference scenarios, 2021.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 82 COVID-19 daily deaths estimated to reported, global, reference scenarios, 2021.pdf written in PDF format)

{com}. 
. 
. 
. * daily cases or infections estimated to reported cases
. 
. 
. 
. ****
. * daily cases or infections estimated to reported cases all studies, reference scenarios, all time
. 
. twoway ///
> (line DayCERMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN"
> (line DayCERMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayITDMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayITDMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayCERMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$yticknalltime, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases estimated to reported) title("COVID-19 daily cases estimated to reported, global, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections" 4 "IMPE infections" ///
> 5 "SRIV cases") size(small) row(2)) ///
> subtitle("daily cases or infections estimated, to reported cases", size(small)) yscale(titlegap(2))
{res}{txt}
{com}. 
. graph save "graph 83 COVID-19 daily cases estimated to reported, global, reference scenarios, all time.gph", replace
{txt}(note: file graph 83 COVID-19 daily cases estimated to reported, global, reference scenarios, all time.gph not found)
{res}{txt}(file graph 83 COVID-19 daily cases estimated to reported, global, reference scenarios, all time.gph saved)

{com}. graph export "graph 83 COVID-19 daily cases estimated to reported, global, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 83 COVID-19 daily cases estimated to reported, global, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * daily cases or infections estimated to reported cases all studies, reference scenarios, 2021
. 
. twoway ///
> (line DayCERMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN"
> (line DayCERMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line DayITDMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line DayITDMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line DayCERMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$ytickn2021, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.1fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases estimated to reported) title("COVID-19 daily cases estimated to reported, global, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections" 4 "IMPE infections" ///
> 5 "SRIV cases") size(small) row(2)) ///
> subtitle("daily cases or infections estimated, to reported cases", size(small)) yscale(titlegap(2))
{res}{txt}
{com}. 
. graph save "graph 84 COVID-19 daily cases estimated to reported, global, reference scenarios, 2021.gph", replace
{txt}(note: file graph 84 COVID-19 daily cases estimated to reported, global, reference scenarios, 2021.gph not found)
{res}{txt}(file graph 84 COVID-19 daily cases estimated to reported, global, reference scenarios, 2021.gph saved)

{com}. graph export "graph 84 COVID-19 daily cases estimated to reported, global, reference scenarios, 2021.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 84 COVID-19 daily cases estimated to reported, global, reference scenarios, 2021.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * total deaths estimated to reported (DER) all studies, reference scenarios, all time
. 
. twoway ///
> (line TotDERMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN
> (line TotDERMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotDERMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotDERMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line TotDERMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$yticknalltime, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths estimated to reported) title("COVID-19 total deaths estimated to reported, global, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "SRIV") size(small) row(1)) ///
> subtitle("  .", size(small) color(white)) yscale(titlegap(2))
{res}{txt}
{com}. 
. graph save "graph 85 COVID-19 total deaths estimated to reported, global, reference scenarios, all time.gph", replace
{txt}(note: file graph 85 COVID-19 total deaths estimated to reported, global, reference scenarios, all time.gph not found)
{res}{txt}(file graph 85 COVID-19 total deaths estimated to reported, global, reference scenarios, all time.gph saved)

{com}. graph export "graph 85 COVID-19 total deaths estimated to reported, global, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 85 COVID-19 total deaths estimated to reported, global, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * total deaths estimated to reported (DER) all studies, reference scenarios, 2021
. 
. twoway ///
> (line TotDERMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN
> (line TotDERMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotDERMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotDERMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line TotDERMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$ytickn2021, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths estimated to reported) title("COVID-19 total deaths estimated to reported, global, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN" 2 "DELP" 3 "IHME" 4 "IMPE" 5 "SRIV") size(small) row(1)) ///
> subtitle("  .", size(small) color(white)) yscale(titlegap(2))
{res}{txt}
{com}. 
. graph save "graph 86 COVID-19 total deaths estimated to reported, global, reference scenarios, 2021.gph", replace
{txt}(note: file graph 86 COVID-19 total deaths estimated to reported, global, reference scenarios, 2021.gph not found)
{res}{txt}(file graph 86 COVID-19 total deaths estimated to reported, global, reference scenarios, 2021.gph saved)

{com}. graph export "graph 86 COVID-19 total deaths estimated to reported, global, reference scenarios, 2021.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 86 COVID-19 total deaths estimated to reported, global, reference scenarios, 2021.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * total cases or infections estimated to reported cases all studies, reference scenarios, all time
. 
. twoway ///
> (line TotCERMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN"
> (line TotCERMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotIERMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotIERMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line TotCERMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#$yticknalltime, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases estimated to reported) title("COVID-19 total cases estimated to reported, global, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections" 4 "IMPE infections" 5 "SRIV cases") size(small) row(2)) ///
> subtitle("total cases or infections estimated, to reported cases", size(small)) yscale(titlegap(2))
{res}{txt}
{com}. 
. graph save "graph 87 COVID-19 total cases estimated to reported, global, reference scenarios, all time.gph", replace
{txt}(note: file graph 87 COVID-19 total cases estimated to reported, global, reference scenarios, all time.gph not found)
{res}{txt}(file graph 87 COVID-19 total cases estimated to reported, global, reference scenarios, all time.gph saved)

{com}. graph export "graph 87 COVID-19 total cases estimated to reported, global, reference scenarios, all time.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 87 COVID-19 total cases estimated to reported, global, reference scenarios, all time.pdf written in PDF format)

{com}. 
. 
. 
. 
. ****
. * total cases or infections estimated to reported cases all studies, reference scenarios, 2021
. 
. twoway ///
> (line TotCERMeRaA00S00 date, sort lcolor(cyan*1.2) lwidth(vthick)) /// 1 "JOHN"
> (line TotCERMeRaA01S00 date, sort lcolor(red)) /// 2 "DELP"
> (line TotIERMeSmA02S01 date, sort lcolor(black)) /// 3 "IHME"
> (line TotIERMeRaA03S02 date, sort lcolor(magenta)) /// 4 "IMPE"
> (line TotCERMeRaA05S00 date, sort lcolor(green)) /// 5 "SRIV"
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#$ytickn2021, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid)  ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases estimated to reported) title("COVID-19 total cases estimated to reported, global, reference scenarios", size(medium)) /// 
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "JOHN cases" 2 "DELP cases" 3 "IHME infections" 4 "IMPE infections" 5 "SRIV cases") size(small) row(2)) ///
> subtitle("total cases or infections estimated, to reported cases", size(small)) yscale(titlegap(2))
{res}{txt}
{com}. 
. graph save "graph 88 COVID-19 total cases estimated to reported, global, reference scenarios, 2021.gph", replace
{txt}(note: file graph 88 COVID-19 total cases estimated to reported, global, reference scenarios, 2021.gph not found)
{res}{txt}(file graph 88 COVID-19 total cases estimated to reported, global, reference scenarios, 2021.gph saved)

{com}. graph export "graph 88 COVID-19 total cases estimated to reported, global, reference scenarios, 2021.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 88 COVID-19 total cases estimated to reported, global, reference scenarios, 2021.pdf written in PDF format)

{com}. 
. ***
. 
. 
. 
. * IHME graphs
. 
. 
. 
. * daily Infection outcomes ratios, 3 scenarios 
.   
. twoway ///
> (line infection_detection_A02S01 date, sort lcolor(green)) ///
> (line infection_hospitalization_A02S01 date, sort lcolor(black)) ///
> (line infection_fatality_A02S01 date, sort lcolor(red)) ///
> (line infection_detection_A02S02 date, sort lcolor(green) lpattern(dash)) ///
> (line infection_hospitalization_A02S02 date, sort lcolor(black) lpattern(dash)) ///
> (line infection_fatality_A02S02 date, sort lcolor(red) lpattern(dash)) ///
> (line infection_detection_A02S03 date, sort lcolor(green) lpattern(dash)) ///
> (line infection_hospitalization_A02S03 date, sort lcolor(black) lpattern(dash)) ///
> (line infection_fatality_A02S03 date, sort lcolor(red) lpattern(dash)) ///
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#24, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily infection outcome ratios) title("COVID-19 daily infection outcome ratios, global, IHME, 3 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Infection detection ratio" 2 "Infection hospitalization ratio" 3 "Infection fatality ratio") rows(2)) ///
> note("Better and worse scenarios: dashed curves")
{res}{txt}
{com}. 
. graph save "graph 91 COVID-19 daily Infection outcomes ratios, global 3 scenarios, IHME.gph", replace
{txt}(note: file graph 91 COVID-19 daily Infection outcomes ratios, global 3 scenarios, IHME.gph not found)
{res}{txt}(file graph 91 COVID-19 daily Infection outcomes ratios, global 3 scenarios, IHME.gph saved)

{com}. graph export "graph 91 COVID-19 daily Infection outcomes ratios, global 3 scenarios, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 91 COVID-19 daily Infection outcomes ratios, global 3 scenarios, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. * daily % change in mobility, CI
. 
. twoway ///
> (line mobility_mean_A02S02 date, sort lcolor(green)) ///
> (line mobility_mean_A02S03 date, sort lcolor(red)) ///
> (line mobility_mean_A02S01 date, sort lcolor(black)) ///
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#24, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.1fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily % change in mobility from baseline) title("COVID-19 daily % change in mobility, global, IHME, 3 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Better" 2 "Worse" 3 "Reference") rows(1)) 
{res}{txt}
{com}. 
. graph save "graph 92 COVID-19 daily mobility, global, 3 scenarios.gph", replace
{txt}(note: file graph 92 COVID-19 daily mobility, global, 3 scenarios.gph not found)
{res}{txt}(file graph 92 COVID-19 daily mobility, global, 3 scenarios.gph saved)

{com}. graph export "graph 92 COVID-19 daily mobility, global, 3 scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 92 COVID-19 daily mobility, global, 3 scenarios.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. 
. * daily mask use Percent of population reporting always wearing a mask when leaving home
. 
. twoway ///
> (line mask_use_mean_A02S02 date, sort lcolor(green)) ///
> (line mask_use_mean_A02S03 date, sort lcolor(red)) ///
> (line mask_use_mean_A02S01 date, sort lcolor(black)) ///
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#24, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.1fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily mask use) title("COVID-19 daily mask use, global, IHME, 3 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Better" 2 "Worse" 3 "Reference") rows(1)) ///
> subtitle(Proportion of population reporting always wearing a mask when leaving home, size(small))
{res}{txt}
{com}. 
. graph save "graph 93 COVID-19 daily mask_use, global, 3 scenarios.gph", replace
{txt}(note: file graph 93 COVID-19 daily mask_use, global, 3 scenarios.gph not found)
{res}{txt}(file graph 93 COVID-19 daily mask_use, global, 3 scenarios.gph saved)

{com}. graph export "graph 93 COVID-19 daily mask_use, global, 3 scenarios.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 93 COVID-19 daily mask_use, global, 3 scenarios.pdf written in PDF format)

{com}. 
. 
. 
. * cumulative vaccinated percent
. 
. twoway ///
> (line cumulative_all_vaccin_pct date, sort lcolor(black)) ///
> (line cumul_all_effect_vacci_pct date, sort lcolor(blue)) ///
> (line cumul_all_fully_vacci_pct date, sort lcolor(green) lwidth(thick)) ///
> if date >= td(01dec2020) ///
> , xtitle(Date) xlabel(#13, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.1fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(% Cumulative vaccinated percent) title("COVID-19 cumulative vaccinated percent, global, IHME, 3 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Vaccinated" 2 "Effectively vaccinated" 3 "Fully vaccinated") rows(1)) ///
> note("Vaccinated: Initially vaccinated (one dose of two doses)" ///
> "Effectively vaccinated: one and two dose with efficacy" ///
> "Fully vaccinated: one of one and two of two doses", size(small))
{res}{txt}
{com}. 
. graph save "graph 94 COVID-19 cumulative vaccinated percent, global, IHME.gph", replace
{txt}(note: file graph 94 COVID-19 cumulative vaccinated percent, global, IHME.gph not found)
{res}{txt}(file graph 94 COVID-19 cumulative vaccinated percent, global, IHME.gph saved)

{com}. graph export "graph 94 COVID-19 cumulative vaccinated percent, global, IHME.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 94 COVID-19 cumulative vaccinated percent, global, IHME.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. * daily vaccinated percent
. 
. twoway ///
> (line daily_all_vaccin_pct date, sort lcolor(black)) ///
> (line daily_all_effect_vacci_pct date, sort lcolor(blue)) ///
> (line daily_all_fully_vacci_pct date, sort lcolor(green) lwidth(thick)) ///
> if date >= td(01dec2020) ///
> , xtitle(Date) xlabel(#13, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.1fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(% Daily vaccinated percent) title("COVID-19 daily vaccinated percent, global, IHME, 3 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Vaccinated" 2 "Effectively vaccinated" 3 "Fully vaccinated") rows(1)) ///
> note("Vaccinated: Initially vaccinated (one dose of two doses)" ///
> "Effectively vaccinated: one and two dose with efficacy" ///
> "Fully vaccinated: one of one and two of two doses", size(small))
{res}{txt}
{com}. 
. graph save "graph 95 COVID-19 daily vaccinated percent, global.gph", replace
{txt}(note: file graph 95 COVID-19 daily vaccinated percent, global.gph not found)
{res}{txt}(file graph 95 COVID-19 daily vaccinated percent, global.gph saved)

{com}. graph export "graph 95 COVID-19 daily vaccinated percent, global.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 95 COVID-19 daily vaccinated percent, global.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily vaccinated number
. 
. twoway ///
> (line daily_all_vaccinated date, sort lcolor(black)) ///
> (line daily_all_effectively_vacci date, sort lcolor(blue)) ///
> (line daily_all_fully_vaccinated date, sort lcolor(green) lwidth(thick)) ///
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#13, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily vaccinated number) title("COVID-19 daily vaccinated number, global, IHME, 3 scenarios", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "Vaccinated" 2 "Effectively vaccinated" 3 "Fully vaccinated") rows(1)) ///
> note("Vaccinated: Initially vaccinated (one dose of two doses)" ///
> "Effectively vaccinated: one and two dose with efficacy" ///
> "Fully vaccinated: one of one and two of two doses", size(small))
{res}{txt}
{com}. 
. graph save "graph 96 COVID-19 daily vaccinated number, global.gph", replace
{txt}(note: file graph 96 COVID-19 daily vaccinated number, global.gph not found)
{res}{txt}(file graph 96 COVID-19 daily vaccinated number, global.gph saved)

{com}. graph export "graph 96 COVID-19 daily vaccinated number, global.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/graph 96 COVID-19 daily vaccinated number, global.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. ************
. 
. * restore native scheme (of the local machine)
. 
. set scheme $nativescheme
{txt}
{com}. 
. di c(scheme)
{res}s2color
{txt}
{com}. 
. 
. view "log CovidVisualizedGlobal merge.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211022/code/merge/log CovidVisualizedGlobal merge.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}22 Oct 2021, 11:10:48
{txt}{.-}
{smcl}
{txt}{sf}{ul off}