{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211217/code/IMPE/log CovidVisualizedGlobal IMPE 2.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}17 Dec 2021, 14:28:33
{txt}
{com}. 
. ***************************************************************************
. * This is "do CovidVisualizedGlobal IMPE 2.do"
. 
. * Project: Combine and visualize international periodically updating 
. * estimates of COVID-19 at the global level (CovidVisualizedGlobal)
. * Person: Farshad Pourmalek pourmalek_farshad at yahoo dot com
. * Time (initial): 2021-04-14
. ***************************************************************************
.  
. 
. * merge files
. 
. 
. 
. 
. ******************
. 
. * append regions
. 
. use "IMPE GLOBAL.dta", clear 
{txt}
{com}. 
. local list2 AFRO AMRO EMRO EURO SEARO WPRO
{txt}
{com}. 
. foreach region of local list2 {c -(}
{txt}  2{com}. 
.         append using "IMPE `region'.dta"
{txt}  3{com}.         
. {c )-}
{txt}
{com}. *
. 
. 
. 
. 
. 
. *************
. 
. * smooth 
. 
. encode loc_grand_name, gen(loc_grand_name_encoded)
{txt}
{com}. 
. tsset loc_grand_name_encoded date, daily   
{res}{txt}{col 8}panel variable:  {res}loc_grand_name_encoded (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}date, 29Nov2019 to 04Mar2022
{txt}{col 17}delta:  {res}1 day
{txt}
{com}. 
. 
. tssmooth ma DayINFMeRaA03S01_w = DayINFMeRaA03S01, window(3 1 3) // _w = _window
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_encoded : (1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayINFMeRaA03S01{p_end}
{txt}
{com}. 
. tssmooth ma DayINFMeSmA03S01 = DayINFMeRaA03S01_w, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_encoded : (1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayINFMeRaA03S01_w
{txt}
{smcl}
{com}. 
. label var DayINFMeSmA03S01 "Daily infections smooth A03 IMPE S01"
{txt}
{com}. 
. drop *_w
{txt}
{com}. 
. 
. 
. tssmooth ma DayINFMeRaA03S02_w = DayINFMeRaA03S02, window(3 1 3) // _w = _window
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_encoded : (1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayINFMeRaA03S02{p_end}
{txt}
{com}. 
. tssmooth ma DayINFMeSmA03S02 = DayINFMeRaA03S02_w, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_encoded : (1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayINFMeRaA03S02_w
{txt}
{smcl}
{com}. 
. label var DayINFMeSmA03S02 "Daily infections smooth A03 IMPE S02"
{txt}
{com}. 
. drop *_w
{txt}
{com}. 
. 
. 
. tssmooth ma DayINFMeRaA03S03_w = DayINFMeRaA03S03, window(3 1 3) // _w = _window
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_encoded : (1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayINFMeRaA03S03{p_end}
{txt}
{com}. 
. tssmooth ma DayINFMeSmA03S03 = DayINFMeRaA03S03_w, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_encoded : (1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayINFMeRaA03S03_w
{txt}
{smcl}
{com}. 
. label var DayINFMeSmA03S03 "Daily infections smooth A03 IMPE S03"
{txt}
{com}. 
. drop *_w
{txt}
{com}. 
. 
. 
. tssmooth ma DayINFMeRaA03S04_w = DayINFMeRaA03S04, window(3 1 3) // _w = _window
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_encoded : (1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayINFMeRaA03S04{p_end}
{txt}
{com}. 
. tssmooth ma DayINFMeSmA03S04 = DayINFMeRaA03S04_w, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_encoded : (1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayINFMeRaA03S04_w
{txt}
{smcl}
{com}. 
. label var DayINFMeSmA03S04 "Daily infections smooth A03 IMPE S04"
{txt}
{com}. 
. drop *_w
{txt}
{com}. 
. 
. 
. tssmooth ma DayINFMeRaA03S05_w = DayINFMeRaA03S05, window(3 1 3) // _w = _window
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_encoded : (1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayINFMeRaA03S05{p_end}
{txt}
{com}. 
. tssmooth ma DayINFMeSmA03S05 = DayINFMeRaA03S05_w, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_encoded : (1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayINFMeRaA03S05_w
{txt}
{smcl}
{com}. 
. label var DayINFMeSmA03S05 "Daily infections smooth A03 IMPE S05"
{txt}
{com}. 
. drop *_w
{txt}
{com}. 
. 
. 
. tssmooth ma DayINFMeRaA03S06_w = DayINFMeRaA03S06, window(3 1 3) // _w = _window
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_encoded : (1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayINFMeRaA03S06{p_end}
{txt}
{com}. 
. tssmooth ma DayINFMeSmA03S06 = DayINFMeRaA03S06_w, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5} by loc_grand_name_encoded : (1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayINFMeRaA03S06_w
{txt}
{smcl}
{com}. 
. label var DayINFMeSmA03S06 "Daily infections smooth A03 IMPE S06"
{txt}
{com}. 
. drop *_w
{txt}
{com}. 
. 
. 
. tsset, clear
{txt}
{com}. 
. *
. 
. 
. 
. 
. 
. * gen vars by location 
. 
. foreach var of varlist TotDeaMeRaA03S01-DayINFMeSmA03S06 {c -(}
{txt}  2{com}. 
. 
.         qui gen `var'AFRO = `var' 
{txt}  3{com}.         qui replace `var'AFRO = . if loc_grand_name != "AFRO"
{txt}  4{com}.         
.         qui gen `var'AMRO = `var'
{txt}  5{com}.         qui replace `var'AMRO = . if loc_grand_name != "AMRO"
{txt}  6{com}.         
.         qui gen `var'EMRO = `var'
{txt}  7{com}.         qui replace `var'EMRO = . if loc_grand_name != "EMRO"
{txt}  8{com}.         
.         qui gen `var'EURO = `var'
{txt}  9{com}.         qui replace `var'EURO = . if loc_grand_name != "EURO"
{txt} 10{com}.         
.         qui gen `var'GLOBAL = `var'
{txt} 11{com}.         qui replace `var'GLOBAL = . if loc_grand_name != " GLOBAL"
{txt} 12{com}.         
.         qui gen `var'SEARO = `var'
{txt} 13{com}.         qui replace `var'SEARO = . if loc_grand_name != "SEARO"
{txt} 14{com}.         
.         qui gen `var'WPRO = `var'
{txt} 15{com}.         qui replace `var'WPRO = . if loc_grand_name != "WPRO"
{txt} 16{com}.         
.         
.         label var `var'AFRO "`var' AFRO"
{txt} 17{com}.         label var `var'AMRO "`var' AMRO"
{txt} 18{com}.         label var `var'EMRO "`var' EMRO"
{txt} 19{com}.         label var `var'EURO "`var' EURO"
{txt} 20{com}.         label var `var'GLOBAL "`var' GLOBAL"
{txt} 21{com}.         label var `var'SEARO "`var' SEARO"
{txt} 22{com}.         label var `var'WPRO "`var' WPRO"
{txt} 23{com}. 
.                                 
. {c )-}
{txt}
{com}. *
. 
. 
. 
. 
. 
. 
. 
. sort date loc_grand_name
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "CovidVisualizedGlobal IMPE.dta", replace
{txt}file CovidVisualizedGlobal IMPE.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. view "log CovidVisualizedGlobal IMPE 2.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211217/code/IMPE/log CovidVisualizedGlobal IMPE 2.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}17 Dec 2021, 14:28:37
{txt}{.-}
{smcl}
{txt}{sf}{ul off}