{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211217/code/SRIV/log CovidVisualizedGlobal SRIV 1.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}17 Dec 2021, 14:30:45
{txt}
{com}. 
. ***************************************************************************
. * This is "do CovidVisualizedGlobal SRIV 1.do"
. 
. * Project: Combine and visualize international periodically updating 
. * estimates of COVID-19 at the global level (CovidVisualizedGlobal)
. * Person: Farshad Pourmalek pourmalek_farshad at yahoo dot com
. * Time (initial): 2021-04-14
. ***************************************************************************
. 
. 
.                                                                                                          ***************************
. * To change update date, find and replace all, 2021-12-17 (old), with 2021-12-17 (new) <<--       <<<--- * change update date here *
.                                                                                                          ***************************
.                                                                                                                                                                                                                  
. ******* Also, find and replace all, 16dec2021 (old), with 16dec2021 (new) **********              <<<---       *  AND HERE  *
.                                                                                                          ***************************
. 
. 
. 
. * Get SRIV estimates 
. 
. 
. copy https://raw.githubusercontent.com/scc-usc/ReCOVER-COVID-19/master/results/historical_forecasts/2021-12-17/global_forecasts_deaths.csv global_forecasts_deaths.csv
{txt}
{com}. copy https://raw.githubusercontent.com/scc-usc/ReCOVER-COVID-19/master/results/historical_forecasts/2021-12-17/global_forecasts_deaths_lb.csv global_forecasts_deaths_lb.csv
{txt}
{com}. copy https://raw.githubusercontent.com/scc-usc/ReCOVER-COVID-19/master/results/historical_forecasts/2021-12-17/global_forecasts_deaths_ub.csv global_forecasts_deaths_ub.csv
{txt}
{com}. copy https://raw.githubusercontent.com/scc-usc/ReCOVER-COVID-19/master/results/historical_forecasts/2021-12-17/global_forecasts_cases.csv global_forecasts_cases.csv
{txt}
{com}. copy https://raw.githubusercontent.com/scc-usc/ReCOVER-COVID-19/master/results/historical_forecasts/2021-12-17/global_forecasts_cases_lb.csv global_forecasts_cases_lb.csv
{txt}
{com}. copy https://raw.githubusercontent.com/scc-usc/ReCOVER-COVID-19/master/results/historical_forecasts/2021-12-17/global_forecasts_cases_ub.csv global_forecasts_cases_ub.csv
{txt}
{com}. 
. 
. 
. * gen one file with original vars for all countries
. 
. local list1 ///
> global_forecasts_deaths global_forecasts_deaths_lb global_forecasts_deaths_ub ///
> global_forecasts_cases global_forecasts_cases_lb global_forecasts_cases_ub
{txt}
{com}. 
. foreach l of local list1 {c -(}
{txt}  2{com}. 
.         import delimited "`l'.csv", clear varnames(1)
{txt}  3{com}.         
.         label var id id
{txt}  4{com}.         
.         foreach v of var * {c -(}
{txt}  5{com}.                 local lbl : var label `v'
{txt}  6{com}.                 local lbl = strtoname("`lbl'")
{txt}  7{com}.                 rename `v' `lbl'                                        
{txt}  8{com}.         {c )-}
{txt}  9{com}.         *
.         
.         drop id
{txt} 10{com}.         
.         gen i = _n
{txt} 11{com}.                 
.         reshape long _, i(i) j(j, string)
{txt} 12{com}.         
.         rename _ `l'
{txt} 13{com}.         
.         rename j date 
{txt} 14{com}.         
.         drop i
{txt} 15{com}.         
.         rename Country country
{txt} 16{com}.         
.         order date country
{txt} 17{com}.         
.         save "`l'.dta", replace 
{txt} 18{com}. 
. {c )-}
{res}{text}(103 vars, 184 obs)
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}(note: j = 2021_12_16 2021_12_17 2021_12_18 2021_12_19 2021_12_20 2021_12_21 2021_12_22 2021_12_23 2021_12_24 2021_12_25 2021_12_26 2021_12_27 2021_12_28 2021_12_29 2021_12_30 2021_12_31 2022_01_01 2022_01_02 2022_01_03 2022_01_04 2022_01_05 2022_01_06 2022_01_07 2022_01_08 2022_01_09 2022_01_10 2022_01_11 2022_01_12 2022_01_13 2022_01_14 2022_01_15 2022_01_16 2022_01_17 2022_01_18 2022_01_19 2022_01_20 2022_01_21 2022_01_22 2022_01_23 2022_01_24 2022_01_25 2022_01_26 2022_01_27 2022_01_28 2022_01_29 2022_01_30 2022_01_31 2022_02_01 2022_02_02 2022_02_03 2022_02_04 2022_02_05 2022_02_06 2022_02_07 2022_02_08 2022_02_09 2022_02_10 2022_02_11 2022_02_12 2022_02_13 2022_02_14 2022_02_15 2022_02_16 2022_02_17 2022_02_18 2022_02_19 2022_02_20 2022_02_21 2022_02_22 2022_02_23 2022_02_24 2022_02_25 2022_02_26 2022_02_27 2022_02_28 2022_03_01 2022_03_02 2022_03_03 2022_03_04 2022_03_05 2022_03_06 2022_03_07 2022_03_08 2022_03_09 2022_03_10 2022_03_11 2022_03_12 2022_03_13 2022_03_14 2022_03_15 2022_03_16 2022_03_17 2022_03_18 2022_03_19 2022_03_20 2022_03_21 2022_03_22 2022_03_23 2022_03_24 2022_03_25 2022_03_26)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}     184   {txt}->{res}   18584
{txt}Number of variables            {res}     103   {txt}->{res}       4
{txt}j variable (101 values)                   ->   {res}j
{txt}xij variables:
{res}_2021_12_16 _2021_12_17 ... _2022_03_26   {txt}->   {res}_
{txt}{hline 77}
{res}{txt}file global_forecasts_deaths.dta saved
{res}{text}(103 vars, 184 obs)
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}(note: j = 2021_12_16 2021_12_17 2021_12_18 2021_12_19 2021_12_20 2021_12_21 2021_12_22 2021_12_23 2021_12_24 2021_12_25 2021_12_26 2021_12_27 2021_12_28 2021_12_29 2021_12_30 2021_12_31 2022_01_01 2022_01_02 2022_01_03 2022_01_04 2022_01_05 2022_01_06 2022_01_07 2022_01_08 2022_01_09 2022_01_10 2022_01_11 2022_01_12 2022_01_13 2022_01_14 2022_01_15 2022_01_16 2022_01_17 2022_01_18 2022_01_19 2022_01_20 2022_01_21 2022_01_22 2022_01_23 2022_01_24 2022_01_25 2022_01_26 2022_01_27 2022_01_28 2022_01_29 2022_01_30 2022_01_31 2022_02_01 2022_02_02 2022_02_03 2022_02_04 2022_02_05 2022_02_06 2022_02_07 2022_02_08 2022_02_09 2022_02_10 2022_02_11 2022_02_12 2022_02_13 2022_02_14 2022_02_15 2022_02_16 2022_02_17 2022_02_18 2022_02_19 2022_02_20 2022_02_21 2022_02_22 2022_02_23 2022_02_24 2022_02_25 2022_02_26 2022_02_27 2022_02_28 2022_03_01 2022_03_02 2022_03_03 2022_03_04 2022_03_05 2022_03_06 2022_03_07 2022_03_08 2022_03_09 2022_03_10 2022_03_11 2022_03_12 2022_03_13 2022_03_14 2022_03_15 2022_03_16 2022_03_17 2022_03_18 2022_03_19 2022_03_20 2022_03_21 2022_03_22 2022_03_23 2022_03_24 2022_03_25 2022_03_26)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}     184   {txt}->{res}   18584
{txt}Number of variables            {res}     103   {txt}->{res}       4
{txt}j variable (101 values)                   ->   {res}j
{txt}xij variables:
{res}_2021_12_16 _2021_12_17 ... _2022_03_26   {txt}->   {res}_
{txt}{hline 77}
{res}{txt}file global_forecasts_deaths_lb.dta saved
{res}{text}(103 vars, 184 obs)
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}(note: j = 2021_12_16 2021_12_17 2021_12_18 2021_12_19 2021_12_20 2021_12_21 2021_12_22 2021_12_23 2021_12_24 2021_12_25 2021_12_26 2021_12_27 2021_12_28 2021_12_29 2021_12_30 2021_12_31 2022_01_01 2022_01_02 2022_01_03 2022_01_04 2022_01_05 2022_01_06 2022_01_07 2022_01_08 2022_01_09 2022_01_10 2022_01_11 2022_01_12 2022_01_13 2022_01_14 2022_01_15 2022_01_16 2022_01_17 2022_01_18 2022_01_19 2022_01_20 2022_01_21 2022_01_22 2022_01_23 2022_01_24 2022_01_25 2022_01_26 2022_01_27 2022_01_28 2022_01_29 2022_01_30 2022_01_31 2022_02_01 2022_02_02 2022_02_03 2022_02_04 2022_02_05 2022_02_06 2022_02_07 2022_02_08 2022_02_09 2022_02_10 2022_02_11 2022_02_12 2022_02_13 2022_02_14 2022_02_15 2022_02_16 2022_02_17 2022_02_18 2022_02_19 2022_02_20 2022_02_21 2022_02_22 2022_02_23 2022_02_24 2022_02_25 2022_02_26 2022_02_27 2022_02_28 2022_03_01 2022_03_02 2022_03_03 2022_03_04 2022_03_05 2022_03_06 2022_03_07 2022_03_08 2022_03_09 2022_03_10 2022_03_11 2022_03_12 2022_03_13 2022_03_14 2022_03_15 2022_03_16 2022_03_17 2022_03_18 2022_03_19 2022_03_20 2022_03_21 2022_03_22 2022_03_23 2022_03_24 2022_03_25 2022_03_26)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}     184   {txt}->{res}   18584
{txt}Number of variables            {res}     103   {txt}->{res}       4
{txt}j variable (101 values)                   ->   {res}j
{txt}xij variables:
{res}_2021_12_16 _2021_12_17 ... _2022_03_26   {txt}->   {res}_
{txt}{hline 77}
{res}{txt}file global_forecasts_deaths_ub.dta saved
{res}{text}(103 vars, 184 obs)
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}(note: j = 2021_12_16 2021_12_17 2021_12_18 2021_12_19 2021_12_20 2021_12_21 2021_12_22 2021_12_23 2021_12_24 2021_12_25 2021_12_26 2021_12_27 2021_12_28 2021_12_29 2021_12_30 2021_12_31 2022_01_01 2022_01_02 2022_01_03 2022_01_04 2022_01_05 2022_01_06 2022_01_07 2022_01_08 2022_01_09 2022_01_10 2022_01_11 2022_01_12 2022_01_13 2022_01_14 2022_01_15 2022_01_16 2022_01_17 2022_01_18 2022_01_19 2022_01_20 2022_01_21 2022_01_22 2022_01_23 2022_01_24 2022_01_25 2022_01_26 2022_01_27 2022_01_28 2022_01_29 2022_01_30 2022_01_31 2022_02_01 2022_02_02 2022_02_03 2022_02_04 2022_02_05 2022_02_06 2022_02_07 2022_02_08 2022_02_09 2022_02_10 2022_02_11 2022_02_12 2022_02_13 2022_02_14 2022_02_15 2022_02_16 2022_02_17 2022_02_18 2022_02_19 2022_02_20 2022_02_21 2022_02_22 2022_02_23 2022_02_24 2022_02_25 2022_02_26 2022_02_27 2022_02_28 2022_03_01 2022_03_02 2022_03_03 2022_03_04 2022_03_05 2022_03_06 2022_03_07 2022_03_08 2022_03_09 2022_03_10 2022_03_11 2022_03_12 2022_03_13 2022_03_14 2022_03_15 2022_03_16 2022_03_17 2022_03_18 2022_03_19 2022_03_20 2022_03_21 2022_03_22 2022_03_23 2022_03_24 2022_03_25 2022_03_26)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}     184   {txt}->{res}   18584
{txt}Number of variables            {res}     103   {txt}->{res}       4
{txt}j variable (101 values)                   ->   {res}j
{txt}xij variables:
{res}_2021_12_16 _2021_12_17 ... _2022_03_26   {txt}->   {res}_
{txt}{hline 77}
{res}{txt}file global_forecasts_cases.dta saved
{res}{text}(103 vars, 184 obs)
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}(note: j = 2021_12_16 2021_12_17 2021_12_18 2021_12_19 2021_12_20 2021_12_21 2021_12_22 2021_12_23 2021_12_24 2021_12_25 2021_12_26 2021_12_27 2021_12_28 2021_12_29 2021_12_30 2021_12_31 2022_01_01 2022_01_02 2022_01_03 2022_01_04 2022_01_05 2022_01_06 2022_01_07 2022_01_08 2022_01_09 2022_01_10 2022_01_11 2022_01_12 2022_01_13 2022_01_14 2022_01_15 2022_01_16 2022_01_17 2022_01_18 2022_01_19 2022_01_20 2022_01_21 2022_01_22 2022_01_23 2022_01_24 2022_01_25 2022_01_26 2022_01_27 2022_01_28 2022_01_29 2022_01_30 2022_01_31 2022_02_01 2022_02_02 2022_02_03 2022_02_04 2022_02_05 2022_02_06 2022_02_07 2022_02_08 2022_02_09 2022_02_10 2022_02_11 2022_02_12 2022_02_13 2022_02_14 2022_02_15 2022_02_16 2022_02_17 2022_02_18 2022_02_19 2022_02_20 2022_02_21 2022_02_22 2022_02_23 2022_02_24 2022_02_25 2022_02_26 2022_02_27 2022_02_28 2022_03_01 2022_03_02 2022_03_03 2022_03_04 2022_03_05 2022_03_06 2022_03_07 2022_03_08 2022_03_09 2022_03_10 2022_03_11 2022_03_12 2022_03_13 2022_03_14 2022_03_15 2022_03_16 2022_03_17 2022_03_18 2022_03_19 2022_03_20 2022_03_21 2022_03_22 2022_03_23 2022_03_24 2022_03_25 2022_03_26)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}     184   {txt}->{res}   18584
{txt}Number of variables            {res}     103   {txt}->{res}       4
{txt}j variable (101 values)                   ->   {res}j
{txt}xij variables:
{res}_2021_12_16 _2021_12_17 ... _2022_03_26   {txt}->   {res}_
{txt}{hline 77}
{res}{txt}file global_forecasts_cases_lb.dta saved
{res}{text}(103 vars, 184 obs)
{res}{txt}  (all {it:newnames}=={it:oldnames})
{res}{txt}(note: j = 2021_12_16 2021_12_17 2021_12_18 2021_12_19 2021_12_20 2021_12_21 2021_12_22 2021_12_23 2021_12_24 2021_12_25 2021_12_26 2021_12_27 2021_12_28 2021_12_29 2021_12_30 2021_12_31 2022_01_01 2022_01_02 2022_01_03 2022_01_04 2022_01_05 2022_01_06 2022_01_07 2022_01_08 2022_01_09 2022_01_10 2022_01_11 2022_01_12 2022_01_13 2022_01_14 2022_01_15 2022_01_16 2022_01_17 2022_01_18 2022_01_19 2022_01_20 2022_01_21 2022_01_22 2022_01_23 2022_01_24 2022_01_25 2022_01_26 2022_01_27 2022_01_28 2022_01_29 2022_01_30 2022_01_31 2022_02_01 2022_02_02 2022_02_03 2022_02_04 2022_02_05 2022_02_06 2022_02_07 2022_02_08 2022_02_09 2022_02_10 2022_02_11 2022_02_12 2022_02_13 2022_02_14 2022_02_15 2022_02_16 2022_02_17 2022_02_18 2022_02_19 2022_02_20 2022_02_21 2022_02_22 2022_02_23 2022_02_24 2022_02_25 2022_02_26 2022_02_27 2022_02_28 2022_03_01 2022_03_02 2022_03_03 2022_03_04 2022_03_05 2022_03_06 2022_03_07 2022_03_08 2022_03_09 2022_03_10 2022_03_11 2022_03_12 2022_03_13 2022_03_14 2022_03_15 2022_03_16 2022_03_17 2022_03_18 2022_03_19 2022_03_20 2022_03_21 2022_03_22 2022_03_23 2022_03_24 2022_03_25 2022_03_26)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}     184   {txt}->{res}   18584
{txt}Number of variables            {res}     103   {txt}->{res}       4
{txt}j variable (101 values)                   ->   {res}j
{txt}xij variables:
{res}_2021_12_16 _2021_12_17 ... _2022_03_26   {txt}->   {res}_
{txt}{hline 77}
{res}{txt}file global_forecasts_cases_ub.dta saved

{com}. *
. 
. 
. use global_forecasts_deaths, clear
{txt}
{com}. 
. merge 1:1 date country using global_forecasts_deaths_lb
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          18,584{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. 
. merge 1:1 date country using global_forecasts_deaths_ub
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          18,584{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. 
. merge 1:1 date country using global_forecasts_cases
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          18,584{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. 
. merge 1:1 date country using global_forecasts_cases_lb
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          18,584{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. 
. merge 1:1 date country using global_forecasts_cases_ub
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          18,584{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. 
. 
. rename global_forecasts_deaths_lb TotDeaLoRaA05S00      
{res}{txt}
{com}. rename global_forecasts_deaths_ub TotDeaUpRaA05S00      
{res}{txt}
{com}. rename global_forecasts_deaths    TotDeaMeRaA05S00
{res}{txt}
{com}. rename global_forecasts_cases_lb  TotCasLoRaA05S00
{res}{txt}
{com}. rename global_forecasts_cases_ub  TotCasUpRaA05S00      
{res}{txt}
{com}. rename global_forecasts_cases     TotCasMeRaA05S00
{res}{txt}
{com}. 
. label var TotDeaMeRaA05S00 "Total Deaths Mean SRIV"
{txt}
{com}. label var TotDeaLoRaA05S00 "Total Deaths Lower SRIV"
{txt}
{com}. label var TotDeaUpRaA05S00 "Total Deaths Upper SRIV"
{txt}
{com}. label var TotCasMeRaA05S00 "Total Cases Mean SRIV"
{txt}
{com}. label var TotCasLoRaA05S00 "Total Cases Lower SRIV"
{txt}
{com}. label var TotCasUpRaA05S00 "Total Cases Upper SRIV"
{txt}
{com}. 
. 
. save "SRIV.dta", replace
{txt}file SRIV.dta saved

{com}. 
. 
. 
. 
. 
. * gen one file for each country with original vars for all countries
. 
. clear 
{txt}
{com}. use "SRIV.dta", clear
{txt}
{com}. levelsof country, local(levels)
{txt}`"Afghanistan"' `"Albania"' `"Algeria"' `"Andorra"' `"Angola"' `"Antigua and Barbuda"' `"Argentina"' `"Armenia"' `"Australia"' `"Austria"' `"Azerbaijan"' `"Bahrain"' `"Bangladesh"' `"Barbados"' `"Belarus"' `"Belgium"' `"Belize"' `"Benin"' `"Bhutan"' `"Bolivia"' `"Bosnia and Herzegovina"' `"Botswana"' `"Brazil"' `"Brunei"' `"Bulgaria"' `"Burkina Faso"' `"Burundi"' `"Cambodia"' `"Cameroon"' `"Canada"' `"Cape Verde"' `"Central African Republic"' `"Chad"' `"Chile"' `"China"' `"Colombia"' `"Congo"' `"Costa Rica"' `"Cote d'Ivoire"' `"Croatia"' `"Cuba"' `"Cyprus"' `"Czech Republic"' `"Democratic Republic of the Congo"' `"Denmark"' `"Diamond Princess"' `"Djibouti"' `"Dominica"' `"Dominican Republic"' `"Ecuador"' `"Egypt"' `"El Salvador"' `"Equatorial Guinea"' `"Eritrea"' `"Estonia"' `"Eswatini"' `"Ethiopia"' `"Fiji"' `"Finland"' `"France"' `"Gabon"' `"Georgia"' `"Germany"' `"Ghana"' `"Greece"' `"Grenada"' `"Guatemala"' `"Guinea"' `"Guinea-Bissau"' `"Guyana"' `"Haiti"' `"Holy See"' `"Honduras"' `"Hungary"' `"Iceland"' `"India"' `"Indonesia"' `"Iran"' `"Iraq"' `"Ireland"' `"Israel"' `"Italy"' `"Jamaica"' `"Japan"' `"Jordan"' `"Kazakhstan"' `"Kenya"' `"Kosovo"' `"Kuwait"' `"Kyrgyzstan"' `"Laos"' `"Latvia"' `"Lebanon"' `"Liberia"' `"Libya"' `"Liechtenstein"' `"Lithuania"' `"Luxembourg"' `"MS Zaandam"' `"Macedonia"' `"Madagascar"' `"Malawi"' `"Malaysia"' `"Maldives"' `"Mali"' `"Malta"' `"Mauritania"' `"Mauritius"' `"Mexico"' `"Moldova"' `"Monaco"' `"Mongolia"' `"Montenegro"' `"Morocco"' `"Mozambique"' `"Myanmar"' `"Namibia"' `"Nepal"' `"Netherlands"' `"New Zealand"' `"Nicaragua"' `"Niger"' `"Nigeria"' `"Norway"' `"Oman"' `"Pakistan"' `"Panama"' `"Papua New Guinea"' `"Paraguay"' `"Peru"' `"Philippines"' `"Poland"' `"Portugal"' `"Qatar"' `"Romania"' `"Russian Federation"' `"Rwanda"' `"Saint Kitts and Nevis"' `"Saint Lucia"' `"Saint Vincent and the Grenadines"' `"San Marino"' `"Sao Tome and Principe"' `"Saudi Arabia"' `"Senegal"' `"Serbia"' `"Seychelles"' `"Sierra Leone"' `"Singapore"' `"Slovakia"' `"Slovenia"' `"Somalia"' `"South Africa"' `"South Korea"' `"South Sudan"' `"Spain"' `"Sri Lanka"' `"Sudan"' `"Suriname"' `"Sweden"' `"Switzerland"' `"Syria"' `"Tanzania"' `"Thailand"' `"The Bahamas"' `"The Gambia"' `"Timor-Leste"' `"Togo"' `"Trinidad and Tobago"' `"Tunisia"' `"Turkey"' `"Uganda"' `"Ukraine"' `"United Arab Emirates"' `"United Kingdom"' `"United States"' `"Uruguay"' `"Uzbekistan"' `"Venezuela"' `"Vietnam"' `"West Bank and Gaza"' `"Western Sahara"' `"Yemen"' `"Zambia"' `"Zimbabwe"'

{com}. 
. 
. foreach l of local levels {c -(}
{txt}  2{com}.         use "SRIV.dta", clear
{txt}  3{com}.         di "`l'"
{txt}  4{com}.         keep if country == "`l'"
{txt}  5{com}.     save "`l'", replace
{txt}  6{com}. {c )-}
Afghanistan
{txt}(18,483 observations deleted)
file Afghanistan.dta saved
Albania
(18,483 observations deleted)
file Albania.dta saved
Algeria
(18,483 observations deleted)
file Algeria.dta saved
Andorra
(18,483 observations deleted)
file Andorra.dta saved
Angola
(18,483 observations deleted)
file Angola.dta saved
Antigua and Barbuda
(18,483 observations deleted)
file Antigua and Barbuda.dta saved
Argentina
(18,483 observations deleted)
file Argentina.dta saved
Armenia
(18,483 observations deleted)
file Armenia.dta saved
Australia
(18,483 observations deleted)
file Australia.dta saved
Austria
(18,483 observations deleted)
file Austria.dta saved
Azerbaijan
(18,483 observations deleted)
file Azerbaijan.dta saved
Bahrain
(18,483 observations deleted)
file Bahrain.dta saved
Bangladesh
(18,483 observations deleted)
file Bangladesh.dta saved
Barbados
(18,483 observations deleted)
file Barbados.dta saved
Belarus
(18,483 observations deleted)
file Belarus.dta saved
Belgium
(18,483 observations deleted)
file Belgium.dta saved
Belize
(18,483 observations deleted)
file Belize.dta saved
Benin
(18,483 observations deleted)
file Benin.dta saved
Bhutan
(18,483 observations deleted)
file Bhutan.dta saved
Bolivia
(18,483 observations deleted)
file Bolivia.dta saved
Bosnia and Herzegovina
(18,483 observations deleted)
file Bosnia and Herzegovina.dta saved
Botswana
(18,483 observations deleted)
file Botswana.dta saved
Brazil
(18,483 observations deleted)
file Brazil.dta saved
Brunei
(18,483 observations deleted)
file Brunei.dta saved
Bulgaria
(18,483 observations deleted)
file Bulgaria.dta saved
Burkina Faso
(18,483 observations deleted)
file Burkina Faso.dta saved
Burundi
(18,483 observations deleted)
file Burundi.dta saved
Cambodia
(18,483 observations deleted)
file Cambodia.dta saved
Cameroon
(18,483 observations deleted)
file Cameroon.dta saved
Canada
(18,483 observations deleted)
file Canada.dta saved
Cape Verde
(18,483 observations deleted)
file Cape Verde.dta saved
Central African Republic
(18,483 observations deleted)
file Central African Republic.dta saved
Chad
(18,483 observations deleted)
file Chad.dta saved
Chile
(18,483 observations deleted)
file Chile.dta saved
China
(18,483 observations deleted)
file China.dta saved
Colombia
(18,483 observations deleted)
file Colombia.dta saved
Congo
(18,483 observations deleted)
file Congo.dta saved
Costa Rica
(18,483 observations deleted)
file Costa Rica.dta saved
Cote d'Ivoire
(18,483 observations deleted)
file Cote d'Ivoire.dta saved
Croatia
(18,483 observations deleted)
file Croatia.dta saved
Cuba
(18,483 observations deleted)
file Cuba.dta saved
Cyprus
(18,483 observations deleted)
file Cyprus.dta saved
Czech Republic
(18,483 observations deleted)
file Czech Republic.dta saved
Democratic Republic of the Congo
(18,483 observations deleted)
file Democratic Republic of the Congo.dta saved
Denmark
(18,483 observations deleted)
file Denmark.dta saved
Diamond Princess
(18,483 observations deleted)
file Diamond Princess.dta saved
Djibouti
(18,483 observations deleted)
file Djibouti.dta saved
Dominica
(18,483 observations deleted)
file Dominica.dta saved
Dominican Republic
(18,483 observations deleted)
file Dominican Republic.dta saved
Ecuador
(18,483 observations deleted)
file Ecuador.dta saved
Egypt
(18,483 observations deleted)
file Egypt.dta saved
El Salvador
(18,483 observations deleted)
file El Salvador.dta saved
Equatorial Guinea
(18,483 observations deleted)
file Equatorial Guinea.dta saved
Eritrea
(18,483 observations deleted)
file Eritrea.dta saved
Estonia
(18,483 observations deleted)
file Estonia.dta saved
Eswatini
(18,483 observations deleted)
file Eswatini.dta saved
Ethiopia
(18,483 observations deleted)
file Ethiopia.dta saved
Fiji
(18,483 observations deleted)
file Fiji.dta saved
Finland
(18,483 observations deleted)
file Finland.dta saved
France
(18,483 observations deleted)
file France.dta saved
Gabon
(18,483 observations deleted)
file Gabon.dta saved
Georgia
(18,483 observations deleted)
file Georgia.dta saved
Germany
(18,483 observations deleted)
file Germany.dta saved
Ghana
(18,483 observations deleted)
file Ghana.dta saved
Greece
(18,483 observations deleted)
file Greece.dta saved
Grenada
(18,483 observations deleted)
file Grenada.dta saved
Guatemala
(18,483 observations deleted)
file Guatemala.dta saved
Guinea
(18,483 observations deleted)
file Guinea.dta saved
Guinea-Bissau
(18,483 observations deleted)
file Guinea-Bissau.dta saved
Guyana
(18,483 observations deleted)
file Guyana.dta saved
Haiti
(18,483 observations deleted)
file Haiti.dta saved
Holy See
(18,483 observations deleted)
file Holy See.dta saved
Honduras
(18,483 observations deleted)
file Honduras.dta saved
Hungary
(18,483 observations deleted)
file Hungary.dta saved
Iceland
(18,483 observations deleted)
file Iceland.dta saved
India
(18,483 observations deleted)
file India.dta saved
Indonesia
(18,483 observations deleted)
file Indonesia.dta saved
Iran
(18,483 observations deleted)
file Iran.dta saved
Iraq
(18,483 observations deleted)
file Iraq.dta saved
Ireland
(18,483 observations deleted)
file Ireland.dta saved
Israel
(18,483 observations deleted)
file Israel.dta saved
Italy
(18,483 observations deleted)
file Italy.dta saved
Jamaica
(18,483 observations deleted)
file Jamaica.dta saved
Japan
(18,483 observations deleted)
file Japan.dta saved
Jordan
(18,483 observations deleted)
file Jordan.dta saved
Kazakhstan
(18,483 observations deleted)
file Kazakhstan.dta saved
Kenya
(18,483 observations deleted)
file Kenya.dta saved
Kosovo
(18,483 observations deleted)
file Kosovo.dta saved
Kuwait
(18,483 observations deleted)
file Kuwait.dta saved
Kyrgyzstan
(18,483 observations deleted)
file Kyrgyzstan.dta saved
Laos
(18,483 observations deleted)
file Laos.dta saved
Latvia
(18,483 observations deleted)
file Latvia.dta saved
Lebanon
(18,483 observations deleted)
file Lebanon.dta saved
Liberia
(18,483 observations deleted)
file Liberia.dta saved
Libya
(18,483 observations deleted)
file Libya.dta saved
Liechtenstein
(18,483 observations deleted)
file Liechtenstein.dta saved
Lithuania
(18,483 observations deleted)
file Lithuania.dta saved
Luxembourg
(18,483 observations deleted)
file Luxembourg.dta saved
MS Zaandam
(18,483 observations deleted)
file MS Zaandam.dta saved
Macedonia
(18,483 observations deleted)
file Macedonia.dta saved
Madagascar
(18,483 observations deleted)
file Madagascar.dta saved
Malawi
(18,483 observations deleted)
file Malawi.dta saved
Malaysia
(18,483 observations deleted)
file Malaysia.dta saved
Maldives
(18,483 observations deleted)
file Maldives.dta saved
Mali
(18,483 observations deleted)
file Mali.dta saved
Malta
(18,483 observations deleted)
file Malta.dta saved
Mauritania
(18,483 observations deleted)
file Mauritania.dta saved
Mauritius
(18,483 observations deleted)
file Mauritius.dta saved
Mexico
(18,483 observations deleted)
file Mexico.dta saved
Moldova
(18,483 observations deleted)
file Moldova.dta saved
Monaco
(18,483 observations deleted)
file Monaco.dta saved
Mongolia
(18,483 observations deleted)
file Mongolia.dta saved
Montenegro
(18,483 observations deleted)
file Montenegro.dta saved
Morocco
(18,483 observations deleted)
file Morocco.dta saved
Mozambique
(18,483 observations deleted)
file Mozambique.dta saved
Myanmar
(18,483 observations deleted)
file Myanmar.dta saved
Namibia
(18,483 observations deleted)
file Namibia.dta saved
Nepal
(18,483 observations deleted)
file Nepal.dta saved
Netherlands
(18,483 observations deleted)
file Netherlands.dta saved
New Zealand
(18,483 observations deleted)
file New Zealand.dta saved
Nicaragua
(18,483 observations deleted)
file Nicaragua.dta saved
Niger
(18,483 observations deleted)
file Niger.dta saved
Nigeria
(18,483 observations deleted)
file Nigeria.dta saved
Norway
(18,483 observations deleted)
file Norway.dta saved
Oman
(18,483 observations deleted)
file Oman.dta saved
Pakistan
(18,483 observations deleted)
file Pakistan.dta saved
Panama
(18,483 observations deleted)
file Panama.dta saved
Papua New Guinea
(18,483 observations deleted)
file Papua New Guinea.dta saved
Paraguay
(18,483 observations deleted)
file Paraguay.dta saved
Peru
(18,483 observations deleted)
file Peru.dta saved
Philippines
(18,483 observations deleted)
file Philippines.dta saved
Poland
(18,483 observations deleted)
file Poland.dta saved
Portugal
(18,483 observations deleted)
file Portugal.dta saved
Qatar
(18,483 observations deleted)
file Qatar.dta saved
Romania
(18,483 observations deleted)
file Romania.dta saved
Russian Federation
(18,483 observations deleted)
file Russian Federation.dta saved
Rwanda
(18,483 observations deleted)
file Rwanda.dta saved
Saint Kitts and Nevis
(18,483 observations deleted)
file Saint Kitts and Nevis.dta saved
Saint Lucia
(18,483 observations deleted)
file Saint Lucia.dta saved
Saint Vincent and the Grenadines
(18,483 observations deleted)
file Saint Vincent and the Grenadines.dta saved
San Marino
(18,483 observations deleted)
file San Marino.dta saved
Sao Tome and Principe
(18,483 observations deleted)
file Sao Tome and Principe.dta saved
Saudi Arabia
(18,483 observations deleted)
file Saudi Arabia.dta saved
Senegal
(18,483 observations deleted)
file Senegal.dta saved
Serbia
(18,483 observations deleted)
file Serbia.dta saved
Seychelles
(18,483 observations deleted)
file Seychelles.dta saved
Sierra Leone
(18,483 observations deleted)
file Sierra Leone.dta saved
Singapore
(18,483 observations deleted)
file Singapore.dta saved
Slovakia
(18,483 observations deleted)
file Slovakia.dta saved
Slovenia
(18,483 observations deleted)
file Slovenia.dta saved
Somalia
(18,483 observations deleted)
file Somalia.dta saved
South Africa
(18,483 observations deleted)
file South Africa.dta saved
South Korea
(18,483 observations deleted)
file South Korea.dta saved
South Sudan
(18,483 observations deleted)
file South Sudan.dta saved
Spain
(18,483 observations deleted)
file Spain.dta saved
Sri Lanka
(18,483 observations deleted)
file Sri Lanka.dta saved
Sudan
(18,483 observations deleted)
file Sudan.dta saved
Suriname
(18,483 observations deleted)
file Suriname.dta saved
Sweden
(18,483 observations deleted)
file Sweden.dta saved
Switzerland
(18,483 observations deleted)
file Switzerland.dta saved
Syria
(18,483 observations deleted)
file Syria.dta saved
Tanzania
(18,483 observations deleted)
file Tanzania.dta saved
Thailand
(18,483 observations deleted)
file Thailand.dta saved
The Bahamas
(18,483 observations deleted)
file The Bahamas.dta saved
The Gambia
(18,483 observations deleted)
file The Gambia.dta saved
Timor-Leste
(18,483 observations deleted)
file Timor-Leste.dta saved
Togo
(18,483 observations deleted)
file Togo.dta saved
Trinidad and Tobago
(18,483 observations deleted)
file Trinidad and Tobago.dta saved
Tunisia
(18,483 observations deleted)
file Tunisia.dta saved
Turkey
(18,483 observations deleted)
file Turkey.dta saved
Uganda
(18,483 observations deleted)
file Uganda.dta saved
Ukraine
(18,483 observations deleted)
file Ukraine.dta saved
United Arab Emirates
(18,483 observations deleted)
file United Arab Emirates.dta saved
United Kingdom
(18,483 observations deleted)
file United Kingdom.dta saved
United States
(18,483 observations deleted)
file United States.dta saved
Uruguay
(18,483 observations deleted)
file Uruguay.dta saved
Uzbekistan
(18,483 observations deleted)
file Uzbekistan.dta saved
Venezuela
(18,483 observations deleted)
file Venezuela.dta saved
Vietnam
(18,483 observations deleted)
file Vietnam.dta saved
West Bank and Gaza
(18,483 observations deleted)
file West Bank and Gaza.dta saved
Western Sahara
(18,483 observations deleted)
file Western Sahara.dta saved
Yemen
(18,483 observations deleted)
file Yemen.dta saved
Zambia
(18,483 observations deleted)
file Zambia.dta saved
Zimbabwe
(18,483 observations deleted)
file Zimbabwe.dta saved

{com}. *
. 
. 
. * use the single files for each country for formatting the date 
. 
. 
. clear 
{txt}
{com}. use "SRIV.dta", clear
{txt}
{com}. levelsof country, local(levels)
{txt}`"Afghanistan"' `"Albania"' `"Algeria"' `"Andorra"' `"Angola"' `"Antigua and Barbuda"' `"Argentina"' `"Armenia"' `"Australia"' `"Austria"' `"Azerbaijan"' `"Bahrain"' `"Bangladesh"' `"Barbados"' `"Belarus"' `"Belgium"' `"Belize"' `"Benin"' `"Bhutan"' `"Bolivia"' `"Bosnia and Herzegovina"' `"Botswana"' `"Brazil"' `"Brunei"' `"Bulgaria"' `"Burkina Faso"' `"Burundi"' `"Cambodia"' `"Cameroon"' `"Canada"' `"Cape Verde"' `"Central African Republic"' `"Chad"' `"Chile"' `"China"' `"Colombia"' `"Congo"' `"Costa Rica"' `"Cote d'Ivoire"' `"Croatia"' `"Cuba"' `"Cyprus"' `"Czech Republic"' `"Democratic Republic of the Congo"' `"Denmark"' `"Diamond Princess"' `"Djibouti"' `"Dominica"' `"Dominican Republic"' `"Ecuador"' `"Egypt"' `"El Salvador"' `"Equatorial Guinea"' `"Eritrea"' `"Estonia"' `"Eswatini"' `"Ethiopia"' `"Fiji"' `"Finland"' `"France"' `"Gabon"' `"Georgia"' `"Germany"' `"Ghana"' `"Greece"' `"Grenada"' `"Guatemala"' `"Guinea"' `"Guinea-Bissau"' `"Guyana"' `"Haiti"' `"Holy See"' `"Honduras"' `"Hungary"' `"Iceland"' `"India"' `"Indonesia"' `"Iran"' `"Iraq"' `"Ireland"' `"Israel"' `"Italy"' `"Jamaica"' `"Japan"' `"Jordan"' `"Kazakhstan"' `"Kenya"' `"Kosovo"' `"Kuwait"' `"Kyrgyzstan"' `"Laos"' `"Latvia"' `"Lebanon"' `"Liberia"' `"Libya"' `"Liechtenstein"' `"Lithuania"' `"Luxembourg"' `"MS Zaandam"' `"Macedonia"' `"Madagascar"' `"Malawi"' `"Malaysia"' `"Maldives"' `"Mali"' `"Malta"' `"Mauritania"' `"Mauritius"' `"Mexico"' `"Moldova"' `"Monaco"' `"Mongolia"' `"Montenegro"' `"Morocco"' `"Mozambique"' `"Myanmar"' `"Namibia"' `"Nepal"' `"Netherlands"' `"New Zealand"' `"Nicaragua"' `"Niger"' `"Nigeria"' `"Norway"' `"Oman"' `"Pakistan"' `"Panama"' `"Papua New Guinea"' `"Paraguay"' `"Peru"' `"Philippines"' `"Poland"' `"Portugal"' `"Qatar"' `"Romania"' `"Russian Federation"' `"Rwanda"' `"Saint Kitts and Nevis"' `"Saint Lucia"' `"Saint Vincent and the Grenadines"' `"San Marino"' `"Sao Tome and Principe"' `"Saudi Arabia"' `"Senegal"' `"Serbia"' `"Seychelles"' `"Sierra Leone"' `"Singapore"' `"Slovakia"' `"Slovenia"' `"Somalia"' `"South Africa"' `"South Korea"' `"South Sudan"' `"Spain"' `"Sri Lanka"' `"Sudan"' `"Suriname"' `"Sweden"' `"Switzerland"' `"Syria"' `"Tanzania"' `"Thailand"' `"The Bahamas"' `"The Gambia"' `"Timor-Leste"' `"Togo"' `"Trinidad and Tobago"' `"Tunisia"' `"Turkey"' `"Uganda"' `"Ukraine"' `"United Arab Emirates"' `"United Kingdom"' `"United States"' `"Uruguay"' `"Uzbekistan"' `"Venezuela"' `"Vietnam"' `"West Bank and Gaza"' `"Western Sahara"' `"Yemen"' `"Zambia"' `"Zimbabwe"'

{com}. 
. 
. foreach l of local levels {c -(}
{txt}  2{com}.         use "`l'", clear
{txt}  3{com}.         di "`l'"
{txt}  4{com}.         gen day1 = date[1]
{txt}  5{com}.         
.         gen year = substr(day1,1,4) 
{txt}  6{com}.         gen month = substr(day1,6,2) 
{txt}  7{com}.         gen day = substr(day1,9,2) 
{txt}  8{com}.         egen date2 = concat(day month year)
{txt}  9{com}.         gen day1b = date(date2, "DMY", 2050)
{txt} 10{com}.         format day1b %tdDDMonCCYY
{txt} 11{com}.         codebook day1b
{txt} 12{com}.         drop day1 year month day date2
{txt} 13{com}.         
.         bysort country: gen n = _n
{txt} 14{com}.         bysort country: replace day1b = day1b[n] + n - 1
{txt} 15{com}.         drop n
{txt} 16{com}.         drop date
{txt} 17{com}.         rename day1b date
{txt} 18{com}.         
.         
.         local list2 ///
>         DeaMeRaA05S00 DeaLoRaA05S00 DeaUpRaA05S00 ///
>         CasMeRaA05S00 CasLoRaA05S00 CasUpRaA05S00 
{txt} 19{com}.         
.         foreach s of local list2 {c -(}
{txt} 20{com}.                 bysort country: gen Day`s' =  Tot`s'[_n] - Tot`s'[_n-1] // genn1
{txt} 21{com}.         {c )-}
{txt} 22{com}.         *
.         
.         
.         label var DayDeaMeRaA05S00 "Daily Deaths Mean SRIV"
{txt} 23{com}.         label var DayDeaLoRaA05S00 "Daily Deaths Lower SRIV"
{txt} 24{com}.         label var DayDeaUpRaA05S00 "Daily Deaths Upper SRIV"
{txt} 25{com}.         label var DayCasMeRaA05S00 "Daily Cases Mean SRIV"
{txt} 26{com}.         label var DayCasLoRaA05S00 "Daily Cases Lower SRIV"
{txt} 27{com}.         label var DayCasUpRaA05S00 "Daily Cases Upper SRIV"
{txt} 28{com}.         
.         
.         * gen "Daily cases mean div by daily deaths mean SRIV  DayCbD" for visulization of temporal relation of deaths and cases peaks 
.         
.         
.         summ DayDeaMeRaA05S00 
{txt} 29{com}.         gen DayDeMMeRaA05S00   = r(mean)
{txt} 30{com}.         label var DayDeMMeRaA05S00   "Daily deaths mean SRIV  DayDeM"
{txt} 31{com}.         
.         summ DayCasMeRaA05S00   
{txt} 32{com}.         gen DayCaMMeRaA05S00   = r(mean)
{txt} 33{com}.         label var DayCaMMeRaA05S00   "Daily cases mean SRIV  DayCaM"
{txt} 34{com}.                                                            
.         gen DayCbDMeRaA05S00   = DayCaMMeRaA05S00   / DayDeMMeRaA05S00  
{txt} 35{com}.         label var DayCbDMeRaA05S00   "Daily cases mean div by daily deaths mean SRIV  DayCbD"
{txt} 36{com}.         summ DayCbDMeRaA05S00  
{txt} 37{com}.                                                                                                   
.         gen DayDMuMeRaA05S00   = DayDeaMeRaA05S00   * DayCbDMeRaA05S00  
{txt} 38{com}.         label var DayDMuMeRaA05S00   "Daily deaths scaled (times means of cases by deaths) SRIV"
{txt} 39{com}.         summ DayDMuMeRaA05S00  
{txt} 40{com}.                         
.         
.         save "`l'", replace
{txt} 41{com}. {c )-}
Afghanistan

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100          .4    .5504819          0          2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        4.75    4.761748          0         18

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101      11.875           0     11.875     11.875
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        4.75    6.536972          0      23.75
{txt}file Afghanistan.dta saved
Albania

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        1.55    1.048086          0          4

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       102.4    80.20894         14        277

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    66.06452           0   66.06452   66.06452
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       102.4    69.24132          0   264.2581
{txt}file Albania.dta saved
Algeria

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        9.91    .9330627          7         11

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      201.84    18.56015         40        218

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    20.36731           0   20.36731   20.36731
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      201.84    19.00397   142.5711   224.0404
{txt}file Algeria.dta saved
Andorra

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .14    .3487351          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       27.37    42.40894          0        165

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101       195.5           0      195.5      195.5
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       27.37    68.17771          0      195.5
{txt}file Andorra.dta saved
Angola

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .52     .540856          0          2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       90.28    56.99142       -104        205

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    173.6154           0   173.6154   173.6154
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       90.28    93.90093          0   347.2308
{txt}file Angola.dta saved
Antigua and Barbuda

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        1.89     1.93268          0          5

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      186.37    157.1981          3        450

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    98.60847           0   98.60847   98.60847
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      186.37    190.5786          0   493.0423
{txt}file Antigua and Barbuda.dta saved
Argentina

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       91.29     39.4237         20        137

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      6816.5    2362.998       2644      10073

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    74.66864           0   74.66864   74.66864
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      6816.5    2943.714   1493.373    10229.6
{txt}file Argentina.dta saved
Armenia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         2.4    3.434819          0         14

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       26.77    41.21264          0        165

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    11.15417           0   11.15417   11.15417
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       26.77    38.31254          0   156.1583
{txt}file Armenia.dta saved
Australia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       41.86    26.62953          7         77

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     8675.32     4170.07      -1959      14386

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    207.2461           0   207.2461   207.2461
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     8675.32    5518.865   1450.722   15957.95
{txt}file Australia.dta saved
Austria

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        6.11    11.59406          0         48

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      176.67    447.0987          0       2362

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    28.91489           0   28.91489   28.91489
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      176.67    335.2409          0   1387.915
{txt}file Austria.dta saved
Azerbaijan

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        4.77    5.110605          0         17

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      194.24    245.1054          3        896

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    40.72118           0   40.72118   40.72118
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      194.24    208.1098          0     692.26
{txt}file Azerbaijan.dta saved
Bahrain

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       108.2    51.62002       -190        175
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Bahrain.dta saved
Bangladesh

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        5.97    1.513942          3          8

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       353.7    111.1001        146        487

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    59.24623           0   59.24623   59.24623
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       353.7    89.69536   177.7387   473.9699
{txt}file Bangladesh.dta saved
Barbados

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100          .3    .5025189          0          2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       11.63    15.85646          0         63

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    38.76667           0   38.76667   38.76667
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       11.63    19.48098          0   77.53333
{txt}file Barbados.dta saved
Belarus

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        6.98    4.561543          0         15

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      463.84    429.3964         27       1394

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    66.45272           0   66.45272   66.45272
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      463.84     303.127          0   996.7908
{txt}file Belarus.dta saved
Belgium

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       12.66    15.81728          0         49

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     1641.63    2735.218          2      14196

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    129.6706           0   129.6706   129.6706
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     1641.63    2051.036          0    6353.86
{txt}file Belgium.dta saved
Belize

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .17    .3775252          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        5.08    7.041981          0         28

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    29.88235           0   29.88235   29.88235
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        5.08    11.28134          0   29.88235
{txt}file Belize.dta saved
Benin

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100          .7    .5412294          0          2
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Benin.dta saved
Bhutan

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        -.11    2.335043        -23          1
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Bhutan.dta saved
Bolivia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       32.07    10.82483         12         45

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     2426.98    401.6714       1559       2923

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    75.67758           0   75.67758   75.67758
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     2426.98    819.1967    908.131   3405.491
{txt}file Bolivia.dta saved
Bosnia and Herzegovina

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       13.87    7.736383          4         31

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      197.65    112.8496         62        447

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    14.25018           0   14.25018   14.25018
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      197.65    110.2448   57.00072   441.7556
{txt}file Bosnia and Herzegovina.dta saved
Botswana

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        3.41    3.159386          0         10

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     1516.14    947.5497      -3251       2644

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    444.6158           0   444.6158   444.6158
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     1516.14    1404.713          0   4446.158
{txt}file Botswana.dta saved
Brazil

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       43.47     57.0069          1        166

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      512.98    717.9641         24       3060

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    11.80078           0   11.80078   11.80078
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      512.98     672.726   11.80078    1958.93
{txt}file Brazil.dta saved
Brunei

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .01          .1          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100           1    2.558409          0         19

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101         100           0        100        100
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100           1          10          0        100
{txt}file Brunei.dta saved
Bulgaria

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       28.54    23.06093          3         84

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      426.39    392.2875         36       1376

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    14.94008           0   14.94008   14.94008
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      426.39    344.5322   44.82025   1254.967
{txt}file Bulgaria.dta saved
Burkina Faso

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        1.78    .5787482          0          3

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       33.33    6.271718         23         47

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    18.72472           0   18.72472   18.72472
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       33.33     10.8369          0   56.17416
{txt}file Burkina Faso.dta saved
Burundi

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     1686.54    2109.194       -361       7286
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Burundi.dta saved
Cambodia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .44    .7152029          0          3

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        1.55    2.512092          0         10

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    3.522727           0   3.522727   3.522727
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        1.55    2.519465          0   10.56818
{txt}file Cambodia.dta saved
Cameroon

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .22    .4836728          0          2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        2.23    3.617731          0         15

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    10.13636           0   10.13636   10.13636
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        2.23    4.902684          0   20.27273
{txt}file Cameroon.dta saved
Canada

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       58.24    28.07714         18        100

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     7314.53    4227.544        690      13287

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    125.5929           0   125.5929   125.5929
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     7314.53    3526.289   2260.672   12559.29
{txt}file Canada.dta saved
Cape Verde

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .07    .2564324          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        2.95    4.557988        -33          9

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    42.14286           0   42.14286   42.14286
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        2.95    10.80679          0   42.14286
{txt}file Cape Verde.dta saved
Central African Republic

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        -.35         3.5        -35          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Central African Republic.dta saved
Chad

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        -.04          .4         -4          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Chad.dta saved
Chile

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        8.79    7.143967          1         26

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      388.17    339.2757         59       1380

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    44.16041           0   44.16041   44.16041
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      388.17    315.4805   44.16041   1148.171
{txt}file Chile.dta saved
China

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      190.73    81.18888        -63        344
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file China.dta saved
Colombia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       28.95    6.944768         21         46

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     1209.54    231.2226        927       1790

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    41.78031           0   41.78031   41.78031
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     1209.54    290.1546   877.3865   1921.894
{txt}file Colombia.dta saved
Congo

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .09    .2876235          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100         .17    17.19059       -166         14

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    1.888889           0   1.888889   1.888889
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100         .17    .5432888          0   1.888889
{txt}file Congo.dta saved
Costa Rica

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .53    .6105967          0          2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       26.49    12.24703         16         66

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    49.98113           0   49.98113   49.98113
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       26.49    30.51831          0   99.96227
{txt}file Costa Rica.dta saved
Cote d'Ivoire

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .46    .5206833          0          2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       87.86    57.08014         17        209

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101         191           0        191        191
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       87.86    99.45051          0        382
{txt}file Cote d'Ivoire.dta saved
Croatia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       18.86    16.07056          2         54

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      788.25    769.4766         68       2792

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101     41.7948           0    41.7948    41.7948
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      788.25    671.6661   83.58961   2256.919
{txt}file Croatia.dta saved
Cuba

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .08    .2726599          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       10.06    13.87085          0         54

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101      125.75           0     125.75     125.75
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       10.06    34.28699          0     125.75
{txt}file Cuba.dta saved
Cyprus

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        1.18     .936143          0          3

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      148.58    169.3648          4        554

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    125.9153           0   125.9153   125.9153
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      148.58    117.8747          0   377.7458
{txt}file Cyprus.dta saved
Czech Republic

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        73.1    56.14007          0        153

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     6461.45    7298.306         14      19505

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    88.39193           0   88.39193   88.39193
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     6461.45    4962.329          0   13523.96
{txt}file Czech Republic.dta saved
Democratic Republic of the Congo

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100      317.72    482.0624          0       1980

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100    26639.91    37244.61      -2389     129332

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    83.84713           0   83.84713   83.84713
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100    26639.91    40419.55          0   166017.3
{txt}file Democratic Republic of the Congo.dta saved
Denmark

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       16.08    18.32517          0         55

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     4103.17    6637.387          0      20276

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    255.1723           0   255.1723   255.1723
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     4103.17    4676.074          0   14034.47
{txt}file Denmark.dta saved
Diamond Princess

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100           0           0          0          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Diamond Princess.dta saved
Djibouti

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .14    .3487351          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        -.54    14.93516       -148          4

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101   -3.857143           0  -3.857143  -3.857143
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        -.54    1.345121  -3.857143          0
{txt}file Djibouti.dta saved
Dominica

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .03    .1714466          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        1.11     2.13151         -5          9

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101          37           0         37         37
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        1.11    6.343524          0         37
{txt}file Dominica.dta saved
Dominican Republic

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .13    .3379977          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       38.07    47.54504          1        184

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    292.8462           0   292.8462   292.8462
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       38.07    98.98132          0   292.8462
{txt}file Dominican Republic.dta saved
Ecuador

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       84.63    34.76346         22        151

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     1763.11    617.3032        824       3025

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    20.83316           0   20.83316   20.83316
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     1763.11    724.2326   458.3294   3145.807
{txt}file Ecuador.dta saved
Egypt

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       30.42    15.31302          6         51

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      337.34     249.591         39        818

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    11.08941           0   11.08941   11.08941
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      337.34    169.8124   66.53648   565.5601
{txt}file Egypt.dta saved
El Salvador

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       10.29    6.394908          1         23

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100         686    340.5294        173       1277

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    66.66666           0   66.66666   66.66666
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100         686    426.3272   66.66666   1533.333
{txt}file El Salvador.dta saved
Equatorial Guinea

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .02    .1407053          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        -.03     2.76506        -27          2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101        -1.5           0       -1.5       -1.5
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        -.03    .2110579       -1.5          0
{txt}file Equatorial Guinea.dta saved
Eritrea

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100          .3    .4605662          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        9.14    4.456343         -9         18

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    30.46667           0   30.46667   30.46667
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        9.14    14.03192          0   30.46667
{txt}file Eritrea.dta saved
Estonia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        2.07    .9239244          0          4

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      251.24    143.5625         60        504

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101     121.372           0    121.372    121.372
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      251.24    112.1385          0   485.4879
{txt}file Estonia.dta saved
Eswatini

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       13.65    10.94557          0         32

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     3137.35    2693.173         57       7725

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    229.8425           0   229.8425   229.8425
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     3137.35    2515.758          0    7354.96
{txt}file Eswatini.dta saved
Ethiopia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        2.08    1.535308          0          5

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       38.36    80.36803       -666        122

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    18.44231           0   18.44231   18.44231
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       38.36    28.31463          0   92.21154
{txt}file Ethiopia.dta saved
Fiji

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .02    .1407053          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        1.44    1.532938          0          5

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    72.00001           0   72.00001   72.00001
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        1.44    10.13078          0   72.00001
{txt}file Fiji.dta saved
Finland

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        8.98    3.933744          2         15

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       662.9    583.4581         52       1755

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101     73.8196           0    73.8196    73.8196
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       662.9    290.3874   147.6392   1107.294
{txt}file Finland.dta saved
France

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100      276.51    242.1644          4        689

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100    24729.31    30376.18         92      81780

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    89.43369           0   89.43369   89.43369
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100    24729.31    21657.65   357.7348   61619.81
{txt}file France.dta saved
Gabon

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .08    .2726599          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        5.93    4.727429          1         17

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101      74.125           0     74.125     74.125
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        5.93    20.21092          0     74.125
{txt}file Gabon.dta saved
Georgia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        23.7    16.78233          3         51

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      840.68    821.1527        124       2879

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    35.47173           0   35.47173   35.47173
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      840.68    595.2981   106.4152   1809.058
{txt}file Georgia.dta saved
Germany

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100      319.96    256.7416          4        798

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100    37646.92    42279.15         22     116512

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    117.6613           0   117.6613   117.6613
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100    37646.92    30208.56   470.6454   93893.75
{txt}file Germany.dta saved
Ghana

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100      793.65    1264.033          1       5140

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100    40654.61    54237.77        135     162936

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    51.22486           0   51.22486   51.22486
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100    40654.61    64749.92   51.22486   263295.8
{txt}file Ghana.dta saved
Greece

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       31.23    33.58296          0         95

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      655.74    1131.761          0       4131

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    20.99712           0   20.99712   20.99712
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      655.74    705.1454          0   1994.726
{txt}file Greece.dta saved
Grenada

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100         .07    .2931887         -1          1
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Grenada.dta saved
Guatemala

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        2.67     2.38283          0          9

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       68.29     67.5812          5        244

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    25.57678           0   25.57678   25.57678
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       68.29    60.94511          0    230.191
{txt}file Guatemala.dta saved
Guinea

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100         .79     1.07586         -7          3
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Guinea.dta saved
Guinea-Bissau

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        -.65    6.703497        -67          1
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Guinea-Bissau.dta saved
Guyana

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .74     .660884          0          2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       14.96    15.02652        -75         43

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    20.21622           0   20.21622   20.21622
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       14.96    13.36057          0   40.43243
{txt}file Guyana.dta saved
Haiti

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .44    .7009373          0          2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        3.24     9.71318        -77         21

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    7.363636           0   7.363636   7.363636
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        3.24    5.161448          0   14.72727
{txt}file Haiti.dta saved
Holy See

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        -.01          .1         -1          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Holy See.dta saved
Honduras

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .31    .4860685          0          2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        4.86    12.76756        -73         36

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    15.67742           0   15.67742   15.67742
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        4.86      7.6203          0   31.35484
{txt}file Honduras.dta saved
Hungary

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       38.29    55.37171          0        174

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      553.36    1019.766          0       4254

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    14.45181           0   14.45181   14.45181
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      553.36    800.2217          0   2514.616
{txt}file Hungary.dta saved
Iceland

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       10.27    22.04076          0        103
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Iceland.dta saved
India

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100      360.75    182.2845        209        851

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100    19551.17    13812.25       6530      50263

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101     54.1959           0    54.1959    54.1959
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100    19551.17     9879.07   11326.94   46120.71
{txt}file India.dta saved
Indonesia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        2.23    2.237671          0          9

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       42.99    42.09573          6        162

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    19.27803           0   19.27803   19.27803
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       42.99    43.13788          0   173.5022
{txt}file Indonesia.dta saved
Iran

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        16.5     15.4753          1         60

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      592.85    588.3378         52       2202

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101     35.9303           0    35.9303    35.9303
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      592.85    556.0321    35.9303   2155.818
{txt}file Iran.dta saved
Iraq

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        3.57    3.444378          0         12

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      100.73    104.5355          7        381

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    28.21569           0   28.21569   28.21569
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      100.73    97.18548          0   338.5883
{txt}file Iraq.dta saved
Ireland

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        2.34    2.811305          0          8

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      548.14    886.7274          1       3461

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    234.2479           0   234.2479   234.2479
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      548.14    658.5422          0   1873.983
{txt}file Ireland.dta saved
Israel

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       21.85    30.79728          0        104

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     3767.79    5918.867          0      24086

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    172.4389           0   172.4389   172.4389
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     3767.79    5310.649          0   17933.65
{txt}file Israel.dta saved
Italy

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100      265.38    146.8667         58        523

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     29013.8    21301.71       1023      64170

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    109.3293           0   109.3293   109.3293
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     29013.8    16056.83   6341.097    57179.2
{txt}file Italy.dta saved
Jamaica

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        1.51    .5024184          1          2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       28.43    10.19036         13         45

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    18.82781           0   18.82781   18.82781
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       28.43     9.45944   18.82781   37.65563
{txt}file Jamaica.dta saved
Japan

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         1.5    .6435382          0          3

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      247.76    81.31571        129        400

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    165.1733           0   165.1733   165.1733
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      247.76    106.2953          0     495.52
{txt}file Japan.dta saved
Jordan

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       23.24    12.76684          5         45

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     1711.93    1171.273        341       4069

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    73.66309           0   73.66309   73.66309
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     1711.93    940.4452   368.3154   3314.839
{txt}file Jordan.dta saved
Kazakhstan

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        4.73    3.802856          0         14

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       159.1    139.5796         21        510

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    33.63636           0   33.63636   33.63636
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       159.1    127.9143          0   470.9091
{txt}file Kazakhstan.dta saved
Kenya

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        1.77    .8391313          0          3

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      132.55    230.4351      -2068        240

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    74.88701           0   74.88701   74.88701
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      132.55    62.84004          0    224.661
{txt}file Kenya.dta saved
Kosovo

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .14    .3487351          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        4.34    2.370782          1          9

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101          31           0         31         31
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        4.34    10.81079          0         31
{txt}file Kosovo.dta saved
Kuwait

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .05    .2190429          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        9.81    14.31514        -73         27

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101       196.2           0      196.2      196.2
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100    9.810001    42.97622          0      196.2
{txt}file Kuwait.dta saved
Kyrgyzstan

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100          .7    .6435382          0          2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        13.9    10.62729          2         42

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    19.85714           0   19.85714   19.85714
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        13.9    12.77883          0   39.71429
{txt}file Kyrgyzstan.dta saved
Laos

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        8.98     1.84763          5         12

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     2111.84    274.7998       1488       2416

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    235.1715           0   235.1715   235.1715
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     2111.84      434.51   1175.858   2822.058
{txt}file Laos.dta saved
Latvia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        6.74    3.135396          2         13

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      322.26    190.5498         83        680

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    47.81306           0   47.81306   47.81306
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      322.26    149.9129   95.62612   621.5698
{txt}file Latvia.dta saved
Lebanon

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       13.51      5.3626          3         20

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      766.79    547.2864         64       1579

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    56.75721           0   56.75721   56.75721
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      766.79    304.3662   170.2716   1135.144
{txt}file Lebanon.dta saved
Liberia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       83.52    108.6307        -23        382
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Liberia.dta saved
Libya

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        7.85    .7571211          6          9

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      440.66    89.90053        265        533

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    56.13503           0   56.13503   56.13503
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      440.66    42.50102   336.8102   505.2153
{txt}file Libya.dta saved
Liechtenstein

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .13    .3379977          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        6.57    12.17238          0         46

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    50.53846           0   50.53846   50.53846
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        6.57    17.08188          0   50.53846
{txt}file Liechtenstein.dta saved
Lithuania

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        7.41    6.703075          0         19

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      359.56     427.132         23       1485

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    48.52362           0   48.52362   48.52362
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      359.56    325.2574          0   921.9487
{txt}file Lithuania.dta saved
Luxembourg

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        1.17    1.101468          0          3

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       85.66    115.6156          0        363

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    73.21368           0   73.21368   73.21368
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100    85.66001    80.64255          0   219.6411
{txt}file Luxembourg.dta saved
MS Zaandam

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100           0           0          0          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file MS Zaandam.dta saved
Macedonia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        6.88    2.417445          3         12

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      162.13    65.74125         71        287

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    23.56541           0   23.56541   23.56541
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      162.13    56.96808   70.69622   282.7849
{txt}file Macedonia.dta saved
Madagascar

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100      118.72    135.6987          1        397

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     4570.84    4747.885        128      14225

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    38.50101           0   38.50101   38.50101
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     4570.84    5224.538   38.50101    15284.9
{txt}file Madagascar.dta saved
Malawi

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       32.84     40.4142          0        152

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     1246.09    1403.528       -867       4634

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    37.94427           0   37.94427   37.94427
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     1246.09    1533.487          0    5767.53
{txt}file Malawi.dta saved
Malaysia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        75.3    61.66929         24        200

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100    14846.77    10763.25       3437      37259

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    197.1682           0   197.1682   197.1682
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100    14846.77    12159.23   4732.038   39433.65
{txt}file Malaysia.dta saved
Maldives

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .22    .4163332          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       33.15    35.87362          1        118

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    150.6818           0   150.6818   150.6818
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       33.15    62.73385          0   150.6818
{txt}file Maldives.dta saved
Mali

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        2.65    .7436601          1          4

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       56.92    21.57659         22         88

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    21.47924           0   21.47924   21.47924
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       56.92    15.97326   21.47924   85.91698
{txt}file Mali.dta saved
Malta

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100          .4     .492366          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       72.76    44.50698         11        133

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101       181.9           0      181.9      181.9
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       72.76    89.56137          0      181.9
{txt}file Malta.dta saved
Mauritania

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .38    .5081159          0          2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       10.65     8.87668          1         33

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    28.02632           0   28.02632   28.02632
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       10.65    14.24062          0   56.05263
{txt}file Mauritania.dta saved
Mauritius

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       17.11    16.17261          2         59
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Mauritius.dta saved
Mexico

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100      219.34    97.69973         49        377

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     2791.43    1808.769        264       5480

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101     12.7265           0    12.7265    12.7265
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     2791.43    1243.375   623.5984    4797.89
{txt}file Mexico.dta saved
Moldova

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         6.8    5.451346          0         19

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      121.05    116.4886          3        385

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    17.80147           0   17.80147   17.80147
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      121.05    97.04197          0   338.2279
{txt}file Moldova.dta saved
Monaco

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        4.05    4.402421          0         24
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Monaco.dta saved
Mongolia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .47    .6583573          0          2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       36.46    44.21605          1        171

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    77.57446           0   77.57446   77.57446
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       36.46    51.07171          0   155.1489
{txt}file Mongolia.dta saved
Montenegro

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        1.03    .9995454          0          4

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       45.33    43.53196          3        156

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    44.00971           0   44.00971   44.00971
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       45.33     43.9897          0   176.0388
{txt}file Montenegro.dta saved
Morocco

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        1.53    .5016136          1          2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      134.07    21.59698        -77        141

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    87.62746           0   87.62746   87.62746
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      134.07    43.95512   87.62746   175.2549
{txt}file Morocco.dta saved
Mozambique

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100      614.56    736.6922          0       2051

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100    67621.62    65279.31       1036     186912

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    110.0326           0   110.0326   110.0326
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100    67621.62    81060.14          0   225676.8
{txt}file Mozambique.dta saved
Myanmar

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        1.58    1.485145          0          6

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       73.72     88.9316          0        296

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    46.65823           0   46.65823   46.65823
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       73.72    69.29424          0   279.9493
{txt}file Myanmar.dta saved
Namibia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100      198.46    191.7614          0        587

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     6355.88    6960.022         25      19887

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101      32.026           0     32.026     32.026
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100    6355.879    6141.352          0   18799.26
{txt}file Namibia.dta saved
Nepal

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        1.13    .8122173          0          3

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       77.07    75.58503          2        225

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    68.20354           0   68.20354   68.20354
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       77.07    55.39609          0   204.6106
{txt}file Nepal.dta saved
Netherlands

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       29.61    20.41484          1         58

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     6498.26    6753.226         64      22844

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    219.4617           0   219.4617   219.4617
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     6498.26    4480.274   219.4617   12728.78
{txt}file Netherlands.dta saved
New Zealand

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100          .1    .3015113          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       12.92    21.59484          0         83

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101       129.2           0      129.2      129.2
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       12.92    38.95526          0      129.2
{txt}file New Zealand.dta saved
Nicaragua

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .02    .1407053          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        1.28     2.06989          0          8

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101          64           0         64         64
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        1.28    9.005139          0         64
{txt}file Nicaragua.dta saved
Niger

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100          .2    .4020151          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        1.21    2.388081        -15          7

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101        6.05           0       6.05       6.05
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        1.21    2.432192          0       6.05
{txt}file Niger.dta saved
Nigeria

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       11.99    12.90485          0         41

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     3338.62    2371.491      -2862       6625

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    278.4504           0   278.4504   278.4504
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     3338.62    3593.361          0   11416.47
{txt}file Nigeria.dta saved
Norway

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        7.22    6.577556          0         18

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      1057.1    1590.725          1       4940

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    146.4128           0   146.4128   146.4128
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      1057.1    963.0381          0   2635.429
{txt}file Norway.dta saved
Oman

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       43.56    21.84348         16         88
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Oman.dta saved
Pakistan

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         4.7    1.977142          1          8

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      156.48    77.14691         51        296

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    33.29362           0   33.29362   33.29362
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      156.48    65.82621   33.29362   266.3489
{txt}file Pakistan.dta saved
Panama

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         1.4    .6513389          0          3

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      120.27    72.50369         26        244

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    85.90714           0   85.90714   85.90714
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      120.27    55.95467          0   257.7214
{txt}file Panama.dta saved
Papua New Guinea

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .27    .5659532          0          2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        2.54    5.416809          0         40

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    9.407407           0   9.407407   9.407407
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        2.54    5.324152          0   18.81481
{txt}file Papua New Guinea.dta saved
Paraguay

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         2.3    .7719842          0          3

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       46.28    39.58218       -339         61

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    20.12174           0   20.12174   20.12174
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       46.28    15.53366          0   60.36522
{txt}file Paraguay.dta saved
Peru

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       26.83    20.72039          2         59

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      303.99    324.2782         21       1154

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    11.33023           0   11.33023   11.33023
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      303.99    234.7667   22.66045   668.4834
{txt}file Peru.dta saved
Philippines

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        9.99    19.01488          0         91

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        16.3    37.45017          0        281

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    1.631632           0   1.631632   1.631632
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        16.3    31.02527          0   148.4785
{txt}file Philippines.dta saved
Poland

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100      153.98    170.6792          0        462

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      3552.4    5390.839          4      18604

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    23.07053           0   23.07053   23.07053
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      3552.4     3937.66          0   10658.58
{txt}file Poland.dta saved
Portugal

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       34.45    9.873314          9         49

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     3928.24    2050.678        497       6128

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    114.0273           0   114.0273   114.0273
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     3928.24    1125.827   1026.246   5587.337
{txt}file Portugal.dta saved
Qatar

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      381.19     135.782        171        550
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Qatar.dta saved
Romania

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       10.98     14.6639          0         65

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      124.55    174.4275          1        689

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    11.34335           0   11.34335   11.34335
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      124.55    166.3378          0   737.3179
{txt}file Romania.dta saved
Russian Federation

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100      609.45    288.0926        186       1105

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100    12328.72    7546.672       3141      27487

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    20.22926           0   20.22926   20.22926
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100    12328.72    5827.899   3762.642   22353.33
{txt}file Russian Federation.dta saved
Rwanda

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .57    .6396811          0          2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      183.97     154.853       -276        527

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    322.7544           0   322.7544   322.7544
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      183.97    206.4599          0   645.5088
{txt}file Rwanda.dta saved
Saint Kitts and Nevis

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        -.17    2.828624        -28          1
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Saint Kitts and Nevis.dta saved
Saint Lucia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .16    .3684529          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        3.49    1.888268          1          8

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101     21.8125           0    21.8125    21.8125
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        3.49     8.03688          0    21.8125
{txt}file Saint Lucia.dta saved
Saint Vincent and the Grenadines

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .06    .2386833          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        3.27    2.939989          0         10

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101        54.5           0       54.5       54.5
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        3.27    13.00824          0       54.5
{txt}file Saint Vincent and the Grenadines.dta saved
San Marino

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .04    .1969464          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        8.83    32.65246       -281         38

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101      220.75           0     220.75     220.75
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        8.83    43.47591          0     220.75
{txt}file San Marino.dta saved
Sao Tome and Principe

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100         .01     .265718         -2          1
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Sao Tome and Principe.dta saved
Saudi Arabia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        11.9     11.8522          1         43

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      846.76    739.4191         73       2491

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101     71.1563           0    71.1563    71.1563
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      846.76     843.359    71.1563   3059.721
{txt}file Saudi Arabia.dta saved
Senegal

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .52    .5770003          0          2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       13.59    18.45064       -111         39

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    26.13462           0   26.13462   26.13462
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       13.59    15.07968          0   52.26923
{txt}file Senegal.dta saved
Serbia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        7.17    8.153892          0         32

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      240.72    296.6512          7       1115

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    33.57322           0   33.57322   33.57322
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      240.72    273.7524          0   1074.343
{txt}file Serbia.dta saved
Seychelles

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .09    .2876235          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        7.47    7.709963          0         29

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    82.99999           0   82.99999   82.99999
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100    7.469999    23.87275          0   82.99999
{txt}file Seychelles.dta saved
Sierra Leone

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100         .71    .9459643          0          3
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Sierra Leone.dta saved
Singapore

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100          .7    1.020002          0          4

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       78.81    97.19196          3        375

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    112.5857           0   112.5857   112.5857
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       78.81    114.8377          0   450.3429
{txt}file Singapore.dta saved
Slovakia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       31.72    25.58214          1         80

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        2416    2547.957         49       7984

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    76.16646           0   76.16646   76.16646
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        2416    1948.501   76.16646   6093.316
{txt}file Slovakia.dta saved
Slovenia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        2.75    3.379603          0         12

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      190.74    261.3303          3       1038

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101       69.36           0      69.36      69.36
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      190.74    234.4093          0     832.32
{txt}file Slovenia.dta saved
Somalia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .01          .1          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        -.52    8.860855        -88          3

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101         -52           0        -52        -52
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        -.52         5.2        -52          0
{txt}file Somalia.dta saved
South Africa

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100      504.28     268.556         26        906

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100    53513.72    29642.19       6665      95812

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    106.1191           0   106.1191   106.1191
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100    53513.72    28498.91   2759.095   96143.87
{txt}file South Africa.dta saved
South Korea

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       94.04    40.32643         19        143

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     4349.94    2872.436        549       8151

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    46.25627           0   46.25627   46.25627
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     4349.94     1865.35   878.8691   6614.647
{txt}file South Korea.dta saved
South Sudan

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        6.57    15.08779       -133         14
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file South Sudan.dta saved
Spain

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100      109.29    93.16514          3        273

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100    19133.63    20128.46         69      54812

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    175.0721           0   175.0721   175.0721
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100    19133.63    16310.62   525.2163   47794.69
{txt}file Spain.dta saved
Sri Lanka

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       81.23    96.73674         15        384

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     6773.73    7803.512      -1046      25249

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    83.38951           0   83.38951   83.38951
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     6773.73     8066.83   1250.843   32021.57
{txt}file Sri Lanka.dta saved
Sudan

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        3.86    4.750375          0         15

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       11.81    22.23597          0         92

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    3.059586           0   3.059586   3.059586
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       11.81    14.53418          0   45.89378
{txt}file Sudan.dta saved
Suriname

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .26     .440844          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100         6.8    6.180778          0         23

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    26.15385           0   26.15385   26.15385
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100    6.800001    11.52977          0   26.15385
{txt}file Suriname.dta saved
Sweden

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       16.03    12.15095          1         38

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     3575.68    3621.899         18       9662

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    223.0618           0   223.0618   223.0618
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     3575.68    2710.412   223.0618   8476.347
{txt}file Sweden.dta saved
Switzerland

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        21.3    14.13106          0         37

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     3954.78    3853.003         44       9769

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    185.6704           0   185.6704   185.6704
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     3954.78     2623.72          0   6869.806
{txt}file Switzerland.dta saved
Syria

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         1.6    .9534626          0          4

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       33.07     35.0864       -267         76

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    20.66875           0   20.66875   20.66875
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       33.07    19.70688          0     82.675
{txt}file Syria.dta saved
Tanzania

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        1.65    1.526698          0          6

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       49.03    46.65291       -124        153

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    29.71515           0   29.71515   29.71515
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       49.03    45.36608          0   178.2909
{txt}file Tanzania.dta saved
Thailand

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        9.27    9.788527          0         33

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      628.66    841.4577          9       3135

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101     67.8166           0    67.8166    67.8166
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100    628.6599    663.8246          0   2237.948
{txt}file Thailand.dta saved
The Bahamas

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        3.48    1.629773          1          7

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        26.2    6.441657         -7         33

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    7.528736           0   7.528736   7.528736
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        26.2    12.27013   7.528736   52.70115
{txt}file The Bahamas.dta saved
The Gambia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        40.9    50.87944        -57        175
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file The Gambia.dta saved
Timor-Leste

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        -.02    .4259274         -4          1
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Timor-Leste.dta saved
Togo

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        8.38    9.633464          0         25
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Togo.dta saved
Trinidad and Tobago

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       16.35    9.736296          2         32

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      262.07    206.6049         29        668

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    16.02875           0   16.02875   16.02875
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      262.07    156.0606   32.05749   512.9199
{txt}file Trinidad and Tobago.dta saved
Tunisia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        5.97    2.002297          0          8

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       96.07    258.5603      -2443        165

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    16.09213           0   16.09213   16.09213
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100    96.07001    32.22121          0    128.737
{txt}file Tunisia.dta saved
Turkey

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100      526.53     739.684          0       2689

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100    66367.07    106655.6          0     404092

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    126.0461           0   126.0461   126.0461
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100    66367.07     93234.3          0     338938
{txt}file Turkey.dta saved
Uganda

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100          .4     .492366          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       11.75    18.02096       -154         28

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101      29.375           0     29.375     29.375
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       11.75    14.46325          0     29.375
{txt}file Uganda.dta saved
Ukraine

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100      114.85    100.7855         10        372

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     2084.38    2089.458        167       7559

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    18.14871           0   18.14871   18.14871
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     2084.38    1829.128   181.4871   6751.322
{txt}file Ukraine.dta saved
United Arab Emirates

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .46    .5009083          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      153.98    58.50787       -146        243

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    334.7391           0   334.7391   334.7391
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      153.98    167.6736          0   334.7391
{txt}file United Arab Emirates.dta saved
United Kingdom

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100      104.15    117.2849          0        362

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100    25071.84    40768.76          0     122800

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    240.7282           0   240.7282   240.7282
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100    25071.84    28233.78          0    87143.6
{txt}file United Kingdom.dta saved
United States

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100     3204.75    3562.538          2      11806

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100    205292.9    270071.8          3     793992

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    64.05894           0   64.05894   64.05894
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100    205292.9    228212.4   128.1179   756279.8
{txt}file United States.dta saved
Uruguay

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        1.47    .5016136          1          2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      186.76    52.66458         94        246

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    127.0476           0   127.0476   127.0476
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      186.76    63.72881   127.0476   254.0952
{txt}file Uruguay.dta saved
Uzbekistan

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .77    1.033333          0          3

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100       24.23    44.05365          0        173

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    31.46753           0   31.46753   31.46753
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100       24.23    32.51645          0    94.4026
{txt}file Uzbekistan.dta saved
Venezuela

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        2.36    1.344799          0          6

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      194.82    108.2807         67        446

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    82.55086           0   82.55086   82.55086
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      194.82    111.0143          0   495.3051
{txt}file Venezuela.dta saved
Vietnam

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100      301.36    63.67064        193        414

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100    18756.91    4628.431      -8985      25201

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    62.24088           0   62.24088   62.24088
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100    18756.91    3962.916   12012.49   25767.72
{txt}file Vietnam.dta saved
West Bank and Gaza

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100        2.56    .7009373          1          4

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100      172.02    45.30391        106        256

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    67.19531           0   67.19531   67.19531
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100      172.02     47.0997   67.19531   268.7813
{txt}file West Bank and Gaza.dta saved
Western Sahara

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100           0           0          0          0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100           0           0          0          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}          0
{txt}(101 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}          0
{txt}file Western Sahara.dta saved
Yemen

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100         .75    .4578165          0          2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100        3.44    2.757249          0          7

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    4.586667           0   4.586667   4.586667
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100        3.44    2.099852          0   9.173333
{txt}file Yemen.dta saved
Zambia

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100       38.75    51.70514          0        185

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100     6098.03    7380.963      -1509      23925

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    157.3685           0   157.3685   157.3685
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100     6098.03    8136.761          0   29113.18
{txt}file Zambia.dta saved
Zimbabwe

{txt}{hline}
{res}day1b{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}22630{txt},{res}22630{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16dec2021{txt},{res}16dec2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}1{col 51}{txt}missing .:  {res}0{txt}/{res}101

{txt}{col 13}tabulation:  Freq.  Value
{col 21}{res}       101{col 33}22630{col 40}{txt}16dec2021
(100 real changes made)
{res}{txt}(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        100      699.99    442.4568          5       1223

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        100    15521.19    5813.838       4547      23126

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        101    22.17345           0   22.17345   22.17345
{txt}(1 missing value generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        100    15521.19    9810.792   110.8672   27118.13
{txt}file Zimbabwe.dta saved

{com}. *       
. 
. 
. 
. * append country files
. 
. 
. clear   
{txt}
{com}. local list3 `" Afghanistan Albania Algeria Andorra Angola "Antigua and Barbuda" Argentina Armenia Australia Austria Azerbaijan Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bhutan Bolivia "Bosnia and Herzegovina" Botswana Brazil Brunei Bulgaria "Burkina Faso" Burundi Cambodia Cameroon Canada "Cape Verde" "Central African Republic" Chad Chile China Colombia Congo "Costa Rica" "Cote d'Ivoire" Croatia Cuba Cyprus "Czech Republic" "Democratic Republic of the Congo" Denmark "Diamond Princess" Djibouti Dominica "Dominican Republic" Ecuador Egypt "El Salvador" "Equatorial Guinea" Eritrea Estonia Eswatini Ethiopia Fiji Finland France Gabon Georgia Germany Ghana Greece Grenada Guatemala Guinea "Guinea-Bissau" Guyana Haiti "Holy See" Honduras Hungary Iceland India Indonesia Iran Iraq Ireland Israel Italy Jamaica Japan Jordan Kazakhstan Kenya Kosovo Kuwait Kyrgyzstan Laos Latvia Lebanon Liberia Libya Liechtenstein Lithuania Luxembourg "MS Zaandam" Macedonia Madagascar Malawi Malaysia Maldives Mali Malta Mauritania Mauritius Mexico Moldova Monaco Mongolia Montenegro Morocco Mozambique Myanmar Namibia Nepal Netherlands "New Zealand" Nicaragua Niger Nigeria Norway Oman Pakistan Panama "Papua New Guinea" Paraguay Peru Philippines Poland Portugal Qatar Romania "Russian Federation" Rwanda "Saint Kitts and Nevis" "Saint Lucia" "Saint Vincent and the Grenadines" "San Marino" "Sao Tome and Principe" "Saudi Arabia" Senegal Serbia Seychelles "Sierra Leone" Singapore Slovakia Slovenia Somalia "South Africa" "South Korea" "South Sudan" Spain "Sri Lanka" Sudan Suriname Sweden Switzerland Syria Tanzania Thailand "The Bahamas" "The Gambia" "Timor-Leste" Togo "Trinidad and Tobago" Tunisia Turkey Uganda Ukraine "United Arab Emirates" "United Kingdom" "United States" Uruguay Uzbekistan Venezuela Vietnam "West Bank and Gaza" "Western Sahara" Yemen Zambia Zimbabwe "'
{txt}
{com}. 
. foreach m of local list3 {c -(}
{txt}  2{com}.         di "`m'"
{txt}  3{com}.         append using "`m'"
{txt}  4{com}.         
. {c )-}       
Afghanistan
Albania
Algeria
Andorra
Angola
Antigua and Barbuda
Argentina
Armenia
Australia
Austria
Azerbaijan
Bahrain
Bangladesh
Barbados
Belarus
Belgium
Belize
Benin
Bhutan
Bolivia
Bosnia and Herzegovina
Botswana
Brazil
Brunei
Bulgaria
Burkina Faso
Burundi
Cambodia
Cameroon
Canada
Cape Verde
Central African Republic
Chad
Chile
China
Colombia
Congo
Costa Rica
Cote d'Ivoire
Croatia
Cuba
Cyprus
Czech Republic
Democratic Republic of the Congo
Denmark
Diamond Princess
Djibouti
Dominica
Dominican Republic
Ecuador
Egypt
El Salvador
Equatorial Guinea
Eritrea
Estonia
Eswatini
Ethiopia
Fiji
Finland
France
Gabon
Georgia
Germany
Ghana
Greece
Grenada
Guatemala
Guinea
Guinea-Bissau
Guyana
Haiti
Holy See
Honduras
Hungary
Iceland
India
Indonesia
Iran
Iraq
Ireland
Israel
Italy
Jamaica
Japan
Jordan
Kazakhstan
Kenya
Kosovo
Kuwait
Kyrgyzstan
Laos
Latvia
Lebanon
Liberia
Libya
Liechtenstein
Lithuania
Luxembourg
MS Zaandam
Macedonia
Madagascar
Malawi
Malaysia
Maldives
Mali
Malta
Mauritania
Mauritius
Mexico
Moldova
Monaco
Mongolia
Montenegro
Morocco
Mozambique
Myanmar
Namibia
Nepal
Netherlands
New Zealand
Nicaragua
Niger
Nigeria
Norway
Oman
Pakistan
Panama
Papua New Guinea
Paraguay
Peru
Philippines
Poland
Portugal
Qatar
Romania
Russian Federation
Rwanda
Saint Kitts and Nevis
Saint Lucia
Saint Vincent and the Grenadines
San Marino
Sao Tome and Principe
Saudi Arabia
Senegal
Serbia
Seychelles
Sierra Leone
Singapore
Slovakia
Slovenia
Somalia
South Africa
South Korea
South Sudan
Spain
Sri Lanka
Sudan
Suriname
Sweden
Switzerland
Syria
Tanzania
Thailand
The Bahamas
The Gambia
Timor-Leste
Togo
Trinidad and Tobago
Tunisia
Turkey
Uganda
Ukraine
United Arab Emirates
United Kingdom
United States
Uruguay
Uzbekistan
Venezuela
Vietnam
West Bank and Gaza
Western Sahara
Yemen
Zambia
Zimbabwe
{txt}
{com}. *       
. 
. rename country loc_grand_name
{res}{txt}
{com}. 
. order loc_grand_name date
{txt}
{com}. 
. sort loc_grand_name date
{txt}
{com}. 
. save "SRIV.dta", replace
{txt}file SRIV.dta saved

{com}.  
. 
. 
.  
. ***********
. 
. * gen global sum
. 
. use "SRIV.dta", clear 
{txt}
{com}. 
. collapse (sum) TotDeaMeRaA05S00-DayDMuMeRaA05S00, by(date)
{txt}
{com}.  
. foreach var of varlist DayDeaMeRaA05S00 DayDeaLoRaA05S00 DayDeaUpRaA05S00 ///
> DayCasMeRaA05S00 DayCasLoRaA05S00 DayCasUpRaA05S00 {c -(}
{txt}  2{com}.         replace `var' = . if `var' == 0
{txt}  3{com}. {c )-}
{txt}(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)

{com}. *       
.  
. label var TotDeaMeRaA05S00 "Total Deaths Mean SRIV"
{txt}
{com}. label var TotDeaLoRaA05S00 "Total Deaths Lower SRIV"
{txt}
{com}. label var TotDeaUpRaA05S00 "Total Deaths Upper SRIV"
{txt}
{com}. label var TotCasMeRaA05S00 "Total Cases Mean SRIV"
{txt}
{com}. label var TotCasLoRaA05S00 "Total Cases Lower SRIV"
{txt}
{com}. label var TotCasUpRaA05S00 "Total Cases Upper SRIV" 
{txt}
{com}. 
. label var DayDeaMeRaA05S00 "Daily Deaths Mean SRIV"
{txt}
{com}. label var DayDeaLoRaA05S00 "Daily Deaths Lower SRIV"
{txt}
{com}. label var DayDeaUpRaA05S00 "Daily Deaths Upper SRIV"
{txt}
{com}. label var DayCasMeRaA05S00 "Daily Cases Mean SRIV"
{txt}
{com}. label var DayCasLoRaA05S00 "Daily Cases Lower SRIV"
{txt}
{com}. label var DayCasUpRaA05S00 "Daily Cases Upper SRIV" 
{txt}
{com}. 
. label var DayDeMMeRaA05S00 "Daily deaths mean SRIV  DayDeM"
{txt}
{com}. label var DayCaMMeRaA05S00 "Daily cases mean SRIV  DayCaM"
{txt}
{com}. label var DayCbDMeRaA05S00 "Daily cases mean div by daily deaths mean SRIV  DayCbD"
{txt}
{com}. label var DayDMuMeRaA05S00 "Daily deaths scaled (times means of cases by deaths) SRIV"
{txt}
{com}.         
. gen loc_grand_name = " GLOBAL"
{txt}
{com}. 
. save "SRIV GLOBAL.dta", replace 
{txt}file SRIV GLOBAL.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. *****************************
. 
. * gen AFRO
. 
. use "SRIV.dta", clear
{txt}
{com}. 
. keep if ///
> loc_grand_name == "Algeria" | ///
> loc_grand_name == "Angola" | ///
> loc_grand_name == "Benin" | ///
> loc_grand_name == "Botswana" | ///
> loc_grand_name == "Burkina Faso" | ///
> loc_grand_name == "Burundi" | ///
> loc_grand_name == "Cameroon" | ///
> loc_grand_name == "Cape Verde" | ///
> loc_grand_name == "Central African Republic" | ///
> loc_grand_name == "Chad" | ///
> loc_grand_name == "Congo" | ///
> loc_grand_name == "Cote d'Ivoire" | ///
> loc_grand_name == "Democratic Republic of the Congo" | ///
> loc_grand_name == "Equatorial Guinea" | ///
> loc_grand_name == "Eritrea" | ///
> loc_grand_name == "Eswatini" | ///
> loc_grand_name == "Ethiopia" | ///
> loc_grand_name == "Gabon" | ///
> loc_grand_name == "Ghana" | ///
> loc_grand_name == "Guinea" | ///
> loc_grand_name == "Guinea-Bissau" | ///
> loc_grand_name == "Kenya" | ///
> loc_grand_name == "Liberia" | ///
> loc_grand_name == "Madagascar" | ///
> loc_grand_name == "Malawi" | ///
> loc_grand_name == "Mali" | ///
> loc_grand_name == "Mauritania" | ///
> loc_grand_name == "Mauritius" | ///
> loc_grand_name == "Mozambique" | ///
> loc_grand_name == "Namibia" | ///
> loc_grand_name == "Niger" | ///
> loc_grand_name == "Nigeria" | ///
> loc_grand_name == "Rwanda" | ///
> loc_grand_name == "Sao Tome and Principe" | ///
> loc_grand_name == "Senegal" | ///
> loc_grand_name == "Seychelles" | ///
> loc_grand_name == "Sierra Leone" | ///
> loc_grand_name == "South Africa" | ///
> loc_grand_name == "South Sudan" | ///
> loc_grand_name == "Tanzania" | ///
> loc_grand_name == "The Gambia" | ///
> loc_grand_name == "Togo" | ///
> loc_grand_name == "Uganda" | ///
> loc_grand_name == "Zambia" | ///
> loc_grand_name == "Zimbabwe" 
{txt}(14,039 observations deleted)

{com}. 
. drop loc_grand_name
{txt}
{com}. 
. collapse (sum) TotDeaMeRaA05S00-DayDMuMeRaA05S00, by(date)
{txt}
{com}. 
. foreach var of varlist DayDeaMeRaA05S00 DayDeaLoRaA05S00 DayDeaUpRaA05S00 ///
> DayCasMeRaA05S00 DayCasLoRaA05S00 DayCasUpRaA05S00 {c -(}
{txt}  2{com}.         replace `var' = . if `var' == 0
{txt}  3{com}. {c )-}
{txt}(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)

{com}. *
.  
. label var TotDeaMeRaA05S00 "Total Deaths Mean SRIV"
{txt}
{com}. label var TotDeaLoRaA05S00 "Total Deaths Lower SRIV"
{txt}
{com}. label var TotDeaUpRaA05S00 "Total Deaths Upper SRIV"
{txt}
{com}. label var TotCasMeRaA05S00 "Total Cases Mean SRIV"
{txt}
{com}. label var TotCasLoRaA05S00 "Total Cases Lower SRIV"
{txt}
{com}. label var TotCasUpRaA05S00 "Total Cases Upper SRIV" 
{txt}
{com}. 
. label var DayDeaMeRaA05S00 "Daily Deaths Mean SRIV"
{txt}
{com}. label var DayDeaLoRaA05S00 "Daily Deaths Lower SRIV"
{txt}
{com}. label var DayDeaUpRaA05S00 "Daily Deaths Upper SRIV"
{txt}
{com}. label var DayCasMeRaA05S00 "Daily Cases Mean SRIV"
{txt}
{com}. label var DayCasLoRaA05S00 "Daily Cases Lower SRIV"
{txt}
{com}. label var DayCasUpRaA05S00 "Daily Cases Upper SRIV" 
{txt}
{com}. 
. label var DayDeMMeRaA05S00 "Daily deaths mean SRIV  DayDeM"
{txt}
{com}. label var DayCaMMeRaA05S00 "Daily cases mean SRIV  DayCaM"
{txt}
{com}. label var DayCbDMeRaA05S00 "Daily cases mean div by daily deaths mean SRIV  DayCbD"
{txt}
{com}. label var DayDMuMeRaA05S00 "Daily deaths scaled (times means of cases by deaths) SRIV"
{txt}
{com}. 
. gen loc_grand_name = "AFRO"
{txt}
{com}. 
. order loc_grand_name date
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "SRIV AFRO.dta", replace 
{txt}file SRIV AFRO.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *****************************
. 
. * gen AMRO
. 
. use "SRIV.dta", clear
{txt}
{com}. 
. keep if ///
> loc_grand_name == "Antigua and Barbuda" | ///
> loc_grand_name == "Argentina" | ///
> loc_grand_name == "Barbados" | ///
> loc_grand_name == "Belize" | ///
> loc_grand_name == "Bolivia" | ///
> loc_grand_name == "Brazil" | ///
> loc_grand_name == "Canada" | ///
> loc_grand_name == "Chile" | ///
> loc_grand_name == "Colombia" | ///
> loc_grand_name == "Costa Rica" | ///
> loc_grand_name == "Cuba" | ///
> loc_grand_name == "Diamond Princess" | ///
> loc_grand_name == "Dominica" | ///
> loc_grand_name == "Dominican Republic" | ///
> loc_grand_name == "Ecuador" | ///
> loc_grand_name == "El Salvador" | ///
> loc_grand_name == "Grenada" | ///
> loc_grand_name == "Guatemala" | ///
> loc_grand_name == "Guyana" | ///
> loc_grand_name == "Haiti" | ///
> loc_grand_name == "Honduras" | ///
> loc_grand_name == "Jamaica" | ///
> loc_grand_name == "MS Zaandam" | ///
> loc_grand_name == "Mexico" | ///
> loc_grand_name == "Nicaragua" | ///
> loc_grand_name == "Panama" | ///
> loc_grand_name == "Paraguay" | ///
> loc_grand_name == "Peru" | ///
> loc_grand_name == "Saint Kitts and Nevis" | ///
> loc_grand_name == "Saint Lucia" | ///
> loc_grand_name == "Saint Vincent and the Grenadines" | ///
> loc_grand_name == "Suriname" | ///
> loc_grand_name == "The Bahamas" | ///
> loc_grand_name == "Trinidad and Tobago" | ///
> loc_grand_name == "United States" | ///
> loc_grand_name == "Uruguay" | ///
> loc_grand_name == "Venezuela" 
{txt}(14,847 observations deleted)

{com}. 
. drop loc_grand_name
{txt}
{com}. 
. collapse (sum) TotDeaMeRaA05S00-DayDMuMeRaA05S00, by(date)
{txt}
{com}. 
. foreach var of varlist DayDeaMeRaA05S00 DayDeaLoRaA05S00 DayDeaUpRaA05S00 ///
> DayCasMeRaA05S00 DayCasLoRaA05S00 DayCasUpRaA05S00 {c -(}
{txt}  2{com}.         replace `var' = . if `var' == 0
{txt}  3{com}. {c )-}
{txt}(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)

{com}. *
.  
. label var TotDeaMeRaA05S00 "Total Deaths Mean SRIV"
{txt}
{com}. label var TotDeaLoRaA05S00 "Total Deaths Lower SRIV"
{txt}
{com}. label var TotDeaUpRaA05S00 "Total Deaths Upper SRIV"
{txt}
{com}. label var TotCasMeRaA05S00 "Total Cases Mean SRIV"
{txt}
{com}. label var TotCasLoRaA05S00 "Total Cases Lower SRIV"
{txt}
{com}. label var TotCasUpRaA05S00 "Total Cases Upper SRIV" 
{txt}
{com}. 
. label var DayDeaMeRaA05S00 "Daily Deaths Mean SRIV"
{txt}
{com}. label var DayDeaLoRaA05S00 "Daily Deaths Lower SRIV"
{txt}
{com}. label var DayDeaUpRaA05S00 "Daily Deaths Upper SRIV"
{txt}
{com}. label var DayCasMeRaA05S00 "Daily Cases Mean SRIV"
{txt}
{com}. label var DayCasLoRaA05S00 "Daily Cases Lower SRIV"
{txt}
{com}. label var DayCasUpRaA05S00 "Daily Cases Upper SRIV" 
{txt}
{com}. 
. label var DayDeMMeRaA05S00 "Daily deaths mean SRIV  DayDeM"
{txt}
{com}. label var DayCaMMeRaA05S00 "Daily cases mean SRIV  DayCaM"
{txt}
{com}. label var DayCbDMeRaA05S00 "Daily cases mean div by daily deaths mean SRIV  DayCbD"
{txt}
{com}. label var DayDMuMeRaA05S00 "Daily deaths scaled (times means of cases by deaths) SRIV"
{txt}
{com}. 
. gen loc_grand_name = "AMRO"
{txt}
{com}. 
. order loc_grand_name date
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "SRIV AMRO.dta", replace 
{txt}file SRIV AMRO.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *****************************
. 
. * gen EMRO
. 
. use "SRIV.dta", clear
{txt}
{com}. 
. keep if ///
> loc_grand_name == "Afghanistan" | ///
> loc_grand_name == "Bahrain" | ///
> loc_grand_name == "Djibouti" | ///
> loc_grand_name == "Egypt" | ///
> loc_grand_name == "Iran" | ///
> loc_grand_name == "Iraq" | ///
> loc_grand_name == "Jordan" | ///
> loc_grand_name == "Kuwait" | ///
> loc_grand_name == "Lebanon" | ///
> loc_grand_name == "Libya" | ///
> loc_grand_name == "Morocco" | ///
> loc_grand_name == "Oman" | ///
> loc_grand_name == "Pakistan" | ///
> loc_grand_name == "Qatar" | ///
> loc_grand_name == "Saudi Arabia" | ///
> loc_grand_name == "Somalia" | ///
> loc_grand_name == "Sudan" | ///
> loc_grand_name == "Syria" | ///
> loc_grand_name == "Tunisia" | ///
> loc_grand_name == "United Arab Emirates" | ///
> loc_grand_name == "West Bank and Gaza" | ///
> loc_grand_name == "Western Sahara" | ///
> loc_grand_name == "Yemen" 
{txt}(16,261 observations deleted)

{com}. 
. 
. drop loc_grand_name
{txt}
{com}. 
. collapse (sum) TotDeaMeRaA05S00-DayDMuMeRaA05S00, by(date)
{txt}
{com}. 
. foreach var of varlist DayDeaMeRaA05S00 DayDeaLoRaA05S00 DayDeaUpRaA05S00 ///
> DayCasMeRaA05S00 DayCasLoRaA05S00 DayCasUpRaA05S00 {c -(}
{txt}  2{com}.         replace `var' = . if `var' == 0
{txt}  3{com}. {c )-}
{txt}(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)

{com}. *
.  
. label var TotDeaMeRaA05S00 "Total Deaths Mean SRIV"
{txt}
{com}. label var TotDeaLoRaA05S00 "Total Deaths Lower SRIV"
{txt}
{com}. label var TotDeaUpRaA05S00 "Total Deaths Upper SRIV"
{txt}
{com}. label var TotCasMeRaA05S00 "Total Cases Mean SRIV"
{txt}
{com}. label var TotCasLoRaA05S00 "Total Cases Lower SRIV"
{txt}
{com}. label var TotCasUpRaA05S00 "Total Cases Upper SRIV" 
{txt}
{com}. 
. label var DayDeaMeRaA05S00 "Daily Deaths Mean SRIV"
{txt}
{com}. label var DayDeaLoRaA05S00 "Daily Deaths Lower SRIV"
{txt}
{com}. label var DayDeaUpRaA05S00 "Daily Deaths Upper SRIV"
{txt}
{com}. label var DayCasMeRaA05S00 "Daily Cases Mean SRIV"
{txt}
{com}. label var DayCasLoRaA05S00 "Daily Cases Lower SRIV"
{txt}
{com}. label var DayCasUpRaA05S00 "Daily Cases Upper SRIV" 
{txt}
{com}. 
. label var DayDeMMeRaA05S00 "Daily deaths mean SRIV  DayDeM"
{txt}
{com}. label var DayCaMMeRaA05S00 "Daily cases mean SRIV  DayCaM"
{txt}
{com}. label var DayCbDMeRaA05S00 "Daily cases mean div by daily deaths mean SRIV  DayCbD"
{txt}
{com}. label var DayDMuMeRaA05S00 "Daily deaths scaled (times means of cases by deaths) SRIV"
{txt}
{com}. 
. gen loc_grand_name = "EMRO"
{txt}
{com}. 
. order loc_grand_name date
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "SRIV EMRO.dta", replace 
{txt}file SRIV EMRO.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *****************************
. 
. * gen EURO
. 
. use "SRIV.dta", clear
{txt}
{com}. 
. keep if ///
> loc_grand_name == "Albania" | ///
> loc_grand_name == "Andorra" | ///
> loc_grand_name == "Armenia" | ///
> loc_grand_name == "Austria" | ///
> loc_grand_name == "Azerbaijan" | ///
> loc_grand_name == "Belarus" | ///
> loc_grand_name == "Belgium" | ///
> loc_grand_name == "Bosnia and Herzegovina" | ///
> loc_grand_name == "Bulgaria" | ///
> loc_grand_name == "Croatia" | ///
> loc_grand_name == "Cyprus" | ///
> loc_grand_name == "Czech Republic" | ///
> loc_grand_name == "Denmark" | ///
> loc_grand_name == "Estonia" | ///
> loc_grand_name == "Finland" | ///
> loc_grand_name == "France" | ///
> loc_grand_name == "Georgia" | ///
> loc_grand_name == "Germany" | ///
> loc_grand_name == "Greece" | ///
> loc_grand_name == "Holy See" | ///
> loc_grand_name == "Hungary" | ///
> loc_grand_name == "Iceland" | ///
> loc_grand_name == "Ireland" | ///
> loc_grand_name == "Israel" | ///
> loc_grand_name == "Italy" | ///
> loc_grand_name == "Kazakhstan" | ///
> loc_grand_name == "Kosovo" | ///
> loc_grand_name == "Kyrgyzstan" | ///
> loc_grand_name == "Latvia" | ///
> loc_grand_name == "Liechtenstein" | ///
> loc_grand_name == "Lithuania" | ///
> loc_grand_name == "Luxembourg" | ///
> loc_grand_name == "Macedonia" | ///
> loc_grand_name == "Malta" | ///
> loc_grand_name == "Moldova" | ///
> loc_grand_name == "Monaco" | ///
> loc_grand_name == "Montenegro" | ///
> loc_grand_name == "Netherlands" | ///
> loc_grand_name == "Norway" | ///
> loc_grand_name == "Poland" | ///
> loc_grand_name == "Portugal" | ///
> loc_grand_name == "Romania" | ///
> loc_grand_name == "Russian Federation" | ///
> loc_grand_name == "San Marino" | ///
> loc_grand_name == "Serbia" | ///
> loc_grand_name == "Slovakia" | ///
> loc_grand_name == "Slovenia" | ///
> loc_grand_name == "Spain" | ///
> loc_grand_name == "Sweden" | ///
> loc_grand_name == "Switzerland" | ///
> loc_grand_name == "Turkey" | ///
> loc_grand_name == "Ukraine" | ///
> loc_grand_name == "United Kingdom" | ///
> loc_grand_name == "Uzbekistan" 
{txt}(13,130 observations deleted)

{com}. 
. 
. drop loc_grand_name
{txt}
{com}. 
. collapse (sum) TotDeaMeRaA05S00-DayDMuMeRaA05S00, by(date)
{txt}
{com}. 
. foreach var of varlist DayDeaMeRaA05S00 DayDeaLoRaA05S00 DayDeaUpRaA05S00 ///
> DayCasMeRaA05S00 DayCasLoRaA05S00 DayCasUpRaA05S00 {c -(}
{txt}  2{com}.         replace `var' = . if `var' == 0
{txt}  3{com}. {c )-}
{txt}(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)

{com}. *
.  
. label var TotDeaMeRaA05S00 "Total Deaths Mean SRIV"
{txt}
{com}. label var TotDeaLoRaA05S00 "Total Deaths Lower SRIV"
{txt}
{com}. label var TotDeaUpRaA05S00 "Total Deaths Upper SRIV"
{txt}
{com}. label var TotCasMeRaA05S00 "Total Cases Mean SRIV"
{txt}
{com}. label var TotCasLoRaA05S00 "Total Cases Lower SRIV"
{txt}
{com}. label var TotCasUpRaA05S00 "Total Cases Upper SRIV" 
{txt}
{com}. 
. label var DayDeaMeRaA05S00 "Daily Deaths Mean SRIV"
{txt}
{com}. label var DayDeaLoRaA05S00 "Daily Deaths Lower SRIV"
{txt}
{com}. label var DayDeaUpRaA05S00 "Daily Deaths Upper SRIV"
{txt}
{com}. label var DayCasMeRaA05S00 "Daily Cases Mean SRIV"
{txt}
{com}. label var DayCasLoRaA05S00 "Daily Cases Lower SRIV"
{txt}
{com}. label var DayCasUpRaA05S00 "Daily Cases Upper SRIV" 
{txt}
{com}. 
. label var DayDeMMeRaA05S00 "Daily deaths mean SRIV  DayDeM"
{txt}
{com}. label var DayCaMMeRaA05S00 "Daily cases mean SRIV  DayCaM"
{txt}
{com}. label var DayCbDMeRaA05S00 "Daily cases mean div by daily deaths mean SRIV  DayCbD"
{txt}
{com}. label var DayDMuMeRaA05S00 "Daily deaths scaled (times means of cases by deaths) SRIV"
{txt}
{com}. 
. gen loc_grand_name = "EURO"
{txt}
{com}. 
. order loc_grand_name date
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "SRIV EURO.dta", replace 
{txt}file SRIV EURO.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. *****************************
. 
. * gen SEARO
. 
. use "SRIV.dta", clear
{txt}
{com}. 
. keep if ///
> loc_grand_name == "Bangladesh" | ///
> loc_grand_name == "Bhutan" | ///
> loc_grand_name == "India" | ///
> loc_grand_name == "Indonesia" | ///
> loc_grand_name == "Maldives" | ///
> loc_grand_name == "Myanmar" | ///
> loc_grand_name == "Nepal" | ///
> loc_grand_name == "Sri Lanka" | ///
> loc_grand_name == "Thailand" | ///
> loc_grand_name == "Timor-Leste" 
{txt}(17,574 observations deleted)

{com}. 
. 
. drop loc_grand_name
{txt}
{com}. 
. collapse (sum) TotDeaMeRaA05S00-DayDMuMeRaA05S00, by(date)
{txt}
{com}. 
. foreach var of varlist DayDeaMeRaA05S00 DayDeaLoRaA05S00 DayDeaUpRaA05S00 ///
> DayCasMeRaA05S00 DayCasLoRaA05S00 DayCasUpRaA05S00 {c -(}
{txt}  2{com}.         replace `var' = . if `var' == 0
{txt}  3{com}. {c )-}
{txt}(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)

{com}. *
.  
. label var TotDeaMeRaA05S00 "Total Deaths Mean SRIV"
{txt}
{com}. label var TotDeaLoRaA05S00 "Total Deaths Lower SRIV"
{txt}
{com}. label var TotDeaUpRaA05S00 "Total Deaths Upper SRIV"
{txt}
{com}. label var TotCasMeRaA05S00 "Total Cases Mean SRIV"
{txt}
{com}. label var TotCasLoRaA05S00 "Total Cases Lower SRIV"
{txt}
{com}. label var TotCasUpRaA05S00 "Total Cases Upper SRIV" 
{txt}
{com}. 
. label var DayDeaMeRaA05S00 "Daily Deaths Mean SRIV"
{txt}
{com}. label var DayDeaLoRaA05S00 "Daily Deaths Lower SRIV"
{txt}
{com}. label var DayDeaUpRaA05S00 "Daily Deaths Upper SRIV"
{txt}
{com}. label var DayCasMeRaA05S00 "Daily Cases Mean SRIV"
{txt}
{com}. label var DayCasLoRaA05S00 "Daily Cases Lower SRIV"
{txt}
{com}. label var DayCasUpRaA05S00 "Daily Cases Upper SRIV" 
{txt}
{com}. 
. label var DayDeMMeRaA05S00 "Daily deaths mean SRIV  DayDeM"
{txt}
{com}. label var DayCaMMeRaA05S00 "Daily cases mean SRIV  DayCaM"
{txt}
{com}. label var DayCbDMeRaA05S00 "Daily cases mean div by daily deaths mean SRIV  DayCbD"
{txt}
{com}. label var DayDMuMeRaA05S00 "Daily deaths scaled (times means of cases by deaths) SRIV"
{txt}
{com}. 
. gen loc_grand_name = "SEARO"
{txt}
{com}. 
. order loc_grand_name date
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "SRIV SEARO.dta", replace 
{txt}file SRIV SEARO.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. *****************************
. 
. * gen WPRO
. 
. use "SRIV.dta", clear
{txt}
{com}. 
. keep if ///
> loc_grand_name == "Australia" | ///
> loc_grand_name == "Brunei" | ///
> loc_grand_name == "Cambodia" | ///
> loc_grand_name == "China" | ///
> loc_grand_name == "Fiji" | ///
> loc_grand_name == "Japan" | ///
> loc_grand_name == "Laos" | ///
> loc_grand_name == "Malaysia" | ///
> loc_grand_name == "Mongolia" | ///
> loc_grand_name == "New Zealand" | ///
> loc_grand_name == "Papua New Guinea" | ///
> loc_grand_name == "Philippines" | ///
> loc_grand_name == "Singapore" | ///
> loc_grand_name == "South Korea" | ///
> loc_grand_name == "Vietnam" 
{txt}(17,069 observations deleted)

{com}. 
. 
. drop loc_grand_name
{txt}
{com}. 
. collapse (sum) TotDeaMeRaA05S00-DayDMuMeRaA05S00, by(date)
{txt}
{com}. 
. foreach var of varlist DayDeaMeRaA05S00 DayDeaLoRaA05S00 DayDeaUpRaA05S00 ///
> DayCasMeRaA05S00 DayCasLoRaA05S00 DayCasUpRaA05S00 {c -(}
{txt}  2{com}.         replace `var' = . if `var' == 0
{txt}  3{com}. {c )-}
{txt}(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)

{com}. *
.  
. label var TotDeaMeRaA05S00 "Total Deaths Mean SRIV"
{txt}
{com}. label var TotDeaLoRaA05S00 "Total Deaths Lower SRIV"
{txt}
{com}. label var TotDeaUpRaA05S00 "Total Deaths Upper SRIV"
{txt}
{com}. label var TotCasMeRaA05S00 "Total Cases Mean SRIV"
{txt}
{com}. label var TotCasLoRaA05S00 "Total Cases Lower SRIV"
{txt}
{com}. label var TotCasUpRaA05S00 "Total Cases Upper SRIV" 
{txt}
{com}. 
. label var DayDeaMeRaA05S00 "Daily Deaths Mean SRIV"
{txt}
{com}. label var DayDeaLoRaA05S00 "Daily Deaths Lower SRIV"
{txt}
{com}. label var DayDeaUpRaA05S00 "Daily Deaths Upper SRIV"
{txt}
{com}. label var DayCasMeRaA05S00 "Daily Cases Mean SRIV"
{txt}
{com}. label var DayCasLoRaA05S00 "Daily Cases Lower SRIV"
{txt}
{com}. label var DayCasUpRaA05S00 "Daily Cases Upper SRIV" 
{txt}
{com}. 
. label var DayDeMMeRaA05S00 "Daily deaths mean SRIV  DayDeM"
{txt}
{com}. label var DayCaMMeRaA05S00 "Daily cases mean SRIV  DayCaM"
{txt}
{com}. label var DayCbDMeRaA05S00 "Daily cases mean div by daily deaths mean SRIV  DayCbD"
{txt}
{com}. label var DayDMuMeRaA05S00 "Daily deaths scaled (times means of cases by deaths) SRIV"
{txt}
{com}. 
. gen loc_grand_name = "WPRO"
{txt}
{com}. 
. order loc_grand_name date
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "SRIV WPRO.dta", replace 
{txt}file SRIV WPRO.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. ******************
. 
. * append regions
. 
. use "SRIV GLOBAL.dta", clear 
{txt}
{com}. 
. local list4 AFRO AMRO EMRO EURO SEARO WPRO
{txt}
{com}. 
. foreach region of local list4 {c -(}
{txt}  2{com}. 
.         append using "SRIV `region'.dta"
{txt}  3{com}.         
. {c )-}
{txt}
{com}. *
. 
. 
. 
. 
. * gen vars by location 
. 
. foreach var of varlist TotDeaMeRaA05S00-DayDMuMeRaA05S00 {c -(}
{txt}  2{com}. 
. 
.         qui gen `var'AFRO = `var' 
{txt}  3{com}.         qui replace `var'AFRO = . if loc_grand_name != "AFRO"
{txt}  4{com}.         
.         qui gen `var'AMRO = `var'
{txt}  5{com}.         qui replace `var'AMRO = . if loc_grand_name != "AMRO"
{txt}  6{com}.         
.         qui gen `var'EMRO = `var'
{txt}  7{com}.         qui replace `var'EMRO = . if loc_grand_name != "EMRO"
{txt}  8{com}.         
.         qui gen `var'EURO = `var'
{txt}  9{com}.         qui replace `var'EURO = . if loc_grand_name != "EURO"
{txt} 10{com}.         
.         qui gen `var'GLOBAL = `var'
{txt} 11{com}.         qui replace `var'GLOBAL = . if loc_grand_name != " GLOBAL"
{txt} 12{com}.         
.         qui gen `var'SEARO = `var'
{txt} 13{com}.         qui replace `var'SEARO = . if loc_grand_name != "SEARO"
{txt} 14{com}.         
.         qui gen `var'WPRO = `var'
{txt} 15{com}.         qui replace `var'WPRO = . if loc_grand_name != "WPRO"
{txt} 16{com}.         
.         
.         label var `var'AFRO "`var' AFRO"
{txt} 17{com}.         label var `var'AMRO "`var' AMRO"
{txt} 18{com}.         label var `var'EMRO "`var' EMRO"
{txt} 19{com}.         label var `var'EURO "`var' EURO"
{txt} 20{com}.         label var `var'GLOBAL "`var' GLOBAL"
{txt} 21{com}.         label var `var'SEARO "`var' SEARO"
{txt} 22{com}.         label var `var'WPRO "`var' WPRO"
{txt} 23{com}. 
.                                 
. {c )-}
{txt}
{com}. *
. 
. 
. 
. 
. 
. 
. order loc_grand_name date
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "CovidVisualizedGlobal SRIV.dta", replace 
{txt}file CovidVisualizedGlobal SRIV.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. ***********************
. 
. * graphs
. 
. 
. grstyle init
{res}{txt}
{com}. 
. grstyle color background white
{txt}
{com}. 
. 
. 
. local list5 GLOBAL AFRO AMRO EMRO EURO SEARO WPRO
{txt}
{com}. 
. foreach region of local list5 {c -(}
{txt}  2{com}. 
.         
. 
.         * daily deaths 
.         
.         twoway ///
>         (line DayDeaMeRaA05S00`region' date, sort lcolor(black)) ///
>         , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
>         xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
>         ytitle(Daily deaths) title("COVID-19 daily deaths, `region', SRIV, default scenario", size(medium)) ///
>         xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) 
{txt}  3{com}.         
.         qui graph save "graph `region' 1 COVID-19 daily deaths, default scenario, `region', SRIV.gph", replace
{txt}  4{com}.         qui graph export "graph `region' 1 COVID-19 daily deaths, default scenario, `region', SRIV.pdf", replace
{txt}  5{com}.         
.         
.         
.         
.         * daily deaths CI
.         
.         twoway ///
>         (rarea DayDeaLoRaA05S00`region' DayDeaUpRaA05S00`region' date, sort color(black*.2)) ///
>         (line DayDeaMeRaA05S00`region' date, sort lcolor(black)) ///
>         , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
>         xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
>         ytitle(Daily deaths) title("COVID-19 daily deaths, `region', SRIV, default scenario", size(medium)) ///
>         xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) ///
>         subtitle("with confidence limits", size(small))
{txt}  6{com}.         
.         qui graph save "graph `region' 2 COVID-19 daily deaths, default scenario, `region', SRIV.gph", replace
{txt}  7{com}.         qui graph export "graph `region' 2 COVID-19 daily deaths, default scenario, `region', SRIV.pdf", replace
{txt}  8{com}.         
.         
.         
.         
.         * daily cases 
.         
.         twoway ///
>         (line DayCasMeRaA05S00`region' date, sort lcolor(black)) ///
>         , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
>         xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
>         ytitle(Daily cases) title("COVID-19 daily cases, `region', SRIV, default scenario", size(medium)) ///
>         xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) 
{txt}  9{com}.         
.         qui graph save "graph `region' 3 COVID-19 daily cases, default scenario, `region', SRIV.gph", replace
{txt} 10{com}.         qui graph export "graph `region' 3 COVID-19 daily cases, default scenario, `region', SRIV.pdf", replace
{txt} 11{com}.         
.         
.         
.         
.         * daily cases CI
.         
.         twoway ///
>         (rarea DayCasLoRaA05S00`region' DayCasUpRaA05S00`region' date, sort color(black*.2)) ///
>         (line DayCasMeRaA05S00`region' date, sort lcolor(black)) ///
>         , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
>         xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
>         ytitle(Daily cases) title("COVID-19 daily cases, `region', SRIV, default scenario", size(medium)) ///
>         xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) ///
>         subtitle("with confidence limits", size(small))
{txt} 12{com}.         
.         qui graph save "graph `region' 4 COVID-19 daily cases, default scenario, `region', SRIV.gph", replace
{txt} 13{com}.         qui graph export "graph `region' 4 COVID-19 daily cases, default scenario, `region', SRIV.pdf", replace
{txt} 14{com}.         
.         
.         
.         
.         * total deaths 
.         
.         twoway ///
>         (line TotDeaMeRaA05S00`region' date, sort lcolor(black)) ///
>         , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
>         xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
>         ytitle(Total deaths) title("COVID-19 total deaths, `region', SRIV, default scenario", size(medium)) ///
>         xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) 
{txt} 15{com}.         
.         qui graph save "graph `region' 5 COVID-19 total deaths, default scenario, `region', SRIV.gph", replace
{txt} 16{com}.         qui graph export "graph `region' 5 COVID-19 total deaths, default scenario, `region', SRIV.pdf", replace
{txt} 17{com}.         
.         
.         
.         
.         * total deaths CI
.         
.         twoway ///
>         (rarea TotDeaLoRaA05S00`region' TotDeaUpRaA05S00`region' date, sort color(black*.2)) ///
>         (line TotDeaMeRaA05S00`region' date, sort lcolor(black)) ///
>         , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
>         xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
>         ytitle(Total deaths) title("COVID-19 total deaths, `region', SRIV, default scenario", size(medium)) ///
>         xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) ///
>         subtitle("with confidence limits", size(small))
{txt} 18{com}.         
.         qui graph save "graph `region' 6 COVID-19 total deaths, default scenario, `region', SRIV.gph", replace
{txt} 19{com}.         qui graph export "graph `region' 6 COVID-19 total deaths, default scenario, `region', SRIV.pdf", replace
{txt} 20{com}.         
.         
.         
.         
.         * total cases 
.         
.         twoway ///
>         (line TotCasMeRaA05S00`region' date, sort lcolor(black)) ///
>         , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
>         xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
>         ytitle(Total cases) title("COVID-19 total cases, `region', SRIV, default scenario", size(medium)) ///
>         xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) 
{txt} 21{com}.         
.         qui graph save "graph `region' 7 COVID-19 total cases, default scenario, `region', SRIV.gph", replace
{txt} 22{com}.         qui graph export "graph `region' 7 COVID-19 total cases, default scenario, `region', SRIV.pdf", replace
{txt} 23{com}.         
.         
.         
.         
.         * total cases CI
.         
.         twoway ///
>         (rarea TotCasLoRaA05S00`region' TotCasUpRaA05S00`region' date, sort color(black*.2)) ///
>         (line TotCasMeRaA05S00`region' date, sort lcolor(black)) ///
>         , xtitle(Date) xlabel(#5, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
>         xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
>         ytitle(Total cases) title("COVID-19 total cases, `region', SRIV, default scenario", size(medium)) ///
>         xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) ///
>         subtitle("with confidence limits", size(small))
{txt} 24{com}.         
.         qui graph save "graph `region' 8 COVID-19 total cases, default scenario, `region', SRIV.gph", replace
{txt} 25{com}.         qui graph export "graph `region' 8 COVID-19 total cases, default scenario, `region', SRIV.pdf", replace
{txt} 26{com}. 
.         
.         
.         
.         * DayCas DayDeaDay Dea_multip
.         
.         twoway ///
>         (line DayCasMeRaA05S00`region' date, sort lcolor(blue)) ///
>         (line DayDeaMeRaA05S00`region' date, sort lcolor(red)) ///
>         (line DayDMuMeRaA05S00`region' date, sort lpattern(dot) lcolor(red)) ///
>         if date > td(01jan2020) ///
>         , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
>         xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
>         ytitle(Daily cases and deaths) title("COVID-19 daily cases and deaths, `region', SRIV ", size(medium)) ///
>         xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) yscale(titlegap(4)) legend(region(lcolor(none)))  ///
>         legend(order(1 "Daily cases" 2 "Daily deaths" 3 "Daily deaths scaled for visualization") size(small)) ///
>         subtitle("Daily deaths, scaled = times (means of cases divided by deaths) for visualization only", size(small)) ///
>         note("Current scenario, mean estimate")
{txt} 27{com}.         
.         qui graph save "graph `region' 11 COVID-19 daily deaths and cases `region', SRIV .gph", replace
{txt} 28{com}.         qui graph export "graph `region' 11 COVID-19 daily deaths and cases `region', SRIV .pdf", replace
{txt} 29{com}. 
. 
.  
. {c )-}
{res}{txt}
{com}. *
. 
. 
. 
. 
. 
. 
. *******************************
. 
. * regions together
. 
. 
. 
. 
. * daily deaths, with GLOBAL
. 
. twoway ///
> (line DayDeaMeRaA05S00AFRO date, sort lcolor(brown)) ///
> (line DayDeaMeRaA05S00AMRO date, sort lcolor(red)) ///
> (line DayDeaMeRaA05S00EMRO date, sort lcolor(gold)) ///
> (line DayDeaMeRaA05S00EURO date, sort lcolor(green)) ///
> (line DayDeaMeRaA05S00SEARO date, sort lcolor(cyan)) ///
> (line DayDeaMeRaA05S00WPRO date, sort lcolor(blue)) ///
> (line DayDeaMeRaA05S00GLOBAL date, sort lcolor(black) lwidth(thick)) ///
> , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(forty_five)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, WHO regions, SRIV", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "AFRO" 2 "AMRO" 3 "EMRO" 4 "EURO" 5 "SEARO" 6 "WPRO" 7 "GLOBAL") size(small) rows (2)) ///
> subtitle("with GLOBAL", size(small))
{res}{txt}
{com}. 
. qui graph save "graph 1a COVID-19 daily deaths, regions together, SRIV.gph", replace
{txt}
{com}. qui graph export "graph 1a COVID-19 daily deaths, regions together, SRIV.pdf", replace
{txt}
{com}. 
. 
. 
. 
. * daily deaths, without GLOBAL
. 
. twoway ///
> (line DayDeaMeRaA05S00AFRO date, sort lcolor(brown)) ///
> (line DayDeaMeRaA05S00AMRO date, sort lcolor(red)) ///
> (line DayDeaMeRaA05S00EMRO date, sort lcolor(gold)) ///
> (line DayDeaMeRaA05S00EURO date, sort lcolor(green)) ///
> (line DayDeaMeRaA05S00SEARO date, sort lcolor(cyan)) ///
> (line DayDeaMeRaA05S00WPRO date, sort lcolor(blue)) ///
> , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(forty_five)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, WHO regions, SRIV", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "AFRO" 2 "AMRO" 3 "EMRO" 4 "EURO" 5 "SEARO" 6 "WPRO") size(small) rows (2)) ///
> subtitle("without GLOBAL", size(small))
{res}{txt}
{com}. 
. qui graph save "graph 1b COVID-19 daily deaths, regions together wo global, SRIV.gph", replace
{txt}
{com}. qui graph export "graph 1b COVID-19 daily deaths, regions together wo global, SRIV.pdf", replace
{txt}
{com}. 
. 
. 
. 
. * daily cases, with GLOBAL
. 
. twoway ///
> (line DayCasMeRaA05S00AFRO date, sort lcolor(brown)) ///
> (line DayCasMeRaA05S00AMRO date, sort lcolor(red)) ///
> (line DayCasMeRaA05S00EMRO date, sort lcolor(gold)) ///
> (line DayCasMeRaA05S00EURO date, sort lcolor(green)) ///
> (line DayCasMeRaA05S00SEARO date, sort lcolor(cyan)) ///
> (line DayCasMeRaA05S00WPRO date, sort lcolor(blue)) ///
> (line DayCasMeRaA05S00GLOBAL date, sort lcolor(black) lwidth(thick)) ///
> , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(forty_five)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, WHO regions, SRIV", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "AFRO" 2 "AMRO" 3 "EMRO" 4 "EURO" 5 "SEARO" 6 "WPRO" 7 "GLOBAL") size(small) rows (2)) ///
> subtitle("with GLOBAL", size(small))
{res}{txt}
{com}. 
. qui graph save "graph 2a COVID-19 daily cases, regions together, SRIV.gph", replace
{txt}
{com}. qui graph export "graph 2a COVID-19 daily cases, regions together, SRIV.pdf", replace
{txt}
{com}. 
. 
. 
. 
. * daily cases, without GLOBAL
. 
. twoway ///
> (line DayCasMeRaA05S00AFRO date, sort lcolor(brown)) ///
> (line DayCasMeRaA05S00AMRO date, sort lcolor(red)) ///
> (line DayCasMeRaA05S00EMRO date, sort lcolor(gold)) ///
> (line DayCasMeRaA05S00EURO date, sort lcolor(green)) ///
> (line DayCasMeRaA05S00SEARO date, sort lcolor(cyan)) ///
> (line DayCasMeRaA05S00WPRO date, sort lcolor(blue)) ///
> , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(forty_five)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, WHO regions, SRIV", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "AFRO" 2 "AMRO" 3 "EMRO" 4 "EURO" 5 "SEARO" 6 "WPRO") size(small) rows (2)) ///
> subtitle("without GLOBAL", size(small))
{res}{txt}
{com}. 
. qui graph save "graph 2b COVID-19 daily cases, regions together wo global, SRIV.gph", replace
{txt}
{com}. qui graph export "graph 2b COVID-19 daily cases, regions together wo global, SRIV.pdf", replace
{txt}
{com}. 
. 
. 
. 
. 
. * total deaths, with GLOBAL
. 
. twoway ///
> (line TotDeaMeRaA05S00AFRO date, sort lcolor(brown)) ///
> (line TotDeaMeRaA05S00AMRO date, sort lcolor(red)) ///
> (line TotDeaMeRaA05S00EMRO date, sort lcolor(gold)) ///
> (line TotDeaMeRaA05S00EURO date, sort lcolor(green)) ///
> (line TotDeaMeRaA05S00SEARO date, sort lcolor(cyan)) ///
> (line TotDeaMeRaA05S00WPRO date, sort lcolor(blue)) ///
> (line TotDeaMeRaA05S00GLOBAL date, sort lcolor(black) lwidth(thick)) ///
> , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(forty_five)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, WHO regions, SRIV", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "AFRO" 2 "AMRO" 3 "EMRO" 4 "EURO" 5 "SEARO" 6 "WPRO" 7 "GLOBAL") size(small) rows (2)) ///
> subtitle("with GLOBAL", size(small))
{res}{txt}
{com}. 
. qui graph save "graph 3a COVID-19 total deaths, regions together, SRIV.gph", replace
{txt}
{com}. qui graph export "graph 3a COVID-19 total deaths, regions together, SRIV.pdf", replace
{txt}
{com}. 
. 
. 
. * total deaths, without GLOBAL
. 
. twoway ///
> (line TotDeaMeRaA05S00AFRO date, sort lcolor(brown)) ///
> (line TotDeaMeRaA05S00AMRO date, sort lcolor(red)) ///
> (line TotDeaMeRaA05S00EMRO date, sort lcolor(gold)) ///
> (line TotDeaMeRaA05S00EURO date, sort lcolor(green)) ///
> (line TotDeaMeRaA05S00SEARO date, sort lcolor(cyan)) ///
> (line TotDeaMeRaA05S00WPRO date, sort lcolor(blue)) ///
> , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(forty_five)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, WHO regions, SRIV", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "AFRO" 2 "AMRO" 3 "EMRO" 4 "EURO" 5 "SEARO" 6 "WPRO") size(small) rows (2)) ///
> subtitle("without GLOBAL", size(small))
{res}{txt}
{com}. 
. qui graph save "graph 3b COVID-19 total deaths, regions together wo global, SRIV.gph", replace
{txt}
{com}. qui graph export "graph 3b COVID-19 total deaths, regions together wo global, SRIV.pdf", replace
{txt}
{com}. 
. 
. 
. 
. 
. * total cases, with GLOBAL
. 
. twoway ///
> (line TotCasMeRaA05S00AFRO date, sort lcolor(brown)) ///
> (line TotCasMeRaA05S00AMRO date, sort lcolor(red)) ///
> (line TotCasMeRaA05S00EMRO date, sort lcolor(gold)) ///
> (line TotCasMeRaA05S00EURO date, sort lcolor(green)) ///
> (line TotCasMeRaA05S00SEARO date, sort lcolor(cyan)) ///
> (line TotCasMeRaA05S00WPRO date, sort lcolor(blue)) ///
> (line TotCasMeRaA05S00GLOBAL date, sort lcolor(black) lwidth(thick)) ///
> , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(forty_five)) ///
> ytitle(Total cases) title("COVID-19 total cases, WHO regions, SRIV", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "AFRO" 2 "AMRO" 3 "EMRO" 4 "EURO" 5 "SEARO" 6 "WPRO" 7 "GLOBAL") size(small) rows (2)) ///
> subtitle("with GLOBAL", size(small))
{res}{txt}
{com}. 
. qui graph save "graph 4a COVID-19 total cases, regions together, SRIV.gph", replace
{txt}
{com}. qui graph export "graph 4a COVID-19 total cases, regions together, SRIV.pdf", replace
{txt}
{com}. 
. 
. 
. * total cases, without GLOBAL
. 
. twoway ///
> (line TotCasMeRaA05S00AFRO date, sort lcolor(brown)) ///
> (line TotCasMeRaA05S00AMRO date, sort lcolor(red)) ///
> (line TotCasMeRaA05S00EMRO date, sort lcolor(gold)) ///
> (line TotCasMeRaA05S00EURO date, sort lcolor(green)) ///
> (line TotCasMeRaA05S00SEARO date, sort lcolor(cyan)) ///
> (line TotCasMeRaA05S00WPRO date, sort lcolor(blue)) ///
> , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(forty_five)) ///
> ytitle(Total cases) title("COVID-19 total cases, WHO regions, SRIV", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(region(lcolor(none))) legend(bexpand) ///
> legend(order(1 "AFRO" 2 "AMRO" 3 "EMRO" 4 "EURO" 5 "SEARO" 6 "WPRO") size(small) rows (2)) ///
> subtitle("without GLOBAL", size(small))
{res}{txt}
{com}. 
. qui graph save "graph 4b COVID-19 total cases, regions together wo global, SRIV.gph", replace
{txt}
{com}. qui graph export "graph 4b COVID-19 total cases, regions together wo global, SRIV.pdf", replace
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. view "log CovidVisualizedGlobal SRIV 1.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211217/code/SRIV/log CovidVisualizedGlobal SRIV 1.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}17 Dec 2021, 14:31:42
{txt}{.-}
{smcl}
{txt}{sf}{ul off}