{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. ***************************************************************************
. * This is "do CovidVisualizedGlobal LANL.do"
. 
. * Project: Combine and visualize international periodically updating 
. * estimates of COVID-19 at the global level (CovidVisualizedGlobal)
. * Person: Farshad Pourmalek pourmalek_farshad at yahoo dot com
. * Time (initial): 2021-04-14
. ***************************************************************************
. 
. 
.                                                                                                          ***************************
. * To change update date, find and replace all, 2021-09-26 (old), with 2021-09-26 (new) <<--       <<<--- * change update date here *
.                                                                                                          ***************************
.                                                                                                                                                                                                                  
.                                                                                                                                                                                                                  
. *******************
. 
. * Get LANL estimates 
. 
. clear 
{txt}
{com}. 
. 
. * download four files for four outcomes
. 
. copy https://covid-19.bsvgateway.org/forecast/global/2021-09-26/files/2021-09-26_global_cumulative_daily_cases_website.csv 2021-09-26_global_cumulative_daily_cases_website.csv
{txt}
{com}. 
. copy https://covid-19.bsvgateway.org/forecast/global/2021-09-26/files/2021-09-26_global_cumulative_daily_deaths_website.csv 2021-09-26_global_cumulative_daily_deaths_website.csv
{txt}
{com}. 
. copy https://covid-19.bsvgateway.org/forecast/global/2021-09-26/files/2021-09-26_global_incidence_daily_cases_website.csv 2021-09-26_global_incidence_daily_cases_website.csv
{txt}
{com}. 
. copy https://covid-19.bsvgateway.org/forecast/global/2021-09-26/files/2021-09-26_global_incidence_daily_deaths_website.csv 2021-09-26_global_incidence_daily_deaths_website.csv 
{txt}
{com}. 
. 
. *******************
. 
. * import csv files
. 
. 
. * Total Cases
. import delimited using "2021-09-26_global_cumulative_daily_cases_website.csv", clear varnames(1)
{res}{text}(30 vars, 118,498 obs)

{com}. save "global_cumulative_daily_cases.dta", replace
{txt}file global_cumulative_daily_cases.dta saved

{com}. 
. * Total Deaths
. import delimited using "2021-09-26_global_cumulative_daily_deaths_website.csv", clear varnames(1)
{res}{text}(30 vars, 118,498 obs)

{com}. save "global_cumulative_daily_deaths.dta", replace
{txt}file global_cumulative_daily_deaths.dta saved

{com}. 
. * Daily Cases
. import delimited using "2021-09-26_global_incidence_daily_cases_website.csv", clear varnames(1)
{res}{text}(30 vars, 118,498 obs)

{com}. save "global_incidence_daily_cases.dta", replace
{txt}file global_incidence_daily_cases.dta saved

{com}. 
. * Daily Deaths 
. import delimited using "2021-09-26_global_incidence_daily_deaths_website.csv", clear varnames(1)
{res}{text}(30 vars, 118,498 obs)

{com}. save "global_incidence_daily_deaths.dta", replace
{txt}file global_incidence_daily_deaths.dta saved

{com}.         
. 
. 
. 
. 
. *******************
. 
. * Total Cases
. 
. use "global_cumulative_daily_cases.dta", clear 
{txt}
{com}. 
. collapse (sum) q50 q025 q975, by(date)
{txt}
{com}. 
. gen name = "global"
{txt}
{com}. 
. 
. * gen date
. 
. rename date date_original
{res}{txt}
{com}. 
. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21936{txt},{res}22597{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}22jan2020{txt},{res}13nov2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}662{col 51}{txt}missing .:  {res}0{txt}/{res}662

{txt}{col 19}mean:{res}{col 26} 22266.5{txt} = {res}17dec2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 191.247

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   22002{col 37}   22101{col 47} 22266.5{col 57}   22432{col 67}   22531
{col 26}28mar2020{col 36}05jul2020{col 46}17dec2020{col 56}01jun2021{col 66}08sep2021
{txt}
{com}. 
. drop year month day date2
{txt}
{com}. 
. 
. * rename estimate vars
. 
. rename q50  TotCasMeRaA04S00
{res}{txt}
{com}. rename q025 TotCasLoRaA04S00
{res}{txt}
{com}. rename q975 TotCasUpRaA04S00
{res}{txt}
{com}. 
. label var TotCasMeRaA04S00 "Total Cases Mean LANL S0"
{txt}
{com}. label var TotCasLoRaA04S00 "Total Cases Lower LANL S0"
{txt}
{com}. label var TotCasUpRaA04S00 "Total Cases Upper LANL S0"
{txt}
{com}. 
. save "global LANL Total Cases.dta", replace
{txt}file global LANL Total Cases.dta saved

{com}. 
. 
. 
. 
. 
. *******************
. 
. * Total Deaths
. 
. use "global_cumulative_daily_deaths.dta", clear 
{txt}
{com}. 
. collapse (sum) q50 q025 q975, by(date)
{txt}
{com}. 
. gen name = "global"
{txt}
{com}. 
. 
. * gen date
. 
. rename date date_original
{res}{txt}
{com}. 
. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21936{txt},{res}22597{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}22jan2020{txt},{res}13nov2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}662{col 51}{txt}missing .:  {res}0{txt}/{res}662

{txt}{col 19}mean:{res}{col 26} 22266.5{txt} = {res}17dec2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 191.247

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   22002{col 37}   22101{col 47} 22266.5{col 57}   22432{col 67}   22531
{col 26}28mar2020{col 36}05jul2020{col 46}17dec2020{col 56}01jun2021{col 66}08sep2021
{txt}
{com}. 
. drop year month day date2
{txt}
{com}. 
. 
. * rename estimate vars
. 
. rename q50  TotDeaMeRaA04S00
{res}{txt}
{com}. rename q025 TotDeaLoRaA04S00
{res}{txt}
{com}. rename q975 TotDeaUpRaA04S00
{res}{txt}
{com}. 
. label var TotDeaMeRaA04S00 "Total deaths Mean LANL S0"
{txt}
{com}. label var TotDeaLoRaA04S00 "Total deaths Lower LANL S0"
{txt}
{com}. label var TotDeaUpRaA04S00 "Total deaths Upper LANL S0"
{txt}
{com}. 
. 
. save "global LANL Total Deaths.dta", replace
{txt}file global LANL Total Deaths.dta saved

{com}. 
. 
. 
. 
. 
. 
. *******************
. 
. * Daily Cases
. 
. use "global_incidence_daily_cases.dta", clear 
{txt}
{com}. 
. collapse (sum) q50 q025 q975, by(date)
{txt}
{com}. 
. gen name = "global"
{txt}
{com}. 
. 
. * gen date
. 
. rename date date_original
{res}{txt}
{com}. 
. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21936{txt},{res}22597{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}22jan2020{txt},{res}13nov2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}662{col 51}{txt}missing .:  {res}0{txt}/{res}662

{txt}{col 19}mean:{res}{col 26} 22266.5{txt} = {res}17dec2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 191.247

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   22002{col 37}   22101{col 47} 22266.5{col 57}   22432{col 67}   22531
{col 26}28mar2020{col 36}05jul2020{col 46}17dec2020{col 56}01jun2021{col 66}08sep2021
{txt}
{com}. 
. drop year month day date2
{txt}
{com}. 
. 
. * rename estimate vars
. 
. rename q50  DayCasMeRaA04S00
{res}{txt}
{com}. rename q025 DayCasLoRaA04S00
{res}{txt}
{com}. rename q975 DayCasUpRaA04S00
{res}{txt}
{com}. 
. label var DayCasMeRaA04S00 "Daily cases Mean LANL S0"
{txt}
{com}. label var DayCasLoRaA04S00 "Daily cases Lower LANL S0"
{txt}
{com}. label var DayCasUpRaA04S00 "Daily cases Upper LANL S0"
{txt}
{com}. 
. 
. save "global LANL Daily Cases.dta", replace
{txt}file global LANL Daily Cases.dta saved

{com}. 
. 
. 
. 
. 
. 
. *******************
. 
. * Daily Deaths
. 
. use "global_incidence_daily_deaths.dta", clear 
{txt}
{com}. 
. collapse (sum) q50 q025 q975, by(date)
{txt}
{com}. 
. gen name = "global"
{txt}
{com}. 
. 
. * gen date
. 
. rename date date_original
{res}{txt}
{com}. 
. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21936{txt},{res}22597{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}22jan2020{txt},{res}13nov2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}662{col 51}{txt}missing .:  {res}0{txt}/{res}662

{txt}{col 19}mean:{res}{col 26} 22266.5{txt} = {res}17dec2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 191.247

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   22002{col 37}   22101{col 47} 22266.5{col 57}   22432{col 67}   22531
{col 26}28mar2020{col 36}05jul2020{col 46}17dec2020{col 56}01jun2021{col 66}08sep2021
{txt}
{com}. 
. drop year month day date2
{txt}
{com}. 
. 
. * rename estimate vars
. 
. rename q50  DayDeaMeRaA04S00
{res}{txt}
{com}. rename q025 DayDeaLoRaA04S00
{res}{txt}
{com}. rename q975 DayDeaUpRaA04S00
{res}{txt}
{com}. 
. label var DayDeaMeRaA04S00 "Daily deaths Mean LANL S0"
{txt}
{com}. label var DayDeaLoRaA04S00 "Daily deaths Lower LANL S0"
{txt}
{com}. label var DayDeaUpRaA04S00 "Daily deaths Upper LANL S0"
{txt}
{com}. 
. 
. save "global LANL Daily Deaths.dta", replace
{txt}file global LANL Daily Deaths.dta saved

{com}. 
. 
. 
. 
. 
. ******************
. 
. * merge four estimates files
. 
. 
. use "global LANL Total Cases.dta", clear 
{txt}
{com}. 
. merge 1:1 date using "global LANL Total Deaths.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             662{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge
{txt}
{com}. 
. merge 1:1 date using "global LANL Daily Cases.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             662{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge
{txt}
{com}. 
. merge 1:1 date using "global LANL Daily Deaths.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             662{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge
{txt}
{com}. 
. drop date_original  
{txt}
{com}. 
. order ///
> TotDeaLoRaA04S00 TotDeaMeRaA04S00 TotDeaUpRaA04S00 ///
> DayDeaLoRaA04S00 DayDeaMeRaA04S00 DayDeaUpRaA04S00 ///
> TotCasLoRaA04S00 TotCasMeRaA04S00 TotCasUpRaA04S00 ///
> DayCasLoRaA04S00 DayCasMeRaA04S00 DayCasUpRaA04S00
{txt}
{com}. 
. order date name
{txt}
{com}. 
. rename name loc_grand_name
{res}{txt}
{com}. 
. 
. 
. 
. 
. * gen cfr
. 
. gen DayCfrMeRaA04S00 = 100 * DayDeaMeRaA04S00 / DayCasMeRaA04S00
{txt}
{com}. gen DayCfrLoRaA04S00 = 100 * DayDeaLoRaA04S00 / DayCasLoRaA04S00
{txt}
{com}. gen DayCfrUpRaA04S00 = 100 * DayDeaUpRaA04S00 / DayCasUpRaA04S00
{txt}
{com}. 
. label var DayCfrMeRaA04S00 "Daily CFR Mean LANL S0"
{txt}
{com}. label var DayCfrLoRaA04S00 "Daily CFR Lower LANL S0"
{txt}
{com}. label var DayCfrUpRaA04S00 "Daily CFR Upper LANL S0"
{txt}
{com}. 
. 
. 
. 
. 
. 
. * gen "Daily cases mean div by daily deaths mean LANL DayCbD" for visulization of temporal relation of deaths and cases peaks 
. 
. 
. summ DayDeaMeRaA04S00 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~00 {c |}{res}        662    7691.285    3941.562          1      20757
{txt}
{com}. gen DayDeMMeRaA04S00  = r(mean)
{txt}
{com}. label var DayDeMMeRaA04S00  "Daily deaths mean LANL DayDeM"
{txt}
{com}. 
. summ DayCasMeRaA04S00  

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~00 {c |}{res}        662    378021.8    237440.7         98    1500821
{txt}
{com}. gen DayCaMMeRaA04S00  = r(mean)
{txt}
{com}. label var DayCaMMeRaA04S00  "Daily cases mean LANL DayCaM"
{txt}
{com}.                            
. gen DayCbDMeRaA04S00  = DayCaMMeRaA04S00  / DayDeMMeRaA04S00 
{txt}
{com}. label var DayCbDMeRaA04S00  "Daily cases mean div by daily deaths mean LANL DayCbD"
{txt}
{com}. summ DayCbDMeRaA04S00 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~00 {c |}{res}        662    49.14938           0   49.14938   49.14938
{txt}
{com}.                                               
. gen DayDMuMeRaA04S00  = DayDeaMeRaA04S00  * DayCbDMeRaA04S00 
{txt}
{com}. label var DayDMuMeRaA04S00  "Daily deaths scaled (times means of cases by deaths) LANL"
{txt}
{com}. summ DayDMuMeRaA04S00 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~00 {c |}{res}        662    378021.8    193725.3   49.14938    1020194
{txt}
{com}. 
. 
. 
. 
. ***********************
. 
. 
. * smooth 
. 
. tsset date, daily   
{res}{txt}{col 9}time variable:  {res}{col 25}date, 22Jan2020 to 13Nov2021
{txt}{col 17}delta:  {res}1 day
{txt}
{com}. 
. 
. tssmooth ma DayDeaMeRaA04S00_window = DayDeaMeRaA04S00 if DayDeaMeRaA04S00 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDeaMeRaA04S00 {p_end}
{txt}
{com}. 
. tssmooth ma DayDeaMeSmA04S00 = DayDeaMeRaA04S00_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDeaMeRaA04S00_window
{txt}
{smcl}
{com}. 
. label var DayDeaMeSmA04S00 "Daily deaths mean smooth A04 LANL"
{txt}
{com}. 
. drop DayDeaMeRaA04S00_window
{txt}
{com}. 
. 
. tssmooth ma DayDeaLoRaA04S00_window = DayDeaLoRaA04S00 if DayDeaLoRaA04S00 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDeaLoRaA04S00 {p_end}
{txt}
{com}. 
. tssmooth ma DayDeaLoSmA04S00 = DayDeaLoRaA04S00_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDeaLoRaA04S00_window
{txt}
{smcl}
{com}. 
. label var DayDeaLoSmA04S00 "Daily deaths lower smooth A04 LANL"
{txt}
{com}. 
. drop DayDeaLoRaA04S00_window
{txt}
{com}. 
. 
. tssmooth ma DayDeaUpRaA04S00_window = DayDeaUpRaA04S00 if DayDeaUpRaA04S00 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDeaUpRaA04S00 {p_end}
{txt}
{com}. 
. tssmooth ma DayDeaUpSmA04S00 = DayDeaUpRaA04S00_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDeaUpRaA04S00_window
{txt}
{smcl}
{com}. 
. label var DayDeaUpSmA04S00 "Daily deaths upper smooth A04 LANL"
{txt}
{com}. 
. drop DayDeaUpRaA04S00_window
{txt}
{com}. 
. 
. 
. tssmooth ma DayCasMeRaA04S00_window = DayCasMeRaA04S00 if DayCasMeRaA04S00 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayCasMeRaA04S00 {p_end}
{txt}
{com}. 
. tssmooth ma DayCasMeSmA04S00 = DayCasMeRaA04S00_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayCasMeRaA04S00_window
{txt}
{smcl}
{com}. 
. label var DayCasMeSmA04S00 "Daily cases mean smooth A04 LANL"
{txt}
{com}. 
. drop DayCasMeRaA04S00_window
{txt}
{com}. 
. 
. tssmooth ma DayCasLoRaA04S00_window = DayCasLoRaA04S00 if DayCasLoRaA04S00 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayCasLoRaA04S00 {p_end}
{txt}
{com}. 
. tssmooth ma DayCasLoSmA04S00 = DayCasLoRaA04S00_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayCasLoRaA04S00_window
{txt}
{smcl}
{com}. 
. label var DayCasLoSmA04S00 "Daily cases lower smooth A04 LANL"
{txt}
{com}. 
. drop DayCasLoRaA04S00_window
{txt}
{com}. 
. 
. tssmooth ma DayCasUpRaA04S00_window = DayCasUpRaA04S00 if DayCasUpRaA04S00 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayCasUpRaA04S00 {p_end}
{txt}
{com}. 
. tssmooth ma DayCasUpSmA04S00 = DayCasUpRaA04S00_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayCasUpRaA04S00_window
{txt}
{smcl}
{com}. 
. label var DayCasUpSmA04S00 "Daily cases upper smooth A04 LANL"
{txt}
{com}. 
. drop DayCasUpRaA04S00_window
{txt}
{com}. 
. 
. 
. 
. tssmooth ma DayDMuMeRaA04S00_window = DayDMuMeRaA04S00 if DayDMuMeRaA04S00 >= 0, window(3 1 3)
{txt}The smoother applied was
{res}{p 5 5 5}(1/7)*[x(t-3) + x(t-2) + x(t-1) + 1*x(t) + x(t+1) + x(t+2) + x(t+3)]; x(t)= DayDMuMeRaA04S00 {p_end}
{txt}
{com}. 
. tssmooth ma DayDMuMeSmA04S00 = DayDMuMeRaA04S00_window, weights( 1 2 3 <4> 3 2 1) replace
{txt}The smoother applied was
{res}{p 5 5 5}(1/16)*[1*x(t-3) + 2*x(t-2) + 3*x(t-1) + 4*x(t) + 3*x(t+1) + 2*x(t+2) + ...; x(t)= DayDMuMeRaA04S00_window
{txt}
{smcl}
{com}. 
. label var DayDMuMeSmA04S00 "Daily deaths scaled (times means of cases by deaths) smooth LANL"
{txt}
{com}. 
. drop DayDMuMeRaA04S00_window
{txt}
{com}. 
. 
. 
. 
. tsset, clear
{txt}
{com}. 
. 
. 
. 
. ***********************
. 
. * graphs
. 
. 
. grstyle init
{res}{txt}
{com}. 
. grstyle color background white
{txt}
{com}. 
. 
. 
. * daily deaths     
. 
. twoway (rarea DayDeaLoRaA04S00 DayDeaUpRaA04S00 date, sort color(green*.2)) ///
> (line DayDeaMeRaA04S00 date, sort lcolor(green*.7)) ///
> (line DayDeaMeSmA04S00 date, sort lcolor(green) lwidth(thick)) ///
> , xtitle(Date) xlabel(#24, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, global, LANL, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.    
. graph save "graph 1 COVID-19 daily deaths, global, LANL.gph", replace
{res}{txt}(file graph 1 COVID-19 daily deaths, global, LANL.gph saved)

{com}. graph export "graph 1 COVID-19 daily deaths, global, LANL.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211001/code/LANL/graph 1 COVID-19 daily deaths, global, LANL.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily cases
. 
. twoway (rarea DayCasLoRaA04S00 DayCasUpRaA04S00 date, sort color(green*.2)) ///
> (line DayCasMeRaA04S00 date, sort lcolor(green*.7)) ///
> (line DayCasMeSmA04S00 date, sort lcolor(green) lwidth(thick)) ///
> , xtitle(Date) xlabel(#24, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, global, LANL, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.    
. graph save "graph 2 COVID-19 daily cases, global, LANL.gph", replace
{res}{txt}(file graph 2 COVID-19 daily cases, global, LANL.gph saved)

{com}. graph export "graph 2 COVID-19 daily cases, global, LANL.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211001/code/LANL/graph 2 COVID-19 daily cases, global, LANL.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total deaths     
.            
. twoway (rarea TotDeaLoRaA04S00 TotDeaUpRaA04S00 date, sort color(green*.2)) ///
> (line TotDeaMeRaA04S00 date, sort lcolor(green)) ///
> , xtitle(Date) xlabel(#24, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, global, LANL, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.    
. graph save "graph 3 COVID-19 total deaths, global, LANL.gph", replace
{res}{txt}(file graph 3 COVID-19 total deaths, global, LANL.gph saved)

{com}. graph export "graph 3 COVID-19 total deaths, global, LANL.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211001/code/LANL/graph 3 COVID-19 total deaths, global, LANL.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total cases      
.            
. twoway (rarea TotCasLoRaA04S00 TotCasUpRaA04S00 date, sort color(green*.2)) ///
> (line TotCasMeRaA04S00 date, sort lcolor(green)) ///
> , xtitle(Date) xlabel(#24, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%15.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases) title("COVID-19 total cases, global, LANL, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.            
. graph save "graph 4 COVID-19 total cases, global, LANL.gph", replace
{res}{txt}(file graph 4 COVID-19 total cases, global, LANL.gph saved)

{com}. graph export "graph 4 COVID-19 total cases, global, LANL.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211001/code/LANL/graph 4 COVID-19 total cases, global, LANL.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily cfr
. 
. twoway (rarea DayCfrLoRaA04S00 DayCfrUpRaA04S00 date, sort color(green*.2)) ///
> (line DayCfrMeRaA04S00 date, sort lcolor(green)) ///
> , xtitle(Date) xlabel(#24, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR) title("COVID-19 daily CFR, global, LANL, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.            
. graph save "graph 5 COVID-19 daily CFR, global, LANL.gph", replace
{res}{txt}(file graph 5 COVID-19 daily CFR, global, LANL.gph saved)

{com}. graph export "graph 5 COVID-19 daily CFR, global, LANL.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211001/code/LANL/graph 5 COVID-19 daily CFR, global, LANL.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily cfr, 2021
. 
. twoway (rarea DayCfrLoRaA04S00 DayCfrUpRaA04S00 date, sort color(green*.2)) ///
> (line DayCfrMeRaA04S00 date, sort lcolor(green)) ///
> if date >= td(01jan2021) ///
> , xtitle(Date) xlabel(#12, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR) title("COVID-19 daily CFR, global, LANL, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) ///
> subtitle("after 2020-12-01", size(small))
{res}{txt}
{com}.            
. graph save "graph 6 COVID-19 daily CFR, global, LANL, 2021.gph", replace
{txt}(note: file graph 6 COVID-19 daily CFR, global, LANL, 2021.gph not found)
{res}{txt}(file graph 6 COVID-19 daily CFR, global, LANL, 2021.gph saved)

{com}. graph export "graph 6 COVID-19 daily CFR, global, LANL, 2021.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211001/code/LANL/graph 6 COVID-19 daily CFR, global, LANL, 2021.pdf written in PDF format)

{com}. 
. 
. 
. 
. * DayCas DayDeaDay Dea_multip
. 
. twoway ///
> (line DayCasMeRaA04S00  date, sort lcolor(blue*.3)) ///
> (line DayCasMeSmA04S00  date, sort lcolor(blue) lpattern(thick)) ///
> (line DayDeaMeRaA04S00  date, sort lcolor(red*.3)) ///
> (line DayDMuMeRaA04S00  date, sort lpattern(dot) lcolor(red)) ///
> (line DayDMuMeSmA04S00  date, sort lpattern(thick) lcolor(red)) ///
> if date >= td(01jan2020) ///
> , xtitle(Date) xlabel(#24, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases and deaths) title("COVID-19 daily cases and deaths, global, LANL", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) yscale(titlegap(4)) legend(region(lcolor(none)))  ///
> legend(order(1 "Daily cases" 3 "Daily deaths" 5 "Daily deaths scaled for visualization") size(small)) ///
> subtitle("Daily deaths, scaled = times (means of cases divided by deaths) for visualization only", size(small)) ///
> note("Current scenario, mean estimate")
{p 0 4 2}
{txt}(note:  named style
thick not found in class
linepattern,  default attributes used)
{p_end}
{p 0 4 2}
{txt}(note:  named style
thick not found in class
linepattern,  default attributes used)
{p_end}
{p 0 4 2}
{txt}(note:  named style
thick not found in class
linepattern,  default attributes used)
{p_end}
{p 0 4 2}
{txt}(note:  named style
thick not found in class
linepattern,  default attributes used)
{p_end}
{res}{txt}
{com}. 
. qui graph save "graph 7 COVID-19 daily deaths and cases global, LANL.gph", replace
{txt}
{com}. qui graph export "graph 7 COVID-19 daily deaths and cases global, LANL.pdf", replace
{txt}
{com}. 
. 
. 
. 
. ****************
. 
. sort date loc_grand_name
{txt}
{com}. 
. order date loc_grand_name
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. 
. save "CovidVisualizedGlobal LANL.dta", replace
{txt}file CovidVisualizedGlobal LANL.dta saved

{com}. 
. 
. 
. view "log CovidVisualizedGlobal LANL.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20211001/code/LANL/log CovidVisualizedGlobal LANL.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 2 Oct 2021, 18:25:10
{txt}{.-}
{smcl}
{txt}{sf}{ul off}