{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. ***************************************************************************
. * This is "do globalcovid LANL.do"
. 
. * Project: Rapid review of estimates of global COVID-19
. * Person: Farshad Pourmalek pourmalek_farshad@yahoo.com
. * Time (initial): 2021-04-14
. 
. * OBJECTIVE: Get, prepare, and combine component studies' estimates
. ***************************************************************************
. 
. 
. ************************
. * This Update 20200428 *
. ************************
. 
. 
. ************************
. * LANL date  
. * 20210425 
. ************************
. 
. 
. * Get LANL estimates 
. 
. clear 
{txt}
{com}. 
. 
. * download four files for four outcomes
. 
. copy https://covid-19.bsvgateway.org/forecast/global/2021-04-25/files/2021-04-25_global_cumulative_daily_cases_website.csv 2021-04-25_global_cumulative_daily_cases_website.csv
{txt}
{com}. 
. copy https://covid-19.bsvgateway.org/forecast/global/2021-04-25/files/2021-04-25_global_cumulative_daily_deaths_website.csv 2021-04-25_global_cumulative_daily_deaths_website.csv
{txt}
{com}. 
. copy https://covid-19.bsvgateway.org/forecast/global/2021-04-25/files/2021-04-25_global_incidence_daily_cases_website.csv 2021-04-25_global_incidence_daily_cases_website.csv
{txt}
{com}. 
. copy https://covid-19.bsvgateway.org/forecast/global/2021-04-25/files/2021-04-25_global_incidence_daily_deaths_website.csv 2021-04-25_global_incidence_daily_deaths_website.csv 
{txt}
{com}. 
. 
. 
. * import csv files
. 
. 
. 
. * Total Cases
. import delimited using "2021-04-25_global_cumulative_daily_cases_website.csv", clear varnames(1)
{res}{text}(30 vars, 86,868 obs)

{com}. save "global_cumulative_daily_cases.dta", replace
{txt}file global_cumulative_daily_cases.dta saved

{com}. 
. * Total Deaths
. import delimited using "2021-04-25_global_cumulative_daily_deaths_website.csv", clear varnames(1)
{res}{text}(30 vars, 86,868 obs)

{com}. save "global_cumulative_daily_deaths.dta", replace
{txt}file global_cumulative_daily_deaths.dta saved

{com}. 
. * Daily Cases
. import delimited using "2021-04-25_global_incidence_daily_cases_website.csv", clear varnames(1)
{res}{text}(30 vars, 86,868 obs)

{com}. save "global_incidence_daily_cases.dta", replace
{txt}file global_incidence_daily_cases.dta saved

{com}. 
. * Daily Deaths 
. import delimited using "2021-04-25_global_incidence_daily_deaths_website.csv", clear varnames(1)
{res}{text}(30 vars, 86,868 obs)

{com}. save "global_incidence_daily_deaths.dta", replace
{txt}file global_incidence_daily_deaths.dta saved

{com}.         
. 
. 
. 
. 
. *******************
. 
. 
. * Total Cases
. 
. use "global_cumulative_daily_cases.dta", clear 
{txt}
{com}. 
. collapse (sum) q50 q025 q975, by(date)
{txt}
{com}. 
. gen name = "global"
{txt}
{com}. 
. 
. * gen date
. 
. rename date date_original
{res}{txt}
{com}. 
. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21936{txt},{res}22443{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}22jan2020{txt},{res}12jun2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}508{col 51}{txt}missing .:  {res}0{txt}/{res}508

{txt}{col 19}mean:{res}{col 26} 22189.5{txt} = {res}01oct2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 146.791

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21986{col 37} 22062.5{col 47} 22189.5{col 57} 22316.5{col 67}   22393
{col 26}12mar2020{col 36}27may2020{col 46}01oct2020{col 56}05feb2021{col 66}23apr2021
{txt}
{com}. 
. drop year month day date2
{txt}
{com}. 
. 
. * rename estimate vars
. 
. rename q50  TotCasMeRaA04S00V02
{res}{txt}
{com}. rename q025 TotCasLoRaA04S00V02
{res}{txt}
{com}. rename q975 TotCasUpRaA04S00V02
{res}{txt}
{com}. 
. label var TotCasMeRaA04S00V02 "Total Cases Mean LANL S0 V2"
{txt}
{com}. label var TotCasLoRaA04S00V02 "Total Cases Lower LANL S0 V2"
{txt}
{com}. label var TotCasUpRaA04S00V02 "Total Cases Upper LANL S0 V2"
{txt}
{com}. 
. save "global LANL Total Cases.dta", replace
{txt}file global LANL Total Cases.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. *******************
. 
. * Total Deaths
. 
. use "global_cumulative_daily_deaths.dta", clear 
{txt}
{com}. 
. collapse (sum) q50 q025 q975, by(date)
{txt}
{com}. 
. gen name = "global"
{txt}
{com}. 
. 
. * gen date
. 
. rename date date_original
{res}{txt}
{com}. 
. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21936{txt},{res}22443{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}22jan2020{txt},{res}12jun2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}508{col 51}{txt}missing .:  {res}0{txt}/{res}508

{txt}{col 19}mean:{res}{col 26} 22189.5{txt} = {res}01oct2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 146.791

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21986{col 37} 22062.5{col 47} 22189.5{col 57} 22316.5{col 67}   22393
{col 26}12mar2020{col 36}27may2020{col 46}01oct2020{col 56}05feb2021{col 66}23apr2021
{txt}
{com}. 
. drop year month day date2
{txt}
{com}. 
. 
. * rename estimate vars
. 
. rename q50  TotDeaMeRaA04S00V02
{res}{txt}
{com}. rename q025 TotDeaLoRaA04S00V02
{res}{txt}
{com}. rename q975 TotDeaUpRaA04S00V02
{res}{txt}
{com}. 
. label var TotDeaMeRaA04S00V02 "Total deaths Mean LANL S0 V2"
{txt}
{com}. label var TotDeaLoRaA04S00V02 "Total deaths Lower LANL S0 V2"
{txt}
{com}. label var TotDeaUpRaA04S00V02 "Total deaths Upper LANL S0 V2"
{txt}
{com}. 
. 
. save "global LANL Total Deaths.dta", replace
{txt}file global LANL Total Deaths.dta saved

{com}. 
. 
. 
. 
. *******************
. 
. * Daily Cases
. 
. use "global_incidence_daily_cases.dta", clear 
{txt}
{com}. 
. collapse (sum) q50 q025 q975, by(date)
{txt}
{com}. 
. gen name = "global"
{txt}
{com}. 
. 
. * gen date
. 
. rename date date_original
{res}{txt}
{com}. 
. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21936{txt},{res}22443{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}22jan2020{txt},{res}12jun2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}508{col 51}{txt}missing .:  {res}0{txt}/{res}508

{txt}{col 19}mean:{res}{col 26} 22189.5{txt} = {res}01oct2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 146.791

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21986{col 37} 22062.5{col 47} 22189.5{col 57} 22316.5{col 67}   22393
{col 26}12mar2020{col 36}27may2020{col 46}01oct2020{col 56}05feb2021{col 66}23apr2021
{txt}
{com}. 
. drop year month day date2
{txt}
{com}. 
. 
. * rename estimate vars
. 
. rename q50  DayCasMeRaA04S00V02
{res}{txt}
{com}. rename q025 DayCasLoRaA04S00V02
{res}{txt}
{com}. rename q975 DayCasUpRaA04S00V02
{res}{txt}
{com}. 
. label var DayCasMeRaA04S00V02 "Daily cases Mean LANL S0 V2"
{txt}
{com}. label var DayCasLoRaA04S00V02 "Daily cases Lower LANL S0 V2"
{txt}
{com}. label var DayCasUpRaA04S00V02 "Daily cases Upper LANL S0 V2"
{txt}
{com}. 
. 
. save "global LANL Daily Cases.dta", replace
{txt}file global LANL Daily Cases.dta saved

{com}. 
. 
. 
. *******************
. 
. 
. 
. 
. 
. 
. * Daily Deaths
. 
. use "global_incidence_daily_deaths.dta", clear 
{txt}
{com}. 
. collapse (sum) q50 q025 q975, by(date)
{txt}
{com}. 
. gen name = "global"
{txt}
{com}. 
. 
. * gen date
. 
. rename date date_original
{res}{txt}
{com}. 
. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21936{txt},{res}22443{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}22jan2020{txt},{res}12jun2021{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}508{col 51}{txt}missing .:  {res}0{txt}/{res}508

{txt}{col 19}mean:{res}{col 26} 22189.5{txt} = {res}01oct2020{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 146.791

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21986{col 37} 22062.5{col 47} 22189.5{col 57} 22316.5{col 67}   22393
{col 26}12mar2020{col 36}27may2020{col 46}01oct2020{col 56}05feb2021{col 66}23apr2021
{txt}
{com}. 
. drop year month day date2
{txt}
{com}. 
. 
. * rename estimate vars
. 
. rename q50  DayDeaMeRaA04S00V02
{res}{txt}
{com}. rename q025 DayDeaLoRaA04S00V02
{res}{txt}
{com}. rename q975 DayDeaUpRaA04S00V02
{res}{txt}
{com}. 
. label var DayDeaMeRaA04S00V02 "Daily deaths Mean LANL S0 V2"
{txt}
{com}. label var DayDeaLoRaA04S00V02 "Daily deaths Lower LANL S0 V2"
{txt}
{com}. label var DayDeaUpRaA04S00V02 "Daily deaths Upper LANL S0 V2"
{txt}
{com}. 
. 
. save "global LANL Daily Deaths.dta", replace
{txt}file global LANL Daily Deaths.dta saved

{com}. 
. 
. 
. ******************
. 
. * merge four estimates files
. 
. 
. use "global LANL Total Cases.dta", clear 
{txt}
{com}. 
. merge 1:1 date using "global LANL Total Deaths.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             508{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge
{txt}
{com}. 
. merge 1:1 date using "global LANL Daily Cases.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             508{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge
{txt}
{com}. 
. merge 1:1 date using "global LANL Daily Deaths.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}             508{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge
{txt}
{com}. 
. drop date_original  
{txt}
{com}. 
. order ///
> TotDeaLoRaA04S00V02 TotDeaMeRaA04S00V02 TotDeaUpRaA04S00V02 ///
> DayDeaLoRaA04S00V02 DayDeaMeRaA04S00V02 DayDeaUpRaA04S00V02 ///
> TotCasLoRaA04S00V02 TotCasMeRaA04S00V02 TotCasUpRaA04S00V02 ///
> DayCasLoRaA04S00V02 DayCasMeRaA04S00V02 DayCasUpRaA04S00V02
{txt}
{com}. 
. order date name
{txt}
{com}. 
. rename name loc_grand_name
{res}{txt}
{com}. 
. 
. 
. 
. 
. * gen cfr
. 
. gen DayCfrMeRaA04S00V02 = 100 * DayDeaMeRaA04S00V02 / DayCasMeRaA04S00V02
{txt}
{com}. gen DayCfrLoRaA04S00V02 = 100 * DayDeaLoRaA04S00V02 / DayCasLoRaA04S00V02
{txt}
{com}. gen DayCfrUpRaA04S00V02 = 100 * DayDeaUpRaA04S00V02 / DayCasUpRaA04S00V02
{txt}
{com}. 
. label var DayCfrMeRaA04S00V02 "Daily CFR Mean LANL S0 V2"
{txt}
{com}. label var DayCfrLoRaA04S00V02 "Daily CFR Lower LANL S0 V2"
{txt}
{com}. label var DayCfrUpRaA04S00V02 "Daily CFR Upper LANL S0 V2"
{txt}
{com}. 
. 
. 
. 
. 
. 
. * gen "Daily cases mean div by daily deaths mean LANL DayCbD" for visulization of temporal relation of deaths and cases peaks 
. 
. 
.         summ DayDeaMeRaA04S00V02 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~02 {c |}{res}        508    7154.982    4179.864          1      17906
{txt}
{com}.         gen DayDeMMeRaA04S00V02  = r(mean)
{txt}
{com}.         label var DayDeMMeRaA04S00V02  "Daily deaths mean LANL DayDeM"
{txt}
{com}. 
.         summ DayCasMeRaA04S00V02  

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCasMeR~02 {c |}{res}        508    347816.9    249498.3         98    1498199
{txt}
{com}.         gen DayCaMMeRaA04S00V02  = r(mean)
{txt}
{com}.         label var DayCaMMeRaA04S00V02  "Daily cases mean LANL DayCaM"
{txt}
{com}.                            
.         gen DayCbDMeRaA04S00V02  = DayCaMMeRaA04S00V02  / DayDeMMeRaA04S00V02 
{txt}
{com}.         label var DayCbDMeRaA04S00V02  "Daily cases mean div by daily deaths mean LANL DayCbD"
{txt}
{com}.         summ DayCbDMeRaA04S00V02 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~02 {c |}{res}        508    48.61184           0   48.61184   48.61184
{txt}
{com}.                                               
.         gen DayDMuMeRaA04S00V02  = DayDeaMeRaA04S00V02  * DayCbDMeRaA04S00V02 
{txt}
{com}.     label var DayDMuMeRaA04S00V02  "Daily deaths scaled (times means of cases by deaths) LANL"
{txt}
{com}.         summ DayDMuMeRaA04S00V02 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~02 {c |}{res}        508    347816.9    203190.9   48.61184   870443.7
{txt}
{com}. 
. 
. 
. 
. 
. ***********************
. 
. * graphs
. 
. 
. grstyle init
{res}{txt}
{com}. 
. grstyle color background white
{txt}
{com}. 
. 
. 
. * daily deaths     
. 
.            
. twoway (rarea DayDeaLoRaA04S00V02 DayDeaUpRaA04S00V02 date, sort color(green*.2)) ///
> (line DayDeaMeRaA04S00V02 date, sort lcolor(green)) ///
> , xtitle(Date) xlabel(#18, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily deaths) title("COVID-19 daily deaths, global, LANL, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.    
.            
. graph save "graph 1 COVID-19 daily deaths, global, LANL.gph", replace
{res}{txt}(file graph 1 COVID-19 daily deaths, global, LANL.gph saved)

{com}. graph export "graph 1 COVID-19 daily deaths, global, LANL.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210428/code/LANL/graph 1 COVID-19 daily deaths, global, LANL.pdf written in PDF format)

{com}. 
. 
. 
. * daily cases
. 
. 
. twoway (rarea DayCasLoRaA04S00V02 DayCasUpRaA04S00V02 date, sort color(green*.2)) ///
> (line DayCasMeRaA04S00V02 date, sort lcolor(green)) ///
> , xtitle(Date) xlabel(#18, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases) title("COVID-19 daily cases, global, LANL, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.    
.            
. graph save "graph 2 COVID-19 daily cases, global, LANL.gph", replace
{res}{txt}(file graph 2 COVID-19 daily cases, global, LANL.gph saved)

{com}. graph export "graph 2 COVID-19 daily cases, global, LANL.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210428/code/LANL/graph 2 COVID-19 daily cases, global, LANL.pdf written in PDF format)

{com}. 
. 
. 
. 
. * total deaths     
.            
. twoway (rarea TotDeaLoRaA04S00V02 TotDeaUpRaA04S00V02 date, sort color(green*.2)) ///
> (line TotDeaMeRaA04S00V02 date, sort lcolor(green)) ///
> , xtitle(Date) xlabel(#18, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total deaths) title("COVID-19 total deaths, global, LANL, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.    
.            
. graph save "graph 3 COVID-19 total deaths, global, LANL.gph", replace
{res}{txt}(file graph 3 COVID-19 total deaths, global, LANL.gph saved)

{com}. graph export "graph 3 COVID-19 total deaths, global, LANL.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210428/code/LANL/graph 3 COVID-19 total deaths, global, LANL.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. * total cases      
.            
. twoway (rarea TotCasLoRaA04S00V02 TotCasUpRaA04S00V02 date, sort color(green*.2)) ///
> (line TotCasMeRaA04S00V02 date, sort lcolor(green)) ///
> , xtitle(Date) xlabel(#18, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Total cases) title("COVID-19 total cases, global, LANL, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.    
.            
. graph save "graph 4 COVID-19 total cases, global, LANL.gph", replace
{res}{txt}(file graph 4 COVID-19 total cases, global, LANL.gph saved)

{com}. graph export "graph 4 COVID-19 total cases, global, LANL.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210428/code/LANL/graph 4 COVID-19 total cases, global, LANL.pdf written in PDF format)

{com}. 
. 
. 
. 
. * daily cfr
. 
. 
. twoway (rarea DayCfrLoRaA04S00V02 DayCfrUpRaA04S00V02 date, sort color(green*.2)) ///
> (line DayCfrMeRaA04S00V02 date, sort lcolor(green)) ///
> , xtitle(Date) xlabel(#18, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.0fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR) title("COVID-19 daily CFR, global, LANL, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) 
{res}{txt}
{com}.    
.            
. graph save "graph 5 COVID-19 daily CFR, global, LANL.gph", replace
{res}{txt}(file graph 5 COVID-19 daily CFR, global, LANL.gph saved)

{com}. graph export "graph 5 COVID-19 daily CFR, global, LANL.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210428/code/LANL/graph 5 COVID-19 daily CFR, global, LANL.pdf written in PDF format)

{com}. 
. 
. 
. * daily cfr, 01dec2020 on
. 
. twoway (rarea DayCfrLoRaA04S00V02 DayCfrUpRaA04S00V02 date, sort color(green*.2)) ///
> (line DayCfrMeRaA04S00V02 date, sort lcolor(green)) ///
> if date > td(01dec2020) ///
> , xtitle(Date) xlabel(#6, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%9.2fc) labsize(small))  ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily CFR) title("COVID-19 daily CFR, global, LANL, single scenario", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) legend(off) ///
> subtitle("after 2020-12-01", size(small))
{res}{txt}
{com}.    
.            
. graph save "graph 6 COVID-19 daily CFR, global, LANL, 01dec2020 on.gph", replace
{res}{txt}(file graph 6 COVID-19 daily CFR, global, LANL, 01dec2020 on.gph saved)

{com}. graph export "graph 6 COVID-19 daily CFR, global, LANL, 01dec2020 on.pdf", replace
{txt}(file /Users/farshadpourmalek/Downloads/globalcovid-main/20210428/code/LANL/graph 6 COVID-19 daily CFR, global, LANL, 01dec2020 on.pdf written in PDF format)

{com}. 
. 
. 
. 
. 
. 
. * DayCas DayDeaDay Dea_multip
. 
. twoway ///
> (line DayCasMeRaA04S00V02  date, sort lcolor(blue)) ///
> (line DayDeaMeRaA04S00V02  date, sort lcolor(red)) ///
> (line DayDMuMeRaA04S00V02  date, sort lpattern(dot) lcolor(red)) ///
> if date > td(01jan2020) ///
> , xtitle(Date) xlabel(, format(%tdYY-NN-DD) labsize(small)) xlabel(, grid) xlabel(, grid) ///
> xlabel(, angle(forty_five)) ylabel(, format(%12.0fc) labsize(small)) ylabel(, labsize(small) angle(horizontal)) ///
> ytitle(Daily cases and deaths) title("COVID-19 daily cases and deaths, global, LANL", size(medium)) ///
> xscale(lwidth(vthin) lcolor(gray*.2)) yscale(lwidth(vthin) lcolor(gray*.2)) yscale(titlegap(4)) legend(region(lcolor(none)))  ///
> legend(order(1 "Daily cases" 2 "Daily deaths" 3 "Daily deaths scaled for visualization") size(small)) ///
> subtitle("Daily deaths, scaled = times (means of cases divided by deaths) for visualization only", size(small)) ///
> note("Current scenario, mean estimate")
{res}{txt}
{com}. 
. qui graph save "graph 7 COVID-19 daily deaths and cases global, LANL.gph", replace
{txt}
{com}. qui graph export "graph 7 COVID-19 daily deaths and cases global, LANL.pdf", replace
{txt}
{com}. 
. 
. 
. 
. sort date
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "global LANL.dta", replace
{txt}file global LANL.dta saved

{com}. 
. 
. 
. view "log global LANL.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/globalcovid-main/20210428/code/LANL/log global LANL.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}28 Apr 2021, 22:54:09
{txt}{.-}
{smcl}
{txt}{sf}{ul off}