{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20220104/code/IMPE/log CovidVisualizedGlobal IMPE 1.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 5 Jan 2022, 17:28:16
{txt}
{com}. 
. ***************************************************************************
. * This is "do CovidVisualizedGlobal IMPE 1.do"
. 
. * Project: Combine and visualize international periodically updating 
. * estimates of COVID-19 at the global level (CovidVisualizedGlobal)
. * Person: Farshad Pourmalek pourmalek_farshad at yahoo dot com
. * Time (initial): 2021-04-14
. ***************************************************************************
. 
. 
. * download and prepare estiamtes files
. 
.                                                                                                          ***************************
. * To change update date, find and replace all, 2021-12-13 (old), with 2021-12-13 (new) <<--       <<<--- * change update date here *
.                                                                                                          ***************************                                                                                                                                                                             
.                                                                                                                                                                                                                 
. clear all
{txt}
{com}. 
. 
. *****************************
. 
. * get IMPE estimates
. 
. 
. copy https://raw.githubusercontent.com/mrc-ide/global-lmic-reports/master/data/2021-12-13_v9.csv.zip 2021-12-13_v9.csv.zip
{txt}
{com}. unzipfile 2021-12-13_v9.csv.zip, replace
{res}{txt}    inflating: 2021-12-13_v9.csv
successfully unzipped 2021-12-13_v9.csv.zip to current directory

{com}. erase 2021-12-13_v9.csv.zip
{txt}
{com}. 
.  
. ******************************
. 
. * import csv file
. 
. import delimited "2021-12-13_v9.csv", clear varnames(1) // * Wait Note: large file size, takes a while ...
{res}{text}(14 vars, 8,648,370 obs)

{com}. 
. save "IMPE.dta", replace
{txt}file IMPE.dta saved

{com}. 
. 
. 
. 
. * get renvars
. 
. net from  http://www.stata-journal.com/software/sj5-4
{s6hlp}
.-
http://www.stata-journal.com/software/sj5-4/
^Stata Journal volume 5, issue 4^
.-
{smcl}

DIRECTORIES you could -{hilite:net cd}- to:
{p2colset 5 23 23 2}{...}
{p2col :{net cd ..:..}}Other Stata Journals{p_end}
{p2colreset}{...}

PACKAGES you could -{hilite:net describe}-:
{s6hlp}
    @net:describe dm67_3!dm67_3@            Update:  Numbers of present and missing values
    @net:describe dm88_1!dm88_1@            Update:  Renaming variables, multiply and
                      systematically
    @net:describe gr0021!gr0021@            Double, diagonal, and polar smoothing
    @net:describe sg134_1!sg134_1@           Update: Model selection using akaike information
                      criterion
    @net:describe st0030_2!st0030_2@          Update:  Instrumental variables and GMM:  Estimation
                      and testing
    @net:describe st0037_2!st0037_2@          Update:  Adaptive kernel density estimation
    @net:describe st0067_2!st0067_2@          Update:  Multiple imputation of missing values
    @net:describe st0091!st0091@            Estimation and inference in dynamic unbalanced
                      panel data models with a small number of individuals
    @net:describe st0092!st0092@            Extended generalized linear models: Simulataneous
                      estimation of flexible link and variance functions
    @net:describe st0093!st0093@            Buckley-James method for analyzing censored data,
                      with an application to a heart disease study
    @net:describe st0094!st0094@            Confidence intervals for predicted outcomes in
                      regression models for categorical outcomes
{smcl}
{.-}

{com}. 
. net describe dm88_1

{txt}{.-}
{s6hlp}
package ^dm88_1^ from http://www.stata-journal.com/software/sj5-4
{smcl}
{.-}
{s6hlp}

^TITLE^
      SJ5-4 dm88_1.  Update:  Renaming variables, multiply and...

^DESCRIPTION/AUTHOR(S)^
      Update:  Renaming variables, multiply and systematically
      by Nicholas J. Cox, Durham University, UK
         Jeroen Weesie, Utrecht University, Netherlands
      Support:  n.j.cox@@durham.ac.uk, j.weesie@@fss.uu.nl
      After installation, type help ^renvars^

^INSTALLATION FILES^                               (type ^net install^ ^dm88_1^)
      dm88_1/renvars.ado
      dm88_1/renvars.hlp

^ANCILLARY FILES^                                  (type ^net get^ ^dm88_1^)
      dm88_1/renvars.do
{smcl}
{.-}

{com}. 
. net install dm88_1
checking {hilite:dm88_1} consistency and verifying not already installed...
all files already exist and are up to date.
{txt}
{com}. 
. 
. *******************
. 
. * gen global sum
. 
. use "IMPE.dta", clear
{txt}
{com}. 
. collapse (sum) y_025 y_25 y_median y_mean y_75 y_975, by(date compartment scenario) 
{txt}
{com}. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. 
. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2)
{txt}
{com}. egen dateblock = concat(year month day)
{txt}
{com}. drop year month day
{txt}
{com}. 
. 
. * rename uncertainty limits
. 
. rename y_025    y_025_
{res}{txt}
{com}. rename y_25     y_250_
{res}{txt}
{com}. rename y_median y_med_
{res}{txt}
{com}. rename y_mean   y_mea_
{res}{txt}
{com}. rename y_75     y_750_
{res}{txt}
{com}. rename y_975    y_975_
{res}{txt}
{com}. 
. 
. foreach var of varlist y_025-y_975 {c -(}
{txt}  2{com}.         ds `var'
{txt}  3{com}.         label variable `var' `r(varlist)'
{txt}  4{com}. {c )-}
{txt}{col 1}y_025_
{col 1}y_250_
{col 1}y_med_
{col 1}y_mea_
{col 1}y_750_
{col 1}y_975_

{com}. *
. 
. 
. 
. * rename scenarios 
. 
. tab scenario 

                  {txt}scenario {c |}      Freq.     Percent        Cum.
{hline 27}{c +}{hline 35}
       Maintain Status Quo {c |}{res}      9,181       16.67       16.67
{txt}                Optimistic {c |}{res}      9,181       16.67       33.33
{txt}               Pessimistic {c |}{res}      9,181       16.67       50.00
{txt}Surged Maintain Status Quo {c |}{res}      9,181       16.67       66.67
{txt}         Surged Optimistic {c |}{res}      9,181       16.67       83.33
{txt}        Surged Pessimistic {c |}{res}      9,181       16.67      100.00
{txt}{hline 27}{c +}{hline 35}
                     Total {c |}{res}     55,086      100.00
{txt}
{com}. 
. 
. /*
> Scenarios:
> 
> S1  "Additional 50% Reduction"                  "S1_Add_Half_Reduction"
> S2  "Maintain Status Quo"                               "S2_Maintain_Staus_Quo"
> S3  "Relax Interventions 50%"                   "S3_Relax_Half_Intervention"
> 
> S4  "Surged Additional 50% Reduction"   "S4_Surged_Add_Half_Reduction"
> S5  "Surged Maintain Status Quo"                "S5_Surged_Maintain_Staus_Quo"
> S6  "Surged Relax Interventions 50%"    "S6_Surged_Relax_Half_Intervention"
> 
> With IMPE update 20211103 (2021-12-13_v9.csv.zip) released on 20211110., IMPE has new terms for their scenarios:
> 
> S1      Optimistic
> S2      Maintain Status Quo
> S3      Pessimistic
> 
> S4      Surged Optimistic
> S5      Surged Maintain Status Quo
> S6      Surged Pessimistic
> */
. 
. 
. gen scenario_snail = ""
{txt}(55,086 missing values generated)

{com}. replace scenario_snail = "S1" if scenario == "Optimistic"
{txt}variable {bf}scenario_snail{sf} was {bf}{res}str1{sf}{txt} now {bf}{res}str2{sf}
{txt}(9,181 real changes made)

{com}. replace scenario_snail = "S2" if scenario == "Maintain Status Quo"
{txt}(9,181 real changes made)

{com}. replace scenario_snail = "S3" if scenario == "Pessimistic"
{txt}(9,181 real changes made)

{com}. replace scenario_snail = "S4" if scenario == "Surged Optimistic"
{txt}(9,181 real changes made)

{com}. replace scenario_snail = "S5" if scenario == "Surged Maintain Status Quo"
{txt}(9,181 real changes made)

{com}. replace scenario_snail = "S6" if scenario == "Surged Pessimistic"
{txt}(9,181 real changes made)

{com}. 
. 
. gen underline = "_"
{txt}
{com}. egen scenario_snail_dateblock = concat(scenario_snail underline dateblock)
{txt}
{com}. 
. drop date_original scenario
{txt}
{com}. 
. drop scenario_snail_dateblock 
{txt}
{com}.   
. drop y_250_ y_med_ y_750_
{txt}
{com}.  
. 
. * Primary outcomes Total Deaths, Total infections, Daily Deaths, and Daily infections
. 
. replace compartment = "cumul_death" if compartment == "cumulative_deaths"
{txt}(5,004 real changes made)

{com}. replace compartment = "cumul_infec" if compartment == "cumulative_infections"
{txt}(5,004 real changes made)

{com}. replace compartment = "daily_death" if compartment == "deaths"
{txt}(5,004 real changes made)

{com}. replace compartment = "daily_infec" if compartment == "infections"
{txt}(5,004 real changes made)

{com}. 
. 
. * other outcomes
. 
. replace compartment = "icu___deman" if compartment == "ICU_demand"                      // Icd
{txt}(5,010 real changes made)

{com}. replace compartment = "icu___incid" if compartment == "ICU_incidence"           // Ici
{txt}(5,010 real changes made)

{com}. replace compartment = "reff_______" if compartment == "Reff"                            // Ref
{txt}(5,010 real changes made)

{com}. replace compartment = "rt_________" if compartment == "Rt"                                      // Rtt
{txt}(5,010 real changes made)

{com}. replace compartment = "hospi_deman" if compartment == "hospital_demand"         // Hod
{txt}(5,010 real changes made)

{com}. replace compartment = "hospi_incid" if compartment == "hospital_incidence"  // Hoi
{txt}(5,010 real changes made)

{com}. replace compartment = "preval_____" if compartment == "prevalence"                      // Pre
{txt}(5,010 real changes made)

{com}. 
. 
. 
. duplicates drop date compartment scenario, force

{p 0 4}{txt}Duplicates in terms of {res} dateblock compartment scenario_snail{p_end}

{txt}(0 observations are duplicates)

{com}. 
. * reshape
. 
. egen compartment_scenario_snail = concat(compartment underline scenario_snail)  
{txt}
{com}. 
. drop compartment underline scenario_snail
{txt}
{com}. 
. tab compartment_scenario_snail

{txt}compartment_sc {c |}
  enario_snail {c |}      Freq.     Percent        Cum.
{hline 15}{c +}{hline 35}
cumul_death_S1 {c |}{res}        834        1.51        1.51
{txt}cumul_death_S2 {c |}{res}        834        1.51        3.03
{txt}cumul_death_S3 {c |}{res}        834        1.51        4.54
{txt}cumul_death_S4 {c |}{res}        834        1.51        6.06
{txt}cumul_death_S5 {c |}{res}        834        1.51        7.57
{txt}cumul_death_S6 {c |}{res}        834        1.51        9.08
{txt}cumul_infec_S1 {c |}{res}        834        1.51       10.60
{txt}cumul_infec_S2 {c |}{res}        834        1.51       12.11
{txt}cumul_infec_S3 {c |}{res}        834        1.51       13.63
{txt}cumul_infec_S4 {c |}{res}        834        1.51       15.14
{txt}cumul_infec_S5 {c |}{res}        834        1.51       16.65
{txt}cumul_infec_S6 {c |}{res}        834        1.51       18.17
{txt}daily_death_S1 {c |}{res}        834        1.51       19.68
{txt}daily_death_S2 {c |}{res}        834        1.51       21.20
{txt}daily_death_S3 {c |}{res}        834        1.51       22.71
{txt}daily_death_S4 {c |}{res}        834        1.51       24.22
{txt}daily_death_S5 {c |}{res}        834        1.51       25.74
{txt}daily_death_S6 {c |}{res}        834        1.51       27.25
{txt}daily_infec_S1 {c |}{res}        834        1.51       28.77
{txt}daily_infec_S2 {c |}{res}        834        1.51       30.28
{txt}daily_infec_S3 {c |}{res}        834        1.51       31.79
{txt}daily_infec_S4 {c |}{res}        834        1.51       33.31
{txt}daily_infec_S5 {c |}{res}        834        1.51       34.82
{txt}daily_infec_S6 {c |}{res}        834        1.51       36.34
{txt}hospi_deman_S1 {c |}{res}        835        1.52       37.85
{txt}hospi_deman_S2 {c |}{res}        835        1.52       39.37
{txt}hospi_deman_S3 {c |}{res}        835        1.52       40.88
{txt}hospi_deman_S4 {c |}{res}        835        1.52       42.40
{txt}hospi_deman_S5 {c |}{res}        835        1.52       43.91
{txt}hospi_deman_S6 {c |}{res}        835        1.52       45.43
{txt}hospi_incid_S1 {c |}{res}        835        1.52       46.95
{txt}hospi_incid_S2 {c |}{res}        835        1.52       48.46
{txt}hospi_incid_S3 {c |}{res}        835        1.52       49.98
{txt}hospi_incid_S4 {c |}{res}        835        1.52       51.49
{txt}hospi_incid_S5 {c |}{res}        835        1.52       53.01
{txt}hospi_incid_S6 {c |}{res}        835        1.52       54.53
{txt}icu___deman_S1 {c |}{res}        835        1.52       56.04
{txt}icu___deman_S2 {c |}{res}        835        1.52       57.56
{txt}icu___deman_S3 {c |}{res}        835        1.52       59.07
{txt}icu___deman_S4 {c |}{res}        835        1.52       60.59
{txt}icu___deman_S5 {c |}{res}        835        1.52       62.10
{txt}icu___deman_S6 {c |}{res}        835        1.52       63.62
{txt}icu___incid_S1 {c |}{res}        835        1.52       65.14
{txt}icu___incid_S2 {c |}{res}        835        1.52       66.65
{txt}icu___incid_S3 {c |}{res}        835        1.52       68.17
{txt}icu___incid_S4 {c |}{res}        835        1.52       69.68
{txt}icu___incid_S5 {c |}{res}        835        1.52       71.20
{txt}icu___incid_S6 {c |}{res}        835        1.52       72.72
{txt}preval______S1 {c |}{res}        835        1.52       74.23
{txt}preval______S2 {c |}{res}        835        1.52       75.75
{txt}preval______S3 {c |}{res}        835        1.52       77.26
{txt}preval______S4 {c |}{res}        835        1.52       78.78
{txt}preval______S5 {c |}{res}        835        1.52       80.29
{txt}preval______S6 {c |}{res}        835        1.52       81.81
{txt}reff________S1 {c |}{res}        835        1.52       83.33
{txt}reff________S2 {c |}{res}        835        1.52       84.84
{txt}reff________S3 {c |}{res}        835        1.52       86.36
{txt}reff________S4 {c |}{res}        835        1.52       87.87
{txt}reff________S5 {c |}{res}        835        1.52       89.39
{txt}reff________S6 {c |}{res}        835        1.52       90.91
{txt}rt__________S1 {c |}{res}        835        1.52       92.42
{txt}rt__________S2 {c |}{res}        835        1.52       93.94
{txt}rt__________S3 {c |}{res}        835        1.52       95.45
{txt}rt__________S4 {c |}{res}        835        1.52       96.97
{txt}rt__________S5 {c |}{res}        835        1.52       98.48
{txt}rt__________S6 {c |}{res}        835        1.52      100.00
{txt}{hline 15}{c +}{hline 35}
         Total {c |}{res}     55,086      100.00
{txt}
{com}. 
. gen country = " GLOBAL"
{txt}
{com}. 
. reshape wide y_025_   y_mea_  y_975_, i(country dateblock) j(compartment_scenario_snail) string
{txt}(note: j = cumul_death_S1 cumul_death_S2 cumul_death_S3 cumul_death_S4 cumul_death_S5 cumul_death_S6 cumul_infec_S1 cumul_infec_S2 cumul_infec_S3 cumul_infec_S4 cumul_infec_S5 cumul_infec_S6 daily_death_S1 daily_death_S2 daily_death_S3 daily_death_S4 daily_death_S5 daily_death_S6 daily_infec_S1 daily_infec_S2 daily_infec_S3 daily_infec_S4 daily_infec_S5 daily_infec_S6 hospi_deman_S1 hospi_deman_S2 hospi_deman_S3 hospi_deman_S4 hospi_deman_S5 hospi_deman_S6 hospi_incid_S1 hospi_incid_S2 hospi_incid_S3 hospi_incid_S4 hospi_incid_S5 hospi_incid_S6 icu___deman_S1 icu___deman_S2 icu___deman_S3 icu___deman_S4 icu___deman_S5 icu___deman_S6 icu___incid_S1 icu___incid_S2 icu___incid_S3 icu___incid_S4 icu___incid_S5 icu___incid_S6 preval______S1 preval______S2 preval______S3 preval______S4 preval______S5 preval______S6 reff________S1 reff________S2 reff________S3 reff________S4 reff________S5 reff________S6 rt__________S1 rt__________S2 rt__________S3 rt__________S4 rt__________S5 rt__________S6)

Data{col 36}long{col 43}->{col 48}wide
{hline 77}
Number of obs.                 {res}   55086   {txt}->{res}     835
{txt}Number of variables            {res}       6   {txt}->{res}     200
{txt}j variable (66 values){res}compartment_scenario_snail{txt}->(dropped)
xij variables:
                                 {res}y_025_   {txt}->   {res}y_025_cumul_death_S1 y_025_cumul_death_S2 ... y_025_rt__________S6
                                 y_mea_   {txt}->   {res}y_mea_cumul_death_S1 y_mea_cumul_death_S2 ... y_mea_rt__________S6
                                 y_975_   {txt}->   {res}y_975_cumul_death_S1 y_975_cumul_death_S2 ... y_975_rt__________S6
{txt}{hline 77}

{com}. 
. 
. *
. 
. 
. 
. foreach v of varlist y_025_cumul_death_S1-y_975_rt__________S6 {c -(} 
{txt}  2{com}. 
.         local first = substr("`v'", 7, 11) 
{txt}  3{com}.         local second = substr("`v'", 6, 1)
{txt}  4{com}.         local third  = substr("`v'", 1, 5)
{txt}  5{com}.         local fourth = substr("`v'", 19, 2)
{txt}  6{com}.         label var `v' "`first'`second'`third'`second'`fourth'"
{txt}  7{com}. {c )-} 
{txt}
{com}. *
. 
. 
. 
. foreach v of varlist y_025_cumul_death_S1-y_975_rt__________S6 {c -(} 
{txt}  2{com}.         di `"`: var label `v''"' 
{txt}  3{com}.         local fifth `"`: var label `v''"'
{txt}  4{com}.         rename `v'   `fifth'
{txt}  5{com}. {c )-}
cumul_death_y_025_S1
{res}cumul_death_y_mea_S1
cumul_death_y_975_S1
cumul_death_y_025_S2
cumul_death_y_mea_S2
cumul_death_y_975_S2
cumul_death_y_025_S3
cumul_death_y_mea_S3
cumul_death_y_975_S3
cumul_death_y_025_S4
cumul_death_y_mea_S4
cumul_death_y_975_S4
cumul_death_y_025_S5
cumul_death_y_mea_S5
cumul_death_y_975_S5
cumul_death_y_025_S6
cumul_death_y_mea_S6
cumul_death_y_975_S6
cumul_infec_y_025_S1
cumul_infec_y_mea_S1
cumul_infec_y_975_S1
cumul_infec_y_025_S2
cumul_infec_y_mea_S2
cumul_infec_y_975_S2
cumul_infec_y_025_S3
cumul_infec_y_mea_S3
cumul_infec_y_975_S3
cumul_infec_y_025_S4
cumul_infec_y_mea_S4
cumul_infec_y_975_S4
cumul_infec_y_025_S5
cumul_infec_y_mea_S5
cumul_infec_y_975_S5
cumul_infec_y_025_S6
cumul_infec_y_mea_S6
cumul_infec_y_975_S6
daily_death_y_025_S1
daily_death_y_mea_S1
daily_death_y_975_S1
daily_death_y_025_S2
daily_death_y_mea_S2
daily_death_y_975_S2
daily_death_y_025_S3
daily_death_y_mea_S3
daily_death_y_975_S3
daily_death_y_025_S4
daily_death_y_mea_S4
daily_death_y_975_S4
daily_death_y_025_S5
daily_death_y_mea_S5
daily_death_y_975_S5
daily_death_y_025_S6
daily_death_y_mea_S6
daily_death_y_975_S6
daily_infec_y_025_S1
daily_infec_y_mea_S1
daily_infec_y_975_S1
daily_infec_y_025_S2
daily_infec_y_mea_S2
daily_infec_y_975_S2
daily_infec_y_025_S3
daily_infec_y_mea_S3
daily_infec_y_975_S3
daily_infec_y_025_S4
daily_infec_y_mea_S4
daily_infec_y_975_S4
daily_infec_y_025_S5
daily_infec_y_mea_S5
daily_infec_y_975_S5
daily_infec_y_025_S6
daily_infec_y_mea_S6
daily_infec_y_975_S6
hospi_deman_y_025_S1
hospi_deman_y_mea_S1
hospi_deman_y_975_S1
hospi_deman_y_025_S2
hospi_deman_y_mea_S2
hospi_deman_y_975_S2
hospi_deman_y_025_S3
hospi_deman_y_mea_S3
hospi_deman_y_975_S3
hospi_deman_y_025_S4
hospi_deman_y_mea_S4
hospi_deman_y_975_S4
hospi_deman_y_025_S5
hospi_deman_y_mea_S5
hospi_deman_y_975_S5
hospi_deman_y_025_S6
hospi_deman_y_mea_S6
hospi_deman_y_975_S6
hospi_incid_y_025_S1
hospi_incid_y_mea_S1
hospi_incid_y_975_S1
hospi_incid_y_025_S2
hospi_incid_y_mea_S2
hospi_incid_y_975_S2
hospi_incid_y_025_S3
hospi_incid_y_mea_S3
hospi_incid_y_975_S3
hospi_incid_y_025_S4
hospi_incid_y_mea_S4
hospi_incid_y_975_S4
hospi_incid_y_025_S5
hospi_incid_y_mea_S5
hospi_incid_y_975_S5
hospi_incid_y_025_S6
hospi_incid_y_mea_S6
hospi_incid_y_975_S6
icu___deman_y_025_S1
icu___deman_y_mea_S1
icu___deman_y_975_S1
icu___deman_y_025_S2
icu___deman_y_mea_S2
icu___deman_y_975_S2
icu___deman_y_025_S3
icu___deman_y_mea_S3
icu___deman_y_975_S3
icu___deman_y_025_S4
icu___deman_y_mea_S4
icu___deman_y_975_S4
icu___deman_y_025_S5
icu___deman_y_mea_S5
icu___deman_y_975_S5
icu___deman_y_025_S6
icu___deman_y_mea_S6
icu___deman_y_975_S6
icu___incid_y_025_S1
icu___incid_y_mea_S1
icu___incid_y_975_S1
icu___incid_y_025_S2
icu___incid_y_mea_S2
icu___incid_y_975_S2
icu___incid_y_025_S3
icu___incid_y_mea_S3
icu___incid_y_975_S3
icu___incid_y_025_S4
icu___incid_y_mea_S4
icu___incid_y_975_S4
icu___incid_y_025_S5
icu___incid_y_mea_S5
icu___incid_y_975_S5
icu___incid_y_025_S6
icu___incid_y_mea_S6
icu___incid_y_975_S6
preval______y_025_S1
preval______y_mea_S1
preval______y_975_S1
preval______y_025_S2
preval______y_mea_S2
preval______y_975_S2
preval______y_025_S3
preval______y_mea_S3
preval______y_975_S3
preval______y_025_S4
preval______y_mea_S4
preval______y_975_S4
preval______y_025_S5
preval______y_mea_S5
preval______y_975_S5
preval______y_025_S6
preval______y_mea_S6
preval______y_975_S6
reff________y_025_S1
reff________y_mea_S1
reff________y_975_S1
reff________y_025_S2
reff________y_mea_S2
reff________y_975_S2
reff________y_025_S3
reff________y_mea_S3
reff________y_975_S3
reff________y_025_S4
reff________y_mea_S4
reff________y_975_S4
reff________y_025_S5
reff________y_mea_S5
reff________y_975_S5
reff________y_025_S6
reff________y_mea_S6
reff________y_975_S6
rt__________y_025_S1
rt__________y_mea_S1
rt__________y_975_S1
rt__________y_025_S2
rt__________y_mea_S2
rt__________y_975_S2
rt__________y_025_S3
rt__________y_mea_S3
rt__________y_975_S3
rt__________y_025_S4
rt__________y_mea_S4
rt__________y_975_S4
rt__________y_025_S5
rt__________y_mea_S5
rt__________y_975_S5
rt__________y_025_S6
rt__________y_mea_S6
rt__________y_975_S6
{txt}
{com}. *
. 
. 
. * gen date
. 
. gen year = substr(dateblock,1,4) 
{txt}
{com}. gen month = substr(dateblock,5,2) 
{txt}
{com}. gen day = substr(dateblock,7,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21882{txt},{res}22716{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}29nov2019{txt},{res}12mar2022{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}835{col 51}{txt}missing .:  {res}0{txt}/{res}835

{txt}{col 19}mean:{res}{col 26}   22299{txt} = {res}19jan2021{txt}
{col 15}std. dev:{res}{col 26} 241.188

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21965{col 37}   22090{col 47}   22299{col 57}   22508{col 67}   22633
{col 26}20feb2020{col 36}24jun2020{col 46}19jan2021{col 56}16aug2021{col 66}19dec2021
{txt}
{com}. 
. 
. 
. * 
. 
. 
. * -renvars- somanyvars rather time consuming
. 
. foreach v of varlist cumul_death_y_025_S1-rt__________y_975_S6 {c -(} 
{txt}  2{com}. 
.     qui renvars, presub(cumul_death_y_025_ TotDeaLoRa)
{txt}  3{com}.     qui renvars, presub(cumul_death_y_975_ TotDeaUpRa)
{txt}  4{com}.     qui renvars, presub(cumul_death_y_mea_ TotDeaMeRa)
{txt}  5{com}. 
.         qui renvars, presub(daily_death_y_025_ DayDeaLoRa)
{txt}  6{com}.         qui renvars, presub(daily_death_y_975_ DayDeaUpRa)
{txt}  7{com}.         qui renvars, presub(daily_death_y_mea_ DayDeaMeRa)
{txt}  8{com}.         
.     qui renvars, presub(cumul_infec_y_025_ TotINFLoRa)
{txt}  9{com}.     qui renvars, presub(cumul_infec_y_975_ TotINFUpRa)
{txt} 10{com}.     qui renvars, presub(cumul_infec_y_mea_ TotINFMeRa)
{txt} 11{com}.         
.         qui renvars, presub(daily_infec_y_025_ DayINFLoRa)
{txt} 12{com}.         qui renvars, presub(daily_infec_y_975_ DayINFUpRa)
{txt} 13{com}.         qui renvars, presub(daily_infec_y_mea_ DayINFMeRa)
{txt} 14{com}.         
.         * other outcomes
.         
.         qui renvars, presub(icu___deman_y_025_ DayIcdLoRa) // "ICU_demand" 
{txt} 15{com}.         qui renvars, presub(icu___deman_y_975_ DayIcdUpRa)
{txt} 16{com}.         qui renvars, presub(icu___deman_y_mea_ DayIcdMeRa)
{txt} 17{com}.         
.         qui renvars, presub(icu___incid_y_025_ DayIciLoRa) // "ICU_incidence"
{txt} 18{com}.         qui renvars, presub(icu___incid_y_975_ DayIciUpRa)
{txt} 19{com}.         qui renvars, presub(icu___incid_y_mea_ DayIciMeRa)
{txt} 20{com}.         
.         qui renvars, presub(reff________y_025_ DayRefLoRa) // "Reff"
{txt} 21{com}.         qui renvars, presub(reff________y_975_ DayRefUpRa)
{txt} 22{com}.         qui renvars, presub(reff________y_mea_ DayRefMeRa)
{txt} 23{com}.         
.         qui renvars, presub(rt__________y_025_ DayRttLoRa) // "Rt"
{txt} 24{com}.         qui renvars, presub(rt__________y_975_ DayRttUpRa)
{txt} 25{com}.         qui renvars, presub(rt__________y_mea_ DayRttMeRa)
{txt} 26{com}.         
.         qui renvars, presub(hospi_deman_y_025_ DayHodLoRa) // "hospital_demand"
{txt} 27{com}.         qui renvars, presub(hospi_deman_y_975_ DayHodUpRa)
{txt} 28{com}.         qui renvars, presub(hospi_deman_y_mea_ DayHodMeRa)
{txt} 29{com}.         
.         qui renvars, presub(hospi_incid_y_025_ DayHoiLoRa) // "hospital_incidence"
{txt} 30{com}.         qui renvars, presub(hospi_incid_y_975_ DayHoiUpRa)
{txt} 31{com}.         qui renvars, presub(hospi_incid_y_mea_ DayHoiMeRa)
{txt} 32{com}.         
.         qui renvars, presub(preval______y_025_ DayPreLoRa) // "prevalence"
{txt} 33{com}.         qui renvars, presub(preval______y_975_ DayPreUpRa)
{txt} 34{com}.         qui renvars, presub(preval______y_mea_ DayPreMeRa)
{txt} 35{com}.         
.         qui renvars, postsub(S1 A03S01) 
{txt} 36{com}.         qui renvars, postsub(S2 A03S02) 
{txt} 37{com}.         qui renvars, postsub(S3 A03S03) 
{txt} 38{com}.         qui renvars, postsub(S4 A03S04) 
{txt} 39{com}.         qui renvars, postsub(S5 A03S05) 
{txt} 40{com}.         qui renvars, postsub(S6 A03S06) 
{txt} 41{com}.         
.         * "Wait Note: renvars are working ..."
.         
. {c )-} 
{txt}
{com}. *   
. 
. 
. 
. *
. 
. drop year month day date2 dateblock
{txt}
{com}. 
. order date  
{txt}
{com}. 
. label var DayINFLoRaA03S01 "Daily infections Lower A03 S01 "
{txt}
{com}. label var DayINFLoRaA03S02 "Daily infections Lower A03 S02 "
{txt}
{com}. label var DayINFLoRaA03S03 "Daily infections Lower A03 S03 "
{txt}
{com}. label var DayINFLoRaA03S04 "Daily infections Lower A03 S04 "
{txt}
{com}. label var DayINFLoRaA03S05 "Daily infections Lower A03 S05 "
{txt}
{com}. label var DayINFLoRaA03S06 "Daily infections Lower A03 S06 "
{txt}
{com}. label var DayINFMeRaA03S01 "Daily infections Mean A03 S01 "
{txt}
{com}. label var DayINFMeRaA03S02 "Daily infections Mean A03 S02 "
{txt}
{com}. label var DayINFMeRaA03S03 "Daily infections Mean A03 S03 "
{txt}
{com}. label var DayINFMeRaA03S04 "Daily infections Mean A03 S04 "
{txt}
{com}. label var DayINFMeRaA03S05 "Daily infections Mean A03 S05 "
{txt}
{com}. label var DayINFMeRaA03S06 "Daily infections Mean A03 S06 "
{txt}
{com}. label var DayINFUpRaA03S01 "Daily infections Upper A03 S01 "
{txt}
{com}. label var DayINFUpRaA03S02 "Daily infections Upper A03 S02 "
{txt}
{com}. label var DayINFUpRaA03S03 "Daily infections Upper A03 S03 "
{txt}
{com}. label var DayINFUpRaA03S04 "Daily infections Upper A03 S04 "
{txt}
{com}. label var DayINFUpRaA03S05 "Daily infections Upper A03 S05 "
{txt}
{com}. label var DayINFUpRaA03S06 "Daily infections Upper A03 S06 "
{txt}
{com}. label var DayDeaLoRaA03S01 "Daily Deaths Lower A03 S01 "
{txt}
{com}. label var DayDeaLoRaA03S02 "Daily Deaths Lower A03 S02 "
{txt}
{com}. label var DayDeaLoRaA03S03 "Daily Deaths Lower A03 S03 "
{txt}
{com}. label var DayDeaLoRaA03S04 "Daily Deaths Lower A03 S04 "
{txt}
{com}. label var DayDeaLoRaA03S05 "Daily Deaths Lower A03 S05 "
{txt}
{com}. label var DayDeaLoRaA03S06 "Daily Deaths Lower A03 S06 "
{txt}
{com}. label var DayDeaMeRaA03S01 "Daily Deaths Mean A03 S01 "
{txt}
{com}. label var DayDeaMeRaA03S02 "Daily Deaths Mean A03 S02 "
{txt}
{com}. label var DayDeaMeRaA03S03 "Daily Deaths Mean A03 S03 "
{txt}
{com}. label var DayDeaMeRaA03S04 "Daily Deaths Mean A03 S04 "
{txt}
{com}. label var DayDeaMeRaA03S05 "Daily Deaths Mean A03 S05 "
{txt}
{com}. label var DayDeaMeRaA03S06 "Daily Deaths Mean A03 S06 "
{txt}
{com}. label var DayDeaUpRaA03S01 "Daily Deaths Upper A03 S01 "
{txt}
{com}. label var DayDeaUpRaA03S02 "Daily Deaths Upper A03 S02 "
{txt}
{com}. label var DayDeaUpRaA03S03 "Daily Deaths Upper A03 S03 "
{txt}
{com}. label var DayDeaUpRaA03S04 "Daily Deaths Upper A03 S04 "
{txt}
{com}. label var DayDeaUpRaA03S05 "Daily Deaths Upper A03 S05 "
{txt}
{com}. label var DayDeaUpRaA03S06 "Daily Deaths Upper A03 S06 "
{txt}
{com}. label var TotINFLoRaA03S01 "Total infections Lower A03 S01 "
{txt}
{com}. label var TotINFLoRaA03S02 "Total infections Lower A03 S02 "
{txt}
{com}. label var TotINFLoRaA03S03 "Total infections Lower A03 S03 "
{txt}
{com}. label var TotINFLoRaA03S04 "Total infections Lower A03 S04 "
{txt}
{com}. label var TotINFLoRaA03S05 "Total infections Lower A03 S05 "
{txt}
{com}. label var TotINFLoRaA03S06 "Total infections Lower A03 S06 "
{txt}
{com}. label var TotINFMeRaA03S01 "Total infections Mean A03 S01 "
{txt}
{com}. label var TotINFMeRaA03S02 "Total infections Mean A03 S02 "
{txt}
{com}. label var TotINFMeRaA03S03 "Total infections Mean A03 S03 "
{txt}
{com}. label var TotINFMeRaA03S04 "Total infections Mean A03 S04 "
{txt}
{com}. label var TotINFMeRaA03S05 "Total infections Mean A03 S05 "
{txt}
{com}. label var TotINFMeRaA03S06 "Total infections Mean A03 S06 "
{txt}
{com}. label var TotINFUpRaA03S01 "Total infections Upper A03 S01 "
{txt}
{com}. label var TotINFUpRaA03S02 "Total infections Upper A03 S02 "
{txt}
{com}. label var TotINFUpRaA03S03 "Total infections Upper A03 S03 "
{txt}
{com}. label var TotINFUpRaA03S04 "Total infections Upper A03 S04 "
{txt}
{com}. label var TotINFUpRaA03S05 "Total infections Upper A03 S05 "
{txt}
{com}. label var TotINFUpRaA03S06 "Total infections Upper A03 S06 "
{txt}
{com}. label var TotDeaLoRaA03S01 "Total Deaths Lower A03 S01 "
{txt}
{com}. label var TotDeaLoRaA03S02 "Total Deaths Lower A03 S02 "
{txt}
{com}. label var TotDeaLoRaA03S03 "Total Deaths Lower A03 S03 "
{txt}
{com}. label var TotDeaLoRaA03S04 "Total Deaths Lower A03 S04 "
{txt}
{com}. label var TotDeaLoRaA03S05 "Total Deaths Lower A03 S05 "
{txt}
{com}. label var TotDeaLoRaA03S06 "Total Deaths Lower A03 S06 "
{txt}
{com}. label var TotDeaMeRaA03S01 "Total Deaths Mean A03 S01 "
{txt}
{com}. label var TotDeaMeRaA03S02 "Total Deaths Mean A03 S02 "
{txt}
{com}. label var TotDeaMeRaA03S03 "Total Deaths Mean A03 S03 "
{txt}
{com}. label var TotDeaMeRaA03S04 "Total Deaths Mean A03 S04 "
{txt}
{com}. label var TotDeaMeRaA03S05 "Total Deaths Mean A03 S05 "
{txt}
{com}. label var TotDeaMeRaA03S06 "Total Deaths Mean A03 S06 "
{txt}
{com}. label var TotDeaUpRaA03S01 "Total Deaths Upper A03 S01 "
{txt}
{com}. label var TotDeaUpRaA03S02 "Total Deaths Upper A03 S02 "
{txt}
{com}. label var TotDeaUpRaA03S03 "Total Deaths Upper A03 S03 "
{txt}
{com}. label var TotDeaUpRaA03S04 "Total Deaths Upper A03 S04 "
{txt}
{com}. label var TotDeaUpRaA03S05 "Total Deaths Upper A03 S05 "
{txt}
{com}. label var TotDeaUpRaA03S06 "Total Deaths Upper A03 S06 "
{txt}
{com}. 
. 
. * other outcomes
. 
. label var DayHodMeRaA03S01 "Daily hospital demand Mean A03 S01 "
{txt}
{com}. label var DayHodLoRaA03S01 "Daily hospital demand Lower A03 S01 "
{txt}
{com}. label var DayHodUpRaA03S01 "Daily hospital demand Upper A03 S01 "
{txt}
{com}. label var DayHodMeRaA03S02 "Daily hospital demand Mean A03 S02 "
{txt}
{com}. label var DayHodLoRaA03S02 "Daily hospital demand Lower A03 S02 "
{txt}
{com}. label var DayHodUpRaA03S02 "Daily hospital demand Upper A03 S02 "
{txt}
{com}. label var DayHodMeRaA03S03 "Daily hospital demand Mean A03 S03 "
{txt}
{com}. label var DayHodLoRaA03S03 "Daily hospital demand Lower A03 S03 "
{txt}
{com}. label var DayHodUpRaA03S03 "Daily hospital demand Upper A03 S03 "
{txt}
{com}. label var DayHodMeRaA03S04 "Daily hospital demand Mean A03 S04 "
{txt}
{com}. label var DayHodLoRaA03S04 "Daily hospital demand Lower A03 S04 "
{txt}
{com}. label var DayHodUpRaA03S04 "Daily hospital demand Upper A03 S04 " 
{txt}
{com}. label var DayHodMeRaA03S05 "Daily hospital demand Mean A03 S05 "
{txt}
{com}. label var DayHodLoRaA03S05 "Daily hospital demand Lower A03 S05 "
{txt}
{com}. label var DayHodUpRaA03S05 "Daily hospital demand Upper A03 S05 "
{txt}
{com}. label var DayHodMeRaA03S06 "Daily hospital demand Mean A03 S06 "
{txt}
{com}. label var DayHodLoRaA03S06 "Daily hospital demand Lower A03 S06 "
{txt}
{com}. label var DayHodUpRaA03S06 "Daily hospital demand Upper A03 S06 "
{txt}
{com}. 
. label var DayHoiMeRaA03S01 "Daily hospital incidence Mean A03 S01 "
{txt}
{com}. label var DayHoiLoRaA03S01 "Daily hospital incidence Lower A03 S01 "
{txt}
{com}. label var DayHoiUpRaA03S01 "Daily hospital incidence Upper A03 S01 "
{txt}
{com}. label var DayHoiMeRaA03S02 "Daily hospital incidence Mean A03 S02 "
{txt}
{com}. label var DayHoiLoRaA03S02 "Daily hospital incidence Lower A03 S02 "
{txt}
{com}. label var DayHoiUpRaA03S02 "Daily hospital incidence Upper A03 S02 "
{txt}
{com}. label var DayHoiMeRaA03S03 "Daily hospital incidence Mean A03 S03 "
{txt}
{com}. label var DayHoiLoRaA03S03 "Daily hospital incidence Lower A03 S03 "
{txt}
{com}. label var DayHoiUpRaA03S03 "Daily hospital incidence Upper A03 S03 "
{txt}
{com}. label var DayHoiMeRaA03S04 "Daily hospital incidence Mean A03 S04 "
{txt}
{com}. label var DayHoiLoRaA03S04 "Daily hospital incidence Lower A03 S04 "
{txt}
{com}. label var DayHoiUpRaA03S04 "Daily hospital incidence Upper A03 S04 "
{txt}
{com}. label var DayHoiMeRaA03S05 "Daily hospital incidence Mean A03 S05 "
{txt}
{com}. label var DayHoiLoRaA03S05 "Daily hospital incidence Lower A03 S05 "
{txt}
{com}. label var DayHoiUpRaA03S05 "Daily hospital incidence Upper A03 S05 "
{txt}
{com}. label var DayHoiMeRaA03S06 "Daily hospital incidence Mean A03 S06 "
{txt}
{com}. label var DayHoiLoRaA03S06 "Daily hospital incidence Lower A03 S06 "
{txt}
{com}. label var DayHoiUpRaA03S06 "Daily hospital incidence Upper A03 S06 "
{txt}
{com}. 
. label var DayIcdMeRaA03S01 "Daily ICU demand Mean A03 S01 "
{txt}
{com}. label var DayIcdLoRaA03S01 "Daily ICU demand Lower A03 S01 "
{txt}
{com}. label var DayIcdUpRaA03S01 "Daily ICU demand Upper A03 S01 "
{txt}
{com}. label var DayIcdMeRaA03S02 "Daily ICU demand Mean A03 S02 "
{txt}
{com}. label var DayIcdLoRaA03S02 "Daily ICU demand Lower A03 S02 "
{txt}
{com}. label var DayIcdUpRaA03S02 "Daily ICU demand Upper A03 S02 "
{txt}
{com}. label var DayIcdMeRaA03S03 "Daily ICU demand Mean A03 S03 "
{txt}
{com}. label var DayIcdLoRaA03S03 "Daily ICU demand Lower A03 S03 "
{txt}
{com}. label var DayIcdUpRaA03S03 "Daily ICU demand Upper A03 S03 "
{txt}
{com}. label var DayIcdMeRaA03S04 "Daily ICU demand Mean A03 S04 "
{txt}
{com}. label var DayIcdLoRaA03S04 "Daily ICU demand Lower A03 S04 "
{txt}
{com}. label var DayIcdUpRaA03S04 "Daily ICU demand Upper A03 S04 "
{txt}
{com}. label var DayIcdMeRaA03S05 "Daily ICU demand Mean A03 S05 "
{txt}
{com}. label var DayIcdLoRaA03S05 "Daily ICU demand Lower A03 S05 "
{txt}
{com}. label var DayIcdUpRaA03S05 "Daily ICU demand Upper A03 S05 "
{txt}
{com}. label var DayIcdMeRaA03S06 "Daily ICU demand Mean A03 S06 "
{txt}
{com}. label var DayIcdLoRaA03S06 "Daily ICU demand Lower A03 S06 "
{txt}
{com}. label var DayIcdUpRaA03S06 "Daily ICU demand Upper A03 S06 "
{txt}
{com}. 
. label var DayIciMeRaA03S01 "Daily ICU incidence Mean A03 S01 "
{txt}
{com}. label var DayIciLoRaA03S01 "Daily ICU incidence Lower A03 S01 "
{txt}
{com}. label var DayIciUpRaA03S01 "Daily ICU incidence Upper A03 S01 "
{txt}
{com}. label var DayIciMeRaA03S02 "Daily ICU incidence Mean A03 S02 "
{txt}
{com}. label var DayIciLoRaA03S02 "Daily ICU incidence Lower A03 S02 "
{txt}
{com}. label var DayIciUpRaA03S02 "Daily ICU incidence Upper A03 S02 "
{txt}
{com}. label var DayIciMeRaA03S03 "Daily ICU incidence Mean A03 S03 "
{txt}
{com}. label var DayIciLoRaA03S03 "Daily ICU incidence Lower A03 S03 "
{txt}
{com}. label var DayIciUpRaA03S03 "Daily ICU incidence Upper A03 S03 "
{txt}
{com}. label var DayIciMeRaA03S04 "Daily ICU incidence Mean A03 S04 "
{txt}
{com}. label var DayIciLoRaA03S04 "Daily ICU incidence Lower A03 S04 "
{txt}
{com}. label var DayIciUpRaA03S04 "Daily ICU incidence Upper A03 S04 "
{txt}
{com}. label var DayIciMeRaA03S05 "Daily ICU incidence Mean A03 S05 "
{txt}
{com}. label var DayIciLoRaA03S05 "Daily ICU incidence Lower A03 S05 "
{txt}
{com}. label var DayIciUpRaA03S05 "Daily ICU incidence Upper A03 S05 "
{txt}
{com}. label var DayIciMeRaA03S06 "Daily ICU incidence Mean A03 S06 "
{txt}
{com}. label var DayIciLoRaA03S06 "Daily ICU incidence Lower A03 S06 "
{txt}
{com}. label var DayIciUpRaA03S06 "Daily ICU incidence Upper A03 S06 "
{txt}
{com}. 
. label var DayPreMeRaA03S01 "Daily prevalence Mean A03 S01 "
{txt}
{com}. label var DayPreLoRaA03S01 "Daily prevalence Lower A03 S01 "
{txt}
{com}. label var DayPreUpRaA03S01 "Daily prevalence Upper A03 S01 "
{txt}
{com}. label var DayPreMeRaA03S02 "Daily prevalence Mean A03 S02 "
{txt}
{com}. label var DayPreLoRaA03S02 "Daily prevalence Lower A03 S02 "
{txt}
{com}. label var DayPreUpRaA03S02 "Daily prevalence Upper A03 S02 "
{txt}
{com}. label var DayPreMeRaA03S03 "Daily prevalence Mean A03 S03 "
{txt}
{com}. label var DayPreLoRaA03S03 "Daily prevalence Lower A03 S03 "
{txt}
{com}. label var DayPreUpRaA03S03 "Daily prevalence Upper A03 S03 "
{txt}
{com}. label var DayPreMeRaA03S04 "Daily prevalence Mean A03 S04 "
{txt}
{com}. label var DayPreLoRaA03S04 "Daily prevalence Lower A03 S04 "
{txt}
{com}. label var DayPreUpRaA03S04 "Daily prevalence Upper A03 S04 "
{txt}
{com}. label var DayPreMeRaA03S05 "Daily prevalence Mean A03 S05 "
{txt}
{com}. label var DayPreLoRaA03S05 "Daily prevalence Lower A03 S05 "
{txt}
{com}. label var DayPreUpRaA03S05 "Daily prevalence Upper A03 S05 "
{txt}
{com}. label var DayPreMeRaA03S06 "Daily prevalence Mean A03 S06 "
{txt}
{com}. label var DayPreLoRaA03S06 "Daily prevalence Lower A03 S06 "
{txt}
{com}. label var DayPreUpRaA03S06 "Daily prevalence Upper A03 S06 "
{txt}
{com}. 
. label var DayRefMeRaA03S01 "Daily R effective Mean A03 S01 "
{txt}
{com}. label var DayRefLoRaA03S01 "Daily R effective Lower A03 S01 "
{txt}
{com}. label var DayRefUpRaA03S01 "Daily R effective Upper A03 S01 "
{txt}
{com}. label var DayRefMeRaA03S02 "Daily R effective Mean A03 S02 "
{txt}
{com}. label var DayRefLoRaA03S02 "Daily R effective Lower A03 S02 "
{txt}
{com}. label var DayRefUpRaA03S02 "Daily R effective Upper A03 S02 "
{txt}
{com}. label var DayRefMeRaA03S03 "Daily R effective Mean A03 S03 "
{txt}
{com}. label var DayRefLoRaA03S03 "Daily R effective Lower A03 S03 "
{txt}
{com}. label var DayRefUpRaA03S03 "Daily R effective Upper A03 S03 "
{txt}
{com}. label var DayRefMeRaA03S04 "Daily R effective Mean A03 S04 "
{txt}
{com}. label var DayRefLoRaA03S04 "Daily R effective Lower A03 S04 "
{txt}
{com}. label var DayRefUpRaA03S04 "Daily R effective Upper A03 S04 "
{txt}
{com}. label var DayRefMeRaA03S05 "Daily R effective Mean A03 S05 "
{txt}
{com}. label var DayRefLoRaA03S05 "Daily R effective Lower A03 S05 "
{txt}
{com}. label var DayRefUpRaA03S05 "Daily R effective Upper A03 S05 "
{txt}
{com}. label var DayRefMeRaA03S06 "Daily R effective Mean A03 S06 "
{txt}
{com}. label var DayRefLoRaA03S06 "Daily R effective Lower A03 S06 "
{txt}
{com}. label var DayRefUpRaA03S06 "Daily R effective Upper A03 S06 "
{txt}
{com}. 
. label var DayRttMeRaA03S01 "Daily R t Mean A03 S01 "
{txt}
{com}. label var DayRttLoRaA03S01 "Daily R t Lower A03 S01 "
{txt}
{com}. label var DayRttUpRaA03S01 "Daily R t Upper A03 S01 "
{txt}
{com}. label var DayRttMeRaA03S02 "Daily R t Mean A03 S02 "
{txt}
{com}. label var DayRttLoRaA03S02 "Daily R t Lower A03 S02 "
{txt}
{com}. label var DayRttUpRaA03S02 "Daily R t Upper A03 S02 "
{txt}
{com}. label var DayRttMeRaA03S03 "Daily R t Mean A03 S03 "
{txt}
{com}. label var DayRttLoRaA03S03 "Daily R t Lower A03 S03 "
{txt}
{com}. label var DayRttUpRaA03S03 "Daily R t Upper A03 S03 "
{txt}
{com}. label var DayRttMeRaA03S04 "Daily R t Mean A03 S04 "
{txt}
{com}. label var DayRttLoRaA03S04 "Daily R t Lower A03 S04 "
{txt}
{com}. label var DayRttUpRaA03S04 "Daily R t Upper A03 S04 "
{txt}
{com}. label var DayRttMeRaA03S05 "Daily R t Mean A03 S05 "
{txt}
{com}. label var DayRttLoRaA03S05 "Daily R t Lower A03 S05 "
{txt}
{com}. label var DayRttUpRaA03S05 "Daily R t Upper A03 S05 "
{txt}
{com}. label var DayRttMeRaA03S06 "Daily R t Mean A03 S06 "
{txt}
{com}. label var DayRttLoRaA03S06 "Daily R t Lower A03 S06 "
{txt}
{com}. label var DayRttUpRaA03S06 "Daily R t Upper A03 S06 "
{txt}
{com}. 
. 
. rename country loc_grand_name
{res}{txt}
{com}. 
. 
. 
. order ///
> loc_grand_name date     ///
> TotDeaMeRaA03S01        TotDeaLoRaA03S01        TotDeaUpRaA03S01        ///
> TotDeaMeRaA03S02        TotDeaLoRaA03S02        TotDeaUpRaA03S02        ///
> TotDeaMeRaA03S03        TotDeaLoRaA03S03        TotDeaUpRaA03S03        ///
> TotDeaMeRaA03S04        TotDeaLoRaA03S04        TotDeaUpRaA03S04        ///
> TotDeaMeRaA03S05        TotDeaLoRaA03S05        TotDeaUpRaA03S05        ///
> TotDeaMeRaA03S06        TotDeaLoRaA03S06        TotDeaUpRaA03S06        ///
> DayDeaMeRaA03S01        DayDeaLoRaA03S01        DayDeaUpRaA03S01        ///
> DayDeaMeRaA03S02        DayDeaLoRaA03S02        DayDeaUpRaA03S02        ///
> DayDeaMeRaA03S03        DayDeaLoRaA03S03        DayDeaUpRaA03S03        ///
> DayDeaMeRaA03S04        DayDeaLoRaA03S04        DayDeaUpRaA03S04        ///
> DayDeaMeRaA03S05        DayDeaLoRaA03S05        DayDeaUpRaA03S05        ///
> DayDeaMeRaA03S06        DayDeaLoRaA03S06        DayDeaUpRaA03S06        ///
> TotINFMeRaA03S01        TotINFLoRaA03S01        TotINFUpRaA03S01        ///
> TotINFMeRaA03S02        TotINFLoRaA03S02        TotINFUpRaA03S02        ///
> TotINFMeRaA03S03        TotINFLoRaA03S03        TotINFUpRaA03S03        ///
> TotINFMeRaA03S04        TotINFLoRaA03S04        TotINFUpRaA03S04        ///
> TotINFMeRaA03S05        TotINFLoRaA03S05        TotINFUpRaA03S05        ///
> TotINFMeRaA03S06        TotINFLoRaA03S06        TotINFUpRaA03S06        ///
> DayINFMeRaA03S01        DayINFLoRaA03S01        DayINFUpRaA03S01        ///
> DayINFMeRaA03S02        DayINFLoRaA03S02        DayINFUpRaA03S02        ///
> DayINFMeRaA03S03        DayINFLoRaA03S03        DayINFUpRaA03S03        ///
> DayINFMeRaA03S04        DayINFLoRaA03S04        DayINFUpRaA03S04        ///
> DayINFMeRaA03S05        DayINFLoRaA03S05        DayINFUpRaA03S05        ///
> DayINFMeRaA03S06        DayINFLoRaA03S06        DayINFUpRaA03S06
{txt}
{com}. 
. 
.  *
.  
.  
. * gen IFR
. 
. gen DayIFRMeRaA03S01 = 100 * DayDeaMeRaA03S01 / DayINFMeRaA03S01 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S01 = 100 * DayDeaLoRaA03S01 / DayINFLoRaA03S01 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S01 = 100 * DayDeaUpRaA03S01 / DayINFUpRaA03S01 
{txt}(1 missing value generated)

{com}. gen DayIFRMeRaA03S02 = 100 * DayDeaMeRaA03S02 / DayINFMeRaA03S02 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S02 = 100 * DayDeaLoRaA03S02 / DayINFLoRaA03S02 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S02 = 100 * DayDeaUpRaA03S02 / DayINFUpRaA03S02 
{txt}(1 missing value generated)

{com}. gen DayIFRMeRaA03S03 = 100 * DayDeaMeRaA03S03 / DayINFMeRaA03S03 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S03 = 100 * DayDeaLoRaA03S03 / DayINFLoRaA03S03 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S03 = 100 * DayDeaUpRaA03S03 / DayINFUpRaA03S03 
{txt}(1 missing value generated)

{com}. gen DayIFRMeRaA03S04 = 100 * DayDeaMeRaA03S04 / DayINFMeRaA03S04 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S04 = 100 * DayDeaLoRaA03S04 / DayINFLoRaA03S04 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S04 = 100 * DayDeaUpRaA03S04 / DayINFUpRaA03S04 
{txt}(1 missing value generated)

{com}. gen DayIFRMeRaA03S05 = 100 * DayDeaMeRaA03S05 / DayINFMeRaA03S05 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S05 = 100 * DayDeaLoRaA03S05 / DayINFLoRaA03S05 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S05 = 100 * DayDeaUpRaA03S05 / DayINFUpRaA03S05 
{txt}(1 missing value generated)

{com}. gen DayIFRMeRaA03S06 = 100 * DayDeaMeRaA03S06 / DayINFMeRaA03S06 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S06 = 100 * DayDeaLoRaA03S06 / DayINFLoRaA03S06 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S06 = 100 * DayDeaUpRaA03S06 / DayINFUpRaA03S06 
{txt}(1 missing value generated)

{com}. 
. label var DayIFRMeRaA03S01 "Daily IFR Mean A03 S01 "
{txt}
{com}. label var DayIFRLoRaA03S01 "Daily IFR Lower A03 S01 "
{txt}
{com}. label var DayIFRUpRaA03S01 "Daily IFR Upper A03 S01 "
{txt}
{com}. label var DayIFRMeRaA03S02 "Daily IFR Mean A03 S02 "
{txt}
{com}. label var DayIFRLoRaA03S02 "Daily IFR Lower A03 S02 "
{txt}
{com}. label var DayIFRUpRaA03S02 "Daily IFR Upper A03 S02 "
{txt}
{com}. label var DayIFRMeRaA03S03 "Daily IFR Mean A03 S03 "
{txt}
{com}. label var DayIFRLoRaA03S03 "Daily IFR Lower A03 S03 "
{txt}
{com}. label var DayIFRUpRaA03S03 "Daily IFR Upper A03 S03 "
{txt}
{com}. label var DayIFRMeRaA03S04 "Daily IFR Mean A03 S04 "
{txt}
{com}. label var DayIFRLoRaA03S04 "Daily IFR Lower A03 S04 "
{txt}
{com}. label var DayIFRUpRaA03S04 "Daily IFR Upper A03 S04 "
{txt}
{com}. label var DayIFRMeRaA03S05 "Daily IFR Mean A03 S05 "
{txt}
{com}. label var DayIFRLoRaA03S05 "Daily IFR Lower A03 S05 "
{txt}
{com}. label var DayIFRUpRaA03S05 "Daily IFR Upper A03 S05 "
{txt}
{com}. label var DayIFRMeRaA03S06 "Daily IFR Mean A03 S06 "
{txt}
{com}. label var DayIFRLoRaA03S06 "Daily IFR Lower A03 S06 "
{txt}
{com}. label var DayIFRUpRaA03S06 "Daily IFR Upper A03 S06 "
{txt}
{com}. 
. 
. 
. 
. 
. * gen "Daily infections mean div by daily deaths mean IMPE DayCbD" for visulization of temporal relation of deaths and infections peaks 
. 
. 
. summ DayDeaMeRaA03S02 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~02 {c |}{res}        834    5835.266    3028.345          0   12143.67
{txt}
{com}. gen DayDeMMeRaA03S02 = r(mean)
{txt}
{com}. label var DayDeMMeRaA03S02 "Daily deaths mean IMPE DayDeM"
{txt}
{com}. 
. summ DayINFMeRaA03S02 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayINFMeR~02 {c |}{res}        834     1895952    965325.4         .2    4292854
{txt}
{com}. gen DayCaMMeRaA03S02 = r(mean)
{txt}
{com}. label var DayCaMMeRaA03S02 "Daily infections mean IMPE DayCaM"
{txt}
{com}.                            
. gen DayCbDMeRaA03S02 = DayCaMMeRaA03S02 / DayDeMMeRaA03S02
{txt}
{com}. label var DayCbDMeRaA03S02 "Daily infections mean div by daily deaths mean IMPE DayCbD"
{txt}
{com}. summ DayCbDMeRaA03S02

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~02 {c |}{res}        835    324.9128           0   324.9128   324.9128
{txt}
{com}.                                               
. gen DayDMuMeRaA03S02 = DayDeaMeRaA03S02 * DayCbDMeRaA03S02
{txt}(1 missing value generated)

{com}. label var DayDMuMeRaA03S02 "Daily deaths scaled (times means of infections by deaths) IMPE"
{txt}
{com}. summ DayDMuMeRaA03S02

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~02 {c |}{res}        834     1895952      983948          0    3945633
{txt}
{com}. 
. 
. 
. 
. 
. sort date loc_grand_name
{txt}
{com}. 
. order date loc_grand_name
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "IMPE GLOBAL.dta", replace
{txt}file IMPE GLOBAL.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. *****************************
. 
. * gen AFRO
. 
. use "IMPE.dta", clear
{txt}
{com}. 
. rename country loc_grand_name
{res}{txt}
{com}. 
. keep if ///
> loc_grand_name == "Algeria" | ///
> loc_grand_name == "Benin" | ///
> loc_grand_name == "Botswana" | ///
> loc_grand_name == "Burkina Faso" | ///
> loc_grand_name == "Burundi" | ///
> loc_grand_name == "Cabo Verde" | ///
> loc_grand_name == "Cameroon" | ///
> loc_grand_name == "Central African Republic" | ///
> loc_grand_name == "Chad" | ///
> loc_grand_name == "Comoros" | ///
> loc_grand_name == "Cote d'Ivoire" | ///
> loc_grand_name == "Democratic Republic of Congo" | ///
> loc_grand_name == "Equatorial Guinea" | ///
> loc_grand_name == "Eritrea" | ///
> loc_grand_name == "Eswatini" | ///
> loc_grand_name == "Ethiopia" | ///
> loc_grand_name == "Gabon" | ///
> loc_grand_name == "Gambia" | ///
> loc_grand_name == "Ghana" | ///
> loc_grand_name == "Guinea" | ///
> loc_grand_name == "Guinea-Bissau" | ///
> loc_grand_name == "Kenya" | ///
> loc_grand_name == "Lesotho" | ///
> loc_grand_name == "Liberia" | ///
> loc_grand_name == "Madagascar" | ///
> loc_grand_name == "Malawi" | ///
> loc_grand_name == "Mali" | ///
> loc_grand_name == "Mauritania" | ///
> loc_grand_name == "Mauritius" | ///
> loc_grand_name == "Mozambique" | ///
> loc_grand_name == "Namibia" | ///
> loc_grand_name == "Niger" | ///
> loc_grand_name == "Nigeria" | ///
> loc_grand_name == "Republic of the Congo" | ///
> loc_grand_name == "Rwanda" | ///
> loc_grand_name == "Sao Tome and Principe" | ///
> loc_grand_name == "Senegal" | ///
> loc_grand_name == "Seychelles" | ///
> loc_grand_name == "Sierra Leone" | ///
> loc_grand_name == "South Africa" | ///
> loc_grand_name == "South Sudan" | ///
> loc_grand_name == "Tanzania" | ///
> loc_grand_name == "Togo" | ///
> loc_grand_name == "Uganda" | ///
> loc_grand_name == "Zambia" | ///
> loc_grand_name == "Zimbabwe" 
{txt}(6,490,590 observations deleted)

{com}. 
. 
. collapse (sum) y_025 y_25 y_median y_mean y_75 y_975, by(date compartment scenario) 
{txt}
{com}. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. 
. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2)
{txt}
{com}. egen dateblock = concat(year month day)
{txt}
{com}. drop year month day
{txt}
{com}. 
. 
. * rename uncertainty limits
. 
. rename y_025    y_025_
{res}{txt}
{com}. rename y_25     y_250_
{res}{txt}
{com}. rename y_median y_med_
{res}{txt}
{com}. rename y_mean   y_mea_
{res}{txt}
{com}. rename y_75     y_750_
{res}{txt}
{com}. rename y_975    y_975_
{res}{txt}
{com}. 
. 
. foreach var of varlist y_025-y_975 {c -(}
{txt}  2{com}.         ds `var'
{txt}  3{com}.         label variable `var' `r(varlist)'
{txt}  4{com}. {c )-}
{txt}{col 1}y_025_
{col 1}y_250_
{col 1}y_med_
{col 1}y_mea_
{col 1}y_750_
{col 1}y_975_

{com}. *
. 
. 
. 
. * rename scenarios 
. 
. tab scenario 

                  {txt}scenario {c |}      Freq.     Percent        Cum.
{hline 27}{c +}{hline 35}
       Maintain Status Quo {c |}{res}      8,642       16.67       16.67
{txt}                Optimistic {c |}{res}      8,642       16.67       33.33
{txt}               Pessimistic {c |}{res}      8,642       16.67       50.00
{txt}Surged Maintain Status Quo {c |}{res}      8,642       16.67       66.67
{txt}         Surged Optimistic {c |}{res}      8,642       16.67       83.33
{txt}        Surged Pessimistic {c |}{res}      8,642       16.67      100.00
{txt}{hline 27}{c +}{hline 35}
                     Total {c |}{res}     51,852      100.00
{txt}
{com}. 
. 
. /*
> Scenarios:
> 
> S1  "Additional 50% Reduction"                  "S1_Add_Half_Reduction"
> S2  "Maintain Status Quo"                               "S2_Maintain_Staus_Quo"
> S3  "Relax Interventions 50%"                   "S3_Relax_Half_Intervention"
> 
> S4  "Surged Additional 50% Reduction"   "S4_Surged_Add_Half_Reduction"
> S5  "Surged Maintain Status Quo"                "S5_Surged_Maintain_Staus_Quo"
> S6  "Surged Relax Interventions 50%"    "S6_Surged_Relax_Half_Intervention"
> 
> With IMPE update 20211103 (2021-12-13_v9.csv.zip) released on 20211110., IMPE has new terms for their scenarios:
> 
> S1      Optimistic
> S2      Maintain Status Quo
> S3      Pessimistic
> 
> S4      Surged Optimistic
> S5      Surged Maintain Status Quo
> S6      Surged Pessimistic
> */
. 
. 
. gen scenario_snail = ""
{txt}(51,852 missing values generated)

{com}. replace scenario_snail = "S1" if scenario == "Optimistic"
{txt}variable {bf}scenario_snail{sf} was {bf}{res}str1{sf}{txt} now {bf}{res}str2{sf}
{txt}(8,642 real changes made)

{com}. replace scenario_snail = "S2" if scenario == "Maintain Status Quo"
{txt}(8,642 real changes made)

{com}. replace scenario_snail = "S3" if scenario == "Pessimistic"
{txt}(8,642 real changes made)

{com}. replace scenario_snail = "S4" if scenario == "Surged Optimistic"
{txt}(8,642 real changes made)

{com}. replace scenario_snail = "S5" if scenario == "Surged Maintain Status Quo"
{txt}(8,642 real changes made)

{com}. replace scenario_snail = "S6" if scenario == "Surged Pessimistic"
{txt}(8,642 real changes made)

{com}. 
. 
. gen underline = "_"
{txt}
{com}. egen scenario_snail_dateblock = concat(scenario_snail underline dateblock)
{txt}
{com}. 
. drop date_original scenario
{txt}
{com}. 
. drop scenario_snail_dateblock 
{txt}
{com}.   
. drop y_250_ y_med_ y_750_
{txt}
{com}.  
. 
. * Primary outcomes Total Deaths, Total infections, Daily Deaths, and Daily infections
. 
. replace compartment = "cumul_death" if compartment == "cumulative_deaths"
{txt}(4,710 real changes made)

{com}. replace compartment = "cumul_infec" if compartment == "cumulative_infections"
{txt}(4,710 real changes made)

{com}. replace compartment = "daily_death" if compartment == "deaths"
{txt}(4,710 real changes made)

{com}. replace compartment = "daily_infec" if compartment == "infections"
{txt}(4,710 real changes made)

{com}. 
. 
. * other outcomes
. 
. replace compartment = "icu___deman" if compartment == "ICU_demand"                      // Icd
{txt}(4,716 real changes made)

{com}. replace compartment = "icu___incid" if compartment == "ICU_incidence"           // Ici
{txt}(4,716 real changes made)

{com}. replace compartment = "reff_______" if compartment == "Reff"                            // Ref
{txt}(4,716 real changes made)

{com}. replace compartment = "rt_________" if compartment == "Rt"                                      // Rtt
{txt}(4,716 real changes made)

{com}. replace compartment = "hospi_deman" if compartment == "hospital_demand"         // Hod
{txt}(4,716 real changes made)

{com}. replace compartment = "hospi_incid" if compartment == "hospital_incidence"  // Hoi
{txt}(4,716 real changes made)

{com}. replace compartment = "preval_____" if compartment == "prevalence"                      // Pre
{txt}(4,716 real changes made)

{com}. 
. 
. 
. duplicates drop date compartment scenario, force

{p 0 4}{txt}Duplicates in terms of {res} dateblock compartment scenario_snail{p_end}

{txt}(0 observations are duplicates)

{com}. 
. * reshape
. 
. egen compartment_scenario_snail = concat(compartment underline scenario_snail)  
{txt}
{com}. 
. drop compartment underline scenario_snail
{txt}
{com}. 
. tab compartment_scenario_snail

{txt}compartment_sc {c |}
  enario_snail {c |}      Freq.     Percent        Cum.
{hline 15}{c +}{hline 35}
cumul_death_S1 {c |}{res}        785        1.51        1.51
{txt}cumul_death_S2 {c |}{res}        785        1.51        3.03
{txt}cumul_death_S3 {c |}{res}        785        1.51        4.54
{txt}cumul_death_S4 {c |}{res}        785        1.51        6.06
{txt}cumul_death_S5 {c |}{res}        785        1.51        7.57
{txt}cumul_death_S6 {c |}{res}        785        1.51        9.08
{txt}cumul_infec_S1 {c |}{res}        785        1.51       10.60
{txt}cumul_infec_S2 {c |}{res}        785        1.51       12.11
{txt}cumul_infec_S3 {c |}{res}        785        1.51       13.63
{txt}cumul_infec_S4 {c |}{res}        785        1.51       15.14
{txt}cumul_infec_S5 {c |}{res}        785        1.51       16.65
{txt}cumul_infec_S6 {c |}{res}        785        1.51       18.17
{txt}daily_death_S1 {c |}{res}        785        1.51       19.68
{txt}daily_death_S2 {c |}{res}        785        1.51       21.19
{txt}daily_death_S3 {c |}{res}        785        1.51       22.71
{txt}daily_death_S4 {c |}{res}        785        1.51       24.22
{txt}daily_death_S5 {c |}{res}        785        1.51       25.74
{txt}daily_death_S6 {c |}{res}        785        1.51       27.25
{txt}daily_infec_S1 {c |}{res}        785        1.51       28.76
{txt}daily_infec_S2 {c |}{res}        785        1.51       30.28
{txt}daily_infec_S3 {c |}{res}        785        1.51       31.79
{txt}daily_infec_S4 {c |}{res}        785        1.51       33.31
{txt}daily_infec_S5 {c |}{res}        785        1.51       34.82
{txt}daily_infec_S6 {c |}{res}        785        1.51       36.33
{txt}hospi_deman_S1 {c |}{res}        786        1.52       37.85
{txt}hospi_deman_S2 {c |}{res}        786        1.52       39.37
{txt}hospi_deman_S3 {c |}{res}        786        1.52       40.88
{txt}hospi_deman_S4 {c |}{res}        786        1.52       42.40
{txt}hospi_deman_S5 {c |}{res}        786        1.52       43.91
{txt}hospi_deman_S6 {c |}{res}        786        1.52       45.43
{txt}hospi_incid_S1 {c |}{res}        786        1.52       46.95
{txt}hospi_incid_S2 {c |}{res}        786        1.52       48.46
{txt}hospi_incid_S3 {c |}{res}        786        1.52       49.98
{txt}hospi_incid_S4 {c |}{res}        786        1.52       51.49
{txt}hospi_incid_S5 {c |}{res}        786        1.52       53.01
{txt}hospi_incid_S6 {c |}{res}        786        1.52       54.52
{txt}icu___deman_S1 {c |}{res}        786        1.52       56.04
{txt}icu___deman_S2 {c |}{res}        786        1.52       57.56
{txt}icu___deman_S3 {c |}{res}        786        1.52       59.07
{txt}icu___deman_S4 {c |}{res}        786        1.52       60.59
{txt}icu___deman_S5 {c |}{res}        786        1.52       62.10
{txt}icu___deman_S6 {c |}{res}        786        1.52       63.62
{txt}icu___incid_S1 {c |}{res}        786        1.52       65.14
{txt}icu___incid_S2 {c |}{res}        786        1.52       66.65
{txt}icu___incid_S3 {c |}{res}        786        1.52       68.17
{txt}icu___incid_S4 {c |}{res}        786        1.52       69.68
{txt}icu___incid_S5 {c |}{res}        786        1.52       71.20
{txt}icu___incid_S6 {c |}{res}        786        1.52       72.71
{txt}preval______S1 {c |}{res}        786        1.52       74.23
{txt}preval______S2 {c |}{res}        786        1.52       75.75
{txt}preval______S3 {c |}{res}        786        1.52       77.26
{txt}preval______S4 {c |}{res}        786        1.52       78.78
{txt}preval______S5 {c |}{res}        786        1.52       80.29
{txt}preval______S6 {c |}{res}        786        1.52       81.81
{txt}reff________S1 {c |}{res}        786        1.52       83.33
{txt}reff________S2 {c |}{res}        786        1.52       84.84
{txt}reff________S3 {c |}{res}        786        1.52       86.36
{txt}reff________S4 {c |}{res}        786        1.52       87.87
{txt}reff________S5 {c |}{res}        786        1.52       89.39
{txt}reff________S6 {c |}{res}        786        1.52       90.90
{txt}rt__________S1 {c |}{res}        786        1.52       92.42
{txt}rt__________S2 {c |}{res}        786        1.52       93.94
{txt}rt__________S3 {c |}{res}        786        1.52       95.45
{txt}rt__________S4 {c |}{res}        786        1.52       96.97
{txt}rt__________S5 {c |}{res}        786        1.52       98.48
{txt}rt__________S6 {c |}{res}        786        1.52      100.00
{txt}{hline 15}{c +}{hline 35}
         Total {c |}{res}     51,852      100.00
{txt}
{com}. 
. gen country = "AFRO"
{txt}
{com}. 
. reshape wide y_025_   y_mea_  y_975_, i(country dateblock) j(compartment_scenario_snail) string
{txt}(note: j = cumul_death_S1 cumul_death_S2 cumul_death_S3 cumul_death_S4 cumul_death_S5 cumul_death_S6 cumul_infec_S1 cumul_infec_S2 cumul_infec_S3 cumul_infec_S4 cumul_infec_S5 cumul_infec_S6 daily_death_S1 daily_death_S2 daily_death_S3 daily_death_S4 daily_death_S5 daily_death_S6 daily_infec_S1 daily_infec_S2 daily_infec_S3 daily_infec_S4 daily_infec_S5 daily_infec_S6 hospi_deman_S1 hospi_deman_S2 hospi_deman_S3 hospi_deman_S4 hospi_deman_S5 hospi_deman_S6 hospi_incid_S1 hospi_incid_S2 hospi_incid_S3 hospi_incid_S4 hospi_incid_S5 hospi_incid_S6 icu___deman_S1 icu___deman_S2 icu___deman_S3 icu___deman_S4 icu___deman_S5 icu___deman_S6 icu___incid_S1 icu___incid_S2 icu___incid_S3 icu___incid_S4 icu___incid_S5 icu___incid_S6 preval______S1 preval______S2 preval______S3 preval______S4 preval______S5 preval______S6 reff________S1 reff________S2 reff________S3 reff________S4 reff________S5 reff________S6 rt__________S1 rt__________S2 rt__________S3 rt__________S4 rt__________S5 rt__________S6)

Data{col 36}long{col 43}->{col 48}wide
{hline 77}
Number of obs.                 {res}   51852   {txt}->{res}     786
{txt}Number of variables            {res}       6   {txt}->{res}     200
{txt}j variable (66 values){res}compartment_scenario_snail{txt}->(dropped)
xij variables:
                                 {res}y_025_   {txt}->   {res}y_025_cumul_death_S1 y_025_cumul_death_S2 ... y_025_rt__________S6
                                 y_mea_   {txt}->   {res}y_mea_cumul_death_S1 y_mea_cumul_death_S2 ... y_mea_rt__________S6
                                 y_975_   {txt}->   {res}y_975_cumul_death_S1 y_975_cumul_death_S2 ... y_975_rt__________S6
{txt}{hline 77}

{com}. 
. 
. *
. 
. 
. 
. foreach v of varlist y_025_cumul_death_S1-y_975_rt__________S6 {c -(} 
{txt}  2{com}. 
.         local first = substr("`v'", 7, 11) 
{txt}  3{com}.         local second = substr("`v'", 6, 1)
{txt}  4{com}.         local third  = substr("`v'", 1, 5)
{txt}  5{com}.         local fourth = substr("`v'", 19, 2)
{txt}  6{com}.         label var `v' "`first'`second'`third'`second'`fourth'"
{txt}  7{com}. {c )-} 
{txt}
{com}. *
. 
. 
. 
. foreach v of varlist y_025_cumul_death_S1-y_975_rt__________S6 {c -(} 
{txt}  2{com}.         di `"`: var label `v''"' 
{txt}  3{com}.         local fifth `"`: var label `v''"'
{txt}  4{com}.         rename `v'   `fifth'
{txt}  5{com}. {c )-}
cumul_death_y_025_S1
{res}cumul_death_y_mea_S1
cumul_death_y_975_S1
cumul_death_y_025_S2
cumul_death_y_mea_S2
cumul_death_y_975_S2
cumul_death_y_025_S3
cumul_death_y_mea_S3
cumul_death_y_975_S3
cumul_death_y_025_S4
cumul_death_y_mea_S4
cumul_death_y_975_S4
cumul_death_y_025_S5
cumul_death_y_mea_S5
cumul_death_y_975_S5
cumul_death_y_025_S6
cumul_death_y_mea_S6
cumul_death_y_975_S6
cumul_infec_y_025_S1
cumul_infec_y_mea_S1
cumul_infec_y_975_S1
cumul_infec_y_025_S2
cumul_infec_y_mea_S2
cumul_infec_y_975_S2
cumul_infec_y_025_S3
cumul_infec_y_mea_S3
cumul_infec_y_975_S3
cumul_infec_y_025_S4
cumul_infec_y_mea_S4
cumul_infec_y_975_S4
cumul_infec_y_025_S5
cumul_infec_y_mea_S5
cumul_infec_y_975_S5
cumul_infec_y_025_S6
cumul_infec_y_mea_S6
cumul_infec_y_975_S6
daily_death_y_025_S1
daily_death_y_mea_S1
daily_death_y_975_S1
daily_death_y_025_S2
daily_death_y_mea_S2
daily_death_y_975_S2
daily_death_y_025_S3
daily_death_y_mea_S3
daily_death_y_975_S3
daily_death_y_025_S4
daily_death_y_mea_S4
daily_death_y_975_S4
daily_death_y_025_S5
daily_death_y_mea_S5
daily_death_y_975_S5
daily_death_y_025_S6
daily_death_y_mea_S6
daily_death_y_975_S6
daily_infec_y_025_S1
daily_infec_y_mea_S1
daily_infec_y_975_S1
daily_infec_y_025_S2
daily_infec_y_mea_S2
daily_infec_y_975_S2
daily_infec_y_025_S3
daily_infec_y_mea_S3
daily_infec_y_975_S3
daily_infec_y_025_S4
daily_infec_y_mea_S4
daily_infec_y_975_S4
daily_infec_y_025_S5
daily_infec_y_mea_S5
daily_infec_y_975_S5
daily_infec_y_025_S6
daily_infec_y_mea_S6
daily_infec_y_975_S6
hospi_deman_y_025_S1
hospi_deman_y_mea_S1
hospi_deman_y_975_S1
hospi_deman_y_025_S2
hospi_deman_y_mea_S2
hospi_deman_y_975_S2
hospi_deman_y_025_S3
hospi_deman_y_mea_S3
hospi_deman_y_975_S3
hospi_deman_y_025_S4
hospi_deman_y_mea_S4
hospi_deman_y_975_S4
hospi_deman_y_025_S5
hospi_deman_y_mea_S5
hospi_deman_y_975_S5
hospi_deman_y_025_S6
hospi_deman_y_mea_S6
hospi_deman_y_975_S6
hospi_incid_y_025_S1
hospi_incid_y_mea_S1
hospi_incid_y_975_S1
hospi_incid_y_025_S2
hospi_incid_y_mea_S2
hospi_incid_y_975_S2
hospi_incid_y_025_S3
hospi_incid_y_mea_S3
hospi_incid_y_975_S3
hospi_incid_y_025_S4
hospi_incid_y_mea_S4
hospi_incid_y_975_S4
hospi_incid_y_025_S5
hospi_incid_y_mea_S5
hospi_incid_y_975_S5
hospi_incid_y_025_S6
hospi_incid_y_mea_S6
hospi_incid_y_975_S6
icu___deman_y_025_S1
icu___deman_y_mea_S1
icu___deman_y_975_S1
icu___deman_y_025_S2
icu___deman_y_mea_S2
icu___deman_y_975_S2
icu___deman_y_025_S3
icu___deman_y_mea_S3
icu___deman_y_975_S3
icu___deman_y_025_S4
icu___deman_y_mea_S4
icu___deman_y_975_S4
icu___deman_y_025_S5
icu___deman_y_mea_S5
icu___deman_y_975_S5
icu___deman_y_025_S6
icu___deman_y_mea_S6
icu___deman_y_975_S6
icu___incid_y_025_S1
icu___incid_y_mea_S1
icu___incid_y_975_S1
icu___incid_y_025_S2
icu___incid_y_mea_S2
icu___incid_y_975_S2
icu___incid_y_025_S3
icu___incid_y_mea_S3
icu___incid_y_975_S3
icu___incid_y_025_S4
icu___incid_y_mea_S4
icu___incid_y_975_S4
icu___incid_y_025_S5
icu___incid_y_mea_S5
icu___incid_y_975_S5
icu___incid_y_025_S6
icu___incid_y_mea_S6
icu___incid_y_975_S6
preval______y_025_S1
preval______y_mea_S1
preval______y_975_S1
preval______y_025_S2
preval______y_mea_S2
preval______y_975_S2
preval______y_025_S3
preval______y_mea_S3
preval______y_975_S3
preval______y_025_S4
preval______y_mea_S4
preval______y_975_S4
preval______y_025_S5
preval______y_mea_S5
preval______y_975_S5
preval______y_025_S6
preval______y_mea_S6
preval______y_975_S6
reff________y_025_S1
reff________y_mea_S1
reff________y_975_S1
reff________y_025_S2
reff________y_mea_S2
reff________y_975_S2
reff________y_025_S3
reff________y_mea_S3
reff________y_975_S3
reff________y_025_S4
reff________y_mea_S4
reff________y_975_S4
reff________y_025_S5
reff________y_mea_S5
reff________y_975_S5
reff________y_025_S6
reff________y_mea_S6
reff________y_975_S6
rt__________y_025_S1
rt__________y_mea_S1
rt__________y_975_S1
rt__________y_025_S2
rt__________y_mea_S2
rt__________y_975_S2
rt__________y_025_S3
rt__________y_mea_S3
rt__________y_975_S3
rt__________y_025_S4
rt__________y_mea_S4
rt__________y_975_S4
rt__________y_025_S5
rt__________y_mea_S5
rt__________y_975_S5
rt__________y_025_S6
rt__________y_mea_S6
rt__________y_975_S6
{txt}
{com}. *
. 
. 
. * gen date
. 
. gen year = substr(dateblock,1,4) 
{txt}
{com}. gen month = substr(dateblock,5,2) 
{txt}
{com}. gen day = substr(dateblock,7,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21931{txt},{res}22716{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}17jan2020{txt},{res}12mar2022{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}786{col 51}{txt}missing .:  {res}0{txt}/{res}786

{txt}{col 19}mean:{res}{col 26} 22323.5{txt} = {res}12feb2021{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26} 227.043

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   22009{col 37}   22127{col 47} 22323.5{col 57}   22520{col 67}   22638
{col 26}04apr2020{col 36}31jul2020{col 46}12feb2021{col 56}28aug2021{col 66}24dec2021
{txt}
{com}. 
. 
. 
. * 
. 
. 
. * -renvars- somanyvars rather time consuming
. 
. foreach v of varlist cumul_death_y_025_S1-rt__________y_975_S6 {c -(} 
{txt}  2{com}. 
.     qui renvars, presub(cumul_death_y_025_ TotDeaLoRa)
{txt}  3{com}.     qui renvars, presub(cumul_death_y_975_ TotDeaUpRa)
{txt}  4{com}.     qui renvars, presub(cumul_death_y_mea_ TotDeaMeRa)
{txt}  5{com}. 
.         qui renvars, presub(daily_death_y_025_ DayDeaLoRa)
{txt}  6{com}.         qui renvars, presub(daily_death_y_975_ DayDeaUpRa)
{txt}  7{com}.         qui renvars, presub(daily_death_y_mea_ DayDeaMeRa)
{txt}  8{com}.         
.     qui renvars, presub(cumul_infec_y_025_ TotINFLoRa)
{txt}  9{com}.     qui renvars, presub(cumul_infec_y_975_ TotINFUpRa)
{txt} 10{com}.     qui renvars, presub(cumul_infec_y_mea_ TotINFMeRa)
{txt} 11{com}.         
.         qui renvars, presub(daily_infec_y_025_ DayINFLoRa)
{txt} 12{com}.         qui renvars, presub(daily_infec_y_975_ DayINFUpRa)
{txt} 13{com}.         qui renvars, presub(daily_infec_y_mea_ DayINFMeRa)
{txt} 14{com}.         
.         * other outcomes
.         
.         qui renvars, presub(icu___deman_y_025_ DayIcdLoRa) // "ICU_demand" 
{txt} 15{com}.         qui renvars, presub(icu___deman_y_975_ DayIcdUpRa)
{txt} 16{com}.         qui renvars, presub(icu___deman_y_mea_ DayIcdMeRa)
{txt} 17{com}.         
.         qui renvars, presub(icu___incid_y_025_ DayIciLoRa) // "ICU_incidence"
{txt} 18{com}.         qui renvars, presub(icu___incid_y_975_ DayIciUpRa)
{txt} 19{com}.         qui renvars, presub(icu___incid_y_mea_ DayIciMeRa)
{txt} 20{com}.         
.         qui renvars, presub(reff________y_025_ DayRefLoRa) // "Reff"
{txt} 21{com}.         qui renvars, presub(reff________y_975_ DayRefUpRa)
{txt} 22{com}.         qui renvars, presub(reff________y_mea_ DayRefMeRa)
{txt} 23{com}.         
.         qui renvars, presub(rt__________y_025_ DayRttLoRa) // "Rt"
{txt} 24{com}.         qui renvars, presub(rt__________y_975_ DayRttUpRa)
{txt} 25{com}.         qui renvars, presub(rt__________y_mea_ DayRttMeRa)
{txt} 26{com}.         
.         qui renvars, presub(hospi_deman_y_025_ DayHodLoRa) // "hospital_demand"
{txt} 27{com}.         qui renvars, presub(hospi_deman_y_975_ DayHodUpRa)
{txt} 28{com}.         qui renvars, presub(hospi_deman_y_mea_ DayHodMeRa)
{txt} 29{com}.         
.         qui renvars, presub(hospi_incid_y_025_ DayHoiLoRa) // "hospital_incidence"
{txt} 30{com}.         qui renvars, presub(hospi_incid_y_975_ DayHoiUpRa)
{txt} 31{com}.         qui renvars, presub(hospi_incid_y_mea_ DayHoiMeRa)
{txt} 32{com}.         
.         qui renvars, presub(preval______y_025_ DayPreLoRa) // "prevalence"
{txt} 33{com}.         qui renvars, presub(preval______y_975_ DayPreUpRa)
{txt} 34{com}.         qui renvars, presub(preval______y_mea_ DayPreMeRa)
{txt} 35{com}.         
.         qui renvars, postsub(S1 A03S01) 
{txt} 36{com}.         qui renvars, postsub(S2 A03S02) 
{txt} 37{com}.         qui renvars, postsub(S3 A03S03) 
{txt} 38{com}.         qui renvars, postsub(S4 A03S04) 
{txt} 39{com}.         qui renvars, postsub(S5 A03S05) 
{txt} 40{com}.         qui renvars, postsub(S6 A03S06) 
{txt} 41{com}.         
.         * "Wait Note: renvars are working ..."
.         
. {c )-} 
{txt}
{com}. *   
. 
. 
. 
. *
. 
. drop year month day date2 dateblock
{txt}
{com}. 
. order date  
{txt}
{com}. 
. label var DayINFLoRaA03S01 "Daily infections Lower A03 S01 "
{txt}
{com}. label var DayINFLoRaA03S02 "Daily infections Lower A03 S02 "
{txt}
{com}. label var DayINFLoRaA03S03 "Daily infections Lower A03 S03 "
{txt}
{com}. label var DayINFLoRaA03S04 "Daily infections Lower A03 S04 "
{txt}
{com}. label var DayINFLoRaA03S05 "Daily infections Lower A03 S05 "
{txt}
{com}. label var DayINFLoRaA03S06 "Daily infections Lower A03 S06 "
{txt}
{com}. label var DayINFMeRaA03S01 "Daily infections Mean A03 S01 "
{txt}
{com}. label var DayINFMeRaA03S02 "Daily infections Mean A03 S02 "
{txt}
{com}. label var DayINFMeRaA03S03 "Daily infections Mean A03 S03 "
{txt}
{com}. label var DayINFMeRaA03S04 "Daily infections Mean A03 S04 "
{txt}
{com}. label var DayINFMeRaA03S05 "Daily infections Mean A03 S05 "
{txt}
{com}. label var DayINFMeRaA03S06 "Daily infections Mean A03 S06 "
{txt}
{com}. label var DayINFUpRaA03S01 "Daily infections Upper A03 S01 "
{txt}
{com}. label var DayINFUpRaA03S02 "Daily infections Upper A03 S02 "
{txt}
{com}. label var DayINFUpRaA03S03 "Daily infections Upper A03 S03 "
{txt}
{com}. label var DayINFUpRaA03S04 "Daily infections Upper A03 S04 "
{txt}
{com}. label var DayINFUpRaA03S05 "Daily infections Upper A03 S05 "
{txt}
{com}. label var DayINFUpRaA03S06 "Daily infections Upper A03 S06 "
{txt}
{com}. label var DayDeaLoRaA03S01 "Daily Deaths Lower A03 S01 "
{txt}
{com}. label var DayDeaLoRaA03S02 "Daily Deaths Lower A03 S02 "
{txt}
{com}. label var DayDeaLoRaA03S03 "Daily Deaths Lower A03 S03 "
{txt}
{com}. label var DayDeaLoRaA03S04 "Daily Deaths Lower A03 S04 "
{txt}
{com}. label var DayDeaLoRaA03S05 "Daily Deaths Lower A03 S05 "
{txt}
{com}. label var DayDeaLoRaA03S06 "Daily Deaths Lower A03 S06 "
{txt}
{com}. label var DayDeaMeRaA03S01 "Daily Deaths Mean A03 S01 "
{txt}
{com}. label var DayDeaMeRaA03S02 "Daily Deaths Mean A03 S02 "
{txt}
{com}. label var DayDeaMeRaA03S03 "Daily Deaths Mean A03 S03 "
{txt}
{com}. label var DayDeaMeRaA03S04 "Daily Deaths Mean A03 S04 "
{txt}
{com}. label var DayDeaMeRaA03S05 "Daily Deaths Mean A03 S05 "
{txt}
{com}. label var DayDeaMeRaA03S06 "Daily Deaths Mean A03 S06 "
{txt}
{com}. label var DayDeaUpRaA03S01 "Daily Deaths Upper A03 S01 "
{txt}
{com}. label var DayDeaUpRaA03S02 "Daily Deaths Upper A03 S02 "
{txt}
{com}. label var DayDeaUpRaA03S03 "Daily Deaths Upper A03 S03 "
{txt}
{com}. label var DayDeaUpRaA03S04 "Daily Deaths Upper A03 S04 "
{txt}
{com}. label var DayDeaUpRaA03S05 "Daily Deaths Upper A03 S05 "
{txt}
{com}. label var DayDeaUpRaA03S06 "Daily Deaths Upper A03 S06 "
{txt}
{com}. label var TotINFLoRaA03S01 "Total infections Lower A03 S01 "
{txt}
{com}. label var TotINFLoRaA03S02 "Total infections Lower A03 S02 "
{txt}
{com}. label var TotINFLoRaA03S03 "Total infections Lower A03 S03 "
{txt}
{com}. label var TotINFLoRaA03S04 "Total infections Lower A03 S04 "
{txt}
{com}. label var TotINFLoRaA03S05 "Total infections Lower A03 S05 "
{txt}
{com}. label var TotINFLoRaA03S06 "Total infections Lower A03 S06 "
{txt}
{com}. label var TotINFMeRaA03S01 "Total infections Mean A03 S01 "
{txt}
{com}. label var TotINFMeRaA03S02 "Total infections Mean A03 S02 "
{txt}
{com}. label var TotINFMeRaA03S03 "Total infections Mean A03 S03 "
{txt}
{com}. label var TotINFMeRaA03S04 "Total infections Mean A03 S04 "
{txt}
{com}. label var TotINFMeRaA03S05 "Total infections Mean A03 S05 "
{txt}
{com}. label var TotINFMeRaA03S06 "Total infections Mean A03 S06 "
{txt}
{com}. label var TotINFUpRaA03S01 "Total infections Upper A03 S01 "
{txt}
{com}. label var TotINFUpRaA03S02 "Total infections Upper A03 S02 "
{txt}
{com}. label var TotINFUpRaA03S03 "Total infections Upper A03 S03 "
{txt}
{com}. label var TotINFUpRaA03S04 "Total infections Upper A03 S04 "
{txt}
{com}. label var TotINFUpRaA03S05 "Total infections Upper A03 S05 "
{txt}
{com}. label var TotINFUpRaA03S06 "Total infections Upper A03 S06 "
{txt}
{com}. label var TotDeaLoRaA03S01 "Total Deaths Lower A03 S01 "
{txt}
{com}. label var TotDeaLoRaA03S02 "Total Deaths Lower A03 S02 "
{txt}
{com}. label var TotDeaLoRaA03S03 "Total Deaths Lower A03 S03 "
{txt}
{com}. label var TotDeaLoRaA03S04 "Total Deaths Lower A03 S04 "
{txt}
{com}. label var TotDeaLoRaA03S05 "Total Deaths Lower A03 S05 "
{txt}
{com}. label var TotDeaLoRaA03S06 "Total Deaths Lower A03 S06 "
{txt}
{com}. label var TotDeaMeRaA03S01 "Total Deaths Mean A03 S01 "
{txt}
{com}. label var TotDeaMeRaA03S02 "Total Deaths Mean A03 S02 "
{txt}
{com}. label var TotDeaMeRaA03S03 "Total Deaths Mean A03 S03 "
{txt}
{com}. label var TotDeaMeRaA03S04 "Total Deaths Mean A03 S04 "
{txt}
{com}. label var TotDeaMeRaA03S05 "Total Deaths Mean A03 S05 "
{txt}
{com}. label var TotDeaMeRaA03S06 "Total Deaths Mean A03 S06 "
{txt}
{com}. label var TotDeaUpRaA03S01 "Total Deaths Upper A03 S01 "
{txt}
{com}. label var TotDeaUpRaA03S02 "Total Deaths Upper A03 S02 "
{txt}
{com}. label var TotDeaUpRaA03S03 "Total Deaths Upper A03 S03 "
{txt}
{com}. label var TotDeaUpRaA03S04 "Total Deaths Upper A03 S04 "
{txt}
{com}. label var TotDeaUpRaA03S05 "Total Deaths Upper A03 S05 "
{txt}
{com}. label var TotDeaUpRaA03S06 "Total Deaths Upper A03 S06 "
{txt}
{com}. 
. 
. * other outcomes
. 
. label var DayHodMeRaA03S01 "Daily hospital demand Mean A03 S01 "
{txt}
{com}. label var DayHodLoRaA03S01 "Daily hospital demand Lower A03 S01 "
{txt}
{com}. label var DayHodUpRaA03S01 "Daily hospital demand Upper A03 S01 "
{txt}
{com}. label var DayHodMeRaA03S02 "Daily hospital demand Mean A03 S02 "
{txt}
{com}. label var DayHodLoRaA03S02 "Daily hospital demand Lower A03 S02 "
{txt}
{com}. label var DayHodUpRaA03S02 "Daily hospital demand Upper A03 S02 "
{txt}
{com}. label var DayHodMeRaA03S03 "Daily hospital demand Mean A03 S03 "
{txt}
{com}. label var DayHodLoRaA03S03 "Daily hospital demand Lower A03 S03 "
{txt}
{com}. label var DayHodUpRaA03S03 "Daily hospital demand Upper A03 S03 "
{txt}
{com}. label var DayHodMeRaA03S04 "Daily hospital demand Mean A03 S04 "
{txt}
{com}. label var DayHodLoRaA03S04 "Daily hospital demand Lower A03 S04 "
{txt}
{com}. label var DayHodUpRaA03S04 "Daily hospital demand Upper A03 S04 " 
{txt}
{com}. label var DayHodMeRaA03S05 "Daily hospital demand Mean A03 S05 "
{txt}
{com}. label var DayHodLoRaA03S05 "Daily hospital demand Lower A03 S05 "
{txt}
{com}. label var DayHodUpRaA03S05 "Daily hospital demand Upper A03 S05 "
{txt}
{com}. label var DayHodMeRaA03S06 "Daily hospital demand Mean A03 S06 "
{txt}
{com}. label var DayHodLoRaA03S06 "Daily hospital demand Lower A03 S06 "
{txt}
{com}. label var DayHodUpRaA03S06 "Daily hospital demand Upper A03 S06 "
{txt}
{com}. 
. label var DayHoiMeRaA03S01 "Daily hospital incidence Mean A03 S01 "
{txt}
{com}. label var DayHoiLoRaA03S01 "Daily hospital incidence Lower A03 S01 "
{txt}
{com}. label var DayHoiUpRaA03S01 "Daily hospital incidence Upper A03 S01 "
{txt}
{com}. label var DayHoiMeRaA03S02 "Daily hospital incidence Mean A03 S02 "
{txt}
{com}. label var DayHoiLoRaA03S02 "Daily hospital incidence Lower A03 S02 "
{txt}
{com}. label var DayHoiUpRaA03S02 "Daily hospital incidence Upper A03 S02 "
{txt}
{com}. label var DayHoiMeRaA03S03 "Daily hospital incidence Mean A03 S03 "
{txt}
{com}. label var DayHoiLoRaA03S03 "Daily hospital incidence Lower A03 S03 "
{txt}
{com}. label var DayHoiUpRaA03S03 "Daily hospital incidence Upper A03 S03 "
{txt}
{com}. label var DayHoiMeRaA03S04 "Daily hospital incidence Mean A03 S04 "
{txt}
{com}. label var DayHoiLoRaA03S04 "Daily hospital incidence Lower A03 S04 "
{txt}
{com}. label var DayHoiUpRaA03S04 "Daily hospital incidence Upper A03 S04 "
{txt}
{com}. label var DayHoiMeRaA03S05 "Daily hospital incidence Mean A03 S05 "
{txt}
{com}. label var DayHoiLoRaA03S05 "Daily hospital incidence Lower A03 S05 "
{txt}
{com}. label var DayHoiUpRaA03S05 "Daily hospital incidence Upper A03 S05 "
{txt}
{com}. label var DayHoiMeRaA03S06 "Daily hospital incidence Mean A03 S06 "
{txt}
{com}. label var DayHoiLoRaA03S06 "Daily hospital incidence Lower A03 S06 "
{txt}
{com}. label var DayHoiUpRaA03S06 "Daily hospital incidence Upper A03 S06 "
{txt}
{com}. 
. label var DayIcdMeRaA03S01 "Daily ICU demand Mean A03 S01 "
{txt}
{com}. label var DayIcdLoRaA03S01 "Daily ICU demand Lower A03 S01 "
{txt}
{com}. label var DayIcdUpRaA03S01 "Daily ICU demand Upper A03 S01 "
{txt}
{com}. label var DayIcdMeRaA03S02 "Daily ICU demand Mean A03 S02 "
{txt}
{com}. label var DayIcdLoRaA03S02 "Daily ICU demand Lower A03 S02 "
{txt}
{com}. label var DayIcdUpRaA03S02 "Daily ICU demand Upper A03 S02 "
{txt}
{com}. label var DayIcdMeRaA03S03 "Daily ICU demand Mean A03 S03 "
{txt}
{com}. label var DayIcdLoRaA03S03 "Daily ICU demand Lower A03 S03 "
{txt}
{com}. label var DayIcdUpRaA03S03 "Daily ICU demand Upper A03 S03 "
{txt}
{com}. label var DayIcdMeRaA03S04 "Daily ICU demand Mean A03 S04 "
{txt}
{com}. label var DayIcdLoRaA03S04 "Daily ICU demand Lower A03 S04 "
{txt}
{com}. label var DayIcdUpRaA03S04 "Daily ICU demand Upper A03 S04 "
{txt}
{com}. label var DayIcdMeRaA03S05 "Daily ICU demand Mean A03 S05 "
{txt}
{com}. label var DayIcdLoRaA03S05 "Daily ICU demand Lower A03 S05 "
{txt}
{com}. label var DayIcdUpRaA03S05 "Daily ICU demand Upper A03 S05 "
{txt}
{com}. label var DayIcdMeRaA03S06 "Daily ICU demand Mean A03 S06 "
{txt}
{com}. label var DayIcdLoRaA03S06 "Daily ICU demand Lower A03 S06 "
{txt}
{com}. label var DayIcdUpRaA03S06 "Daily ICU demand Upper A03 S06 "
{txt}
{com}. 
. label var DayIciMeRaA03S01 "Daily ICU incidence Mean A03 S01 "
{txt}
{com}. label var DayIciLoRaA03S01 "Daily ICU incidence Lower A03 S01 "
{txt}
{com}. label var DayIciUpRaA03S01 "Daily ICU incidence Upper A03 S01 "
{txt}
{com}. label var DayIciMeRaA03S02 "Daily ICU incidence Mean A03 S02 "
{txt}
{com}. label var DayIciLoRaA03S02 "Daily ICU incidence Lower A03 S02 "
{txt}
{com}. label var DayIciUpRaA03S02 "Daily ICU incidence Upper A03 S02 "
{txt}
{com}. label var DayIciMeRaA03S03 "Daily ICU incidence Mean A03 S03 "
{txt}
{com}. label var DayIciLoRaA03S03 "Daily ICU incidence Lower A03 S03 "
{txt}
{com}. label var DayIciUpRaA03S03 "Daily ICU incidence Upper A03 S03 "
{txt}
{com}. label var DayIciMeRaA03S04 "Daily ICU incidence Mean A03 S04 "
{txt}
{com}. label var DayIciLoRaA03S04 "Daily ICU incidence Lower A03 S04 "
{txt}
{com}. label var DayIciUpRaA03S04 "Daily ICU incidence Upper A03 S04 "
{txt}
{com}. label var DayIciMeRaA03S05 "Daily ICU incidence Mean A03 S05 "
{txt}
{com}. label var DayIciLoRaA03S05 "Daily ICU incidence Lower A03 S05 "
{txt}
{com}. label var DayIciUpRaA03S05 "Daily ICU incidence Upper A03 S05 "
{txt}
{com}. label var DayIciMeRaA03S06 "Daily ICU incidence Mean A03 S06 "
{txt}
{com}. label var DayIciLoRaA03S06 "Daily ICU incidence Lower A03 S06 "
{txt}
{com}. label var DayIciUpRaA03S06 "Daily ICU incidence Upper A03 S06 "
{txt}
{com}. 
. label var DayPreMeRaA03S01 "Daily prevalence Mean A03 S01 "
{txt}
{com}. label var DayPreLoRaA03S01 "Daily prevalence Lower A03 S01 "
{txt}
{com}. label var DayPreUpRaA03S01 "Daily prevalence Upper A03 S01 "
{txt}
{com}. label var DayPreMeRaA03S02 "Daily prevalence Mean A03 S02 "
{txt}
{com}. label var DayPreLoRaA03S02 "Daily prevalence Lower A03 S02 "
{txt}
{com}. label var DayPreUpRaA03S02 "Daily prevalence Upper A03 S02 "
{txt}
{com}. label var DayPreMeRaA03S03 "Daily prevalence Mean A03 S03 "
{txt}
{com}. label var DayPreLoRaA03S03 "Daily prevalence Lower A03 S03 "
{txt}
{com}. label var DayPreUpRaA03S03 "Daily prevalence Upper A03 S03 "
{txt}
{com}. label var DayPreMeRaA03S04 "Daily prevalence Mean A03 S04 "
{txt}
{com}. label var DayPreLoRaA03S04 "Daily prevalence Lower A03 S04 "
{txt}
{com}. label var DayPreUpRaA03S04 "Daily prevalence Upper A03 S04 "
{txt}
{com}. label var DayPreMeRaA03S05 "Daily prevalence Mean A03 S05 "
{txt}
{com}. label var DayPreLoRaA03S05 "Daily prevalence Lower A03 S05 "
{txt}
{com}. label var DayPreUpRaA03S05 "Daily prevalence Upper A03 S05 "
{txt}
{com}. label var DayPreMeRaA03S06 "Daily prevalence Mean A03 S06 "
{txt}
{com}. label var DayPreLoRaA03S06 "Daily prevalence Lower A03 S06 "
{txt}
{com}. label var DayPreUpRaA03S06 "Daily prevalence Upper A03 S06 "
{txt}
{com}. 
. label var DayRefMeRaA03S01 "Daily R effective Mean A03 S01 "
{txt}
{com}. label var DayRefLoRaA03S01 "Daily R effective Lower A03 S01 "
{txt}
{com}. label var DayRefUpRaA03S01 "Daily R effective Upper A03 S01 "
{txt}
{com}. label var DayRefMeRaA03S02 "Daily R effective Mean A03 S02 "
{txt}
{com}. label var DayRefLoRaA03S02 "Daily R effective Lower A03 S02 "
{txt}
{com}. label var DayRefUpRaA03S02 "Daily R effective Upper A03 S02 "
{txt}
{com}. label var DayRefMeRaA03S03 "Daily R effective Mean A03 S03 "
{txt}
{com}. label var DayRefLoRaA03S03 "Daily R effective Lower A03 S03 "
{txt}
{com}. label var DayRefUpRaA03S03 "Daily R effective Upper A03 S03 "
{txt}
{com}. label var DayRefMeRaA03S04 "Daily R effective Mean A03 S04 "
{txt}
{com}. label var DayRefLoRaA03S04 "Daily R effective Lower A03 S04 "
{txt}
{com}. label var DayRefUpRaA03S04 "Daily R effective Upper A03 S04 "
{txt}
{com}. label var DayRefMeRaA03S05 "Daily R effective Mean A03 S05 "
{txt}
{com}. label var DayRefLoRaA03S05 "Daily R effective Lower A03 S05 "
{txt}
{com}. label var DayRefUpRaA03S05 "Daily R effective Upper A03 S05 "
{txt}
{com}. label var DayRefMeRaA03S06 "Daily R effective Mean A03 S06 "
{txt}
{com}. label var DayRefLoRaA03S06 "Daily R effective Lower A03 S06 "
{txt}
{com}. label var DayRefUpRaA03S06 "Daily R effective Upper A03 S06 "
{txt}
{com}. 
. label var DayRttMeRaA03S01 "Daily R t Mean A03 S01 "
{txt}
{com}. label var DayRttLoRaA03S01 "Daily R t Lower A03 S01 "
{txt}
{com}. label var DayRttUpRaA03S01 "Daily R t Upper A03 S01 "
{txt}
{com}. label var DayRttMeRaA03S02 "Daily R t Mean A03 S02 "
{txt}
{com}. label var DayRttLoRaA03S02 "Daily R t Lower A03 S02 "
{txt}
{com}. label var DayRttUpRaA03S02 "Daily R t Upper A03 S02 "
{txt}
{com}. label var DayRttMeRaA03S03 "Daily R t Mean A03 S03 "
{txt}
{com}. label var DayRttLoRaA03S03 "Daily R t Lower A03 S03 "
{txt}
{com}. label var DayRttUpRaA03S03 "Daily R t Upper A03 S03 "
{txt}
{com}. label var DayRttMeRaA03S04 "Daily R t Mean A03 S04 "
{txt}
{com}. label var DayRttLoRaA03S04 "Daily R t Lower A03 S04 "
{txt}
{com}. label var DayRttUpRaA03S04 "Daily R t Upper A03 S04 "
{txt}
{com}. label var DayRttMeRaA03S05 "Daily R t Mean A03 S05 "
{txt}
{com}. label var DayRttLoRaA03S05 "Daily R t Lower A03 S05 "
{txt}
{com}. label var DayRttUpRaA03S05 "Daily R t Upper A03 S05 "
{txt}
{com}. label var DayRttMeRaA03S06 "Daily R t Mean A03 S06 "
{txt}
{com}. label var DayRttLoRaA03S06 "Daily R t Lower A03 S06 "
{txt}
{com}. label var DayRttUpRaA03S06 "Daily R t Upper A03 S06 "
{txt}
{com}. 
. 
. rename country loc_grand_name
{res}{txt}
{com}. 
. 
. 
. order ///
> loc_grand_name date     ///
> TotDeaMeRaA03S01        TotDeaLoRaA03S01        TotDeaUpRaA03S01        ///
> TotDeaMeRaA03S02        TotDeaLoRaA03S02        TotDeaUpRaA03S02        ///
> TotDeaMeRaA03S03        TotDeaLoRaA03S03        TotDeaUpRaA03S03        ///
> TotDeaMeRaA03S04        TotDeaLoRaA03S04        TotDeaUpRaA03S04        ///
> TotDeaMeRaA03S05        TotDeaLoRaA03S05        TotDeaUpRaA03S05        ///
> TotDeaMeRaA03S06        TotDeaLoRaA03S06        TotDeaUpRaA03S06        ///
> DayDeaMeRaA03S01        DayDeaLoRaA03S01        DayDeaUpRaA03S01        ///
> DayDeaMeRaA03S02        DayDeaLoRaA03S02        DayDeaUpRaA03S02        ///
> DayDeaMeRaA03S03        DayDeaLoRaA03S03        DayDeaUpRaA03S03        ///
> DayDeaMeRaA03S04        DayDeaLoRaA03S04        DayDeaUpRaA03S04        ///
> DayDeaMeRaA03S05        DayDeaLoRaA03S05        DayDeaUpRaA03S05        ///
> DayDeaMeRaA03S06        DayDeaLoRaA03S06        DayDeaUpRaA03S06        ///
> TotINFMeRaA03S01        TotINFLoRaA03S01        TotINFUpRaA03S01        ///
> TotINFMeRaA03S02        TotINFLoRaA03S02        TotINFUpRaA03S02        ///
> TotINFMeRaA03S03        TotINFLoRaA03S03        TotINFUpRaA03S03        ///
> TotINFMeRaA03S04        TotINFLoRaA03S04        TotINFUpRaA03S04        ///
> TotINFMeRaA03S05        TotINFLoRaA03S05        TotINFUpRaA03S05        ///
> TotINFMeRaA03S06        TotINFLoRaA03S06        TotINFUpRaA03S06        ///
> DayINFMeRaA03S01        DayINFLoRaA03S01        DayINFUpRaA03S01        ///
> DayINFMeRaA03S02        DayINFLoRaA03S02        DayINFUpRaA03S02        ///
> DayINFMeRaA03S03        DayINFLoRaA03S03        DayINFUpRaA03S03        ///
> DayINFMeRaA03S04        DayINFLoRaA03S04        DayINFUpRaA03S04        ///
> DayINFMeRaA03S05        DayINFLoRaA03S05        DayINFUpRaA03S05        ///
> DayINFMeRaA03S06        DayINFLoRaA03S06        DayINFUpRaA03S06
{txt}
{com}. 
. 
.  *
.  
.  
. * gen IFR
. 
. gen DayIFRMeRaA03S01 = 100 * DayDeaMeRaA03S01 / DayINFMeRaA03S01 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S01 = 100 * DayDeaLoRaA03S01 / DayINFLoRaA03S01 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S01 = 100 * DayDeaUpRaA03S01 / DayINFUpRaA03S01 
{txt}(1 missing value generated)

{com}. gen DayIFRMeRaA03S02 = 100 * DayDeaMeRaA03S02 / DayINFMeRaA03S02 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S02 = 100 * DayDeaLoRaA03S02 / DayINFLoRaA03S02 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S02 = 100 * DayDeaUpRaA03S02 / DayINFUpRaA03S02 
{txt}(1 missing value generated)

{com}. gen DayIFRMeRaA03S03 = 100 * DayDeaMeRaA03S03 / DayINFMeRaA03S03 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S03 = 100 * DayDeaLoRaA03S03 / DayINFLoRaA03S03 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S03 = 100 * DayDeaUpRaA03S03 / DayINFUpRaA03S03 
{txt}(1 missing value generated)

{com}. gen DayIFRMeRaA03S04 = 100 * DayDeaMeRaA03S04 / DayINFMeRaA03S04 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S04 = 100 * DayDeaLoRaA03S04 / DayINFLoRaA03S04 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S04 = 100 * DayDeaUpRaA03S04 / DayINFUpRaA03S04 
{txt}(1 missing value generated)

{com}. gen DayIFRMeRaA03S05 = 100 * DayDeaMeRaA03S05 / DayINFMeRaA03S05 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S05 = 100 * DayDeaLoRaA03S05 / DayINFLoRaA03S05 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S05 = 100 * DayDeaUpRaA03S05 / DayINFUpRaA03S05 
{txt}(1 missing value generated)

{com}. gen DayIFRMeRaA03S06 = 100 * DayDeaMeRaA03S06 / DayINFMeRaA03S06 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S06 = 100 * DayDeaLoRaA03S06 / DayINFLoRaA03S06 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S06 = 100 * DayDeaUpRaA03S06 / DayINFUpRaA03S06 
{txt}(1 missing value generated)

{com}. 
. label var DayIFRMeRaA03S01 "Daily IFR Mean A03 S01 "
{txt}
{com}. label var DayIFRLoRaA03S01 "Daily IFR Lower A03 S01 "
{txt}
{com}. label var DayIFRUpRaA03S01 "Daily IFR Upper A03 S01 "
{txt}
{com}. label var DayIFRMeRaA03S02 "Daily IFR Mean A03 S02 "
{txt}
{com}. label var DayIFRLoRaA03S02 "Daily IFR Lower A03 S02 "
{txt}
{com}. label var DayIFRUpRaA03S02 "Daily IFR Upper A03 S02 "
{txt}
{com}. label var DayIFRMeRaA03S03 "Daily IFR Mean A03 S03 "
{txt}
{com}. label var DayIFRLoRaA03S03 "Daily IFR Lower A03 S03 "
{txt}
{com}. label var DayIFRUpRaA03S03 "Daily IFR Upper A03 S03 "
{txt}
{com}. label var DayIFRMeRaA03S04 "Daily IFR Mean A03 S04 "
{txt}
{com}. label var DayIFRLoRaA03S04 "Daily IFR Lower A03 S04 "
{txt}
{com}. label var DayIFRUpRaA03S04 "Daily IFR Upper A03 S04 "
{txt}
{com}. label var DayIFRMeRaA03S05 "Daily IFR Mean A03 S05 "
{txt}
{com}. label var DayIFRLoRaA03S05 "Daily IFR Lower A03 S05 "
{txt}
{com}. label var DayIFRUpRaA03S05 "Daily IFR Upper A03 S05 "
{txt}
{com}. label var DayIFRMeRaA03S06 "Daily IFR Mean A03 S06 "
{txt}
{com}. label var DayIFRLoRaA03S06 "Daily IFR Lower A03 S06 "
{txt}
{com}. label var DayIFRUpRaA03S06 "Daily IFR Upper A03 S06 "
{txt}
{com}. 
. 
. 
. 
. 
. * gen "Daily infections mean div by daily deaths mean IMPE DayCbD" for visulization of temporal relation of deaths and infections peaks 
. 
. 
. summ DayDeaMeRaA03S02 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~02 {c |}{res}        785      417.48    657.9311          0    2786.26
{txt}
{com}. gen DayDeMMeRaA03S02 = r(mean)
{txt}
{com}. label var DayDeMMeRaA03S02 "Daily deaths mean IMPE DayDeM"
{txt}
{com}. 
. summ DayINFMeRaA03S02 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayINFMeR~02 {c |}{res}        785    232752.4    412214.3        .14    1726528
{txt}
{com}. gen DayCaMMeRaA03S02 = r(mean)
{txt}
{com}. label var DayCaMMeRaA03S02 "Daily infections mean IMPE DayCaM"
{txt}
{com}.                            
. gen DayCbDMeRaA03S02 = DayCaMMeRaA03S02 / DayDeMMeRaA03S02
{txt}
{com}. label var DayCbDMeRaA03S02 "Daily infections mean div by daily deaths mean IMPE DayCbD"
{txt}
{com}. summ DayCbDMeRaA03S02

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~02 {c |}{res}        786    557.5175           0   557.5175   557.5175
{txt}
{com}.                                               
. gen DayDMuMeRaA03S02 = DayDeaMeRaA03S02 * DayCbDMeRaA03S02
{txt}(1 missing value generated)

{com}. label var DayDMuMeRaA03S02 "Daily deaths scaled (times means of infections by deaths) IMPE"
{txt}
{com}. summ DayDMuMeRaA03S02

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~02 {c |}{res}        785    232752.4    366808.1          0    1553389
{txt}
{com}. 
. 
. 
. 
. 
. sort date loc_grand_name
{txt}
{com}. 
. order date loc_grand_name
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "IMPE AFRO.dta", replace
{txt}file IMPE AFRO.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *****************************
. 
. * gen AMRO
. 
. use "IMPE.dta", clear
{txt}
{com}. 
. rename country loc_grand_name
{res}{txt}
{com}. 
. keep if ///
> loc_grand_name == "Antigua and Barbuda" | ///
> loc_grand_name == "Argentina" | ///
> loc_grand_name == "Aruba" | ///
> loc_grand_name == "Bahamas" | ///
> loc_grand_name == "Barbados" | ///
> loc_grand_name == "Belize" | ///
> loc_grand_name == "Bolivia" | ///
> loc_grand_name == "Brazil" | ///
> loc_grand_name == "Canada" | ///
> loc_grand_name == "Chile" | ///
> loc_grand_name == "Colombia" | ///
> loc_grand_name == "Costa Rica" | ///
> loc_grand_name == "Cuba" | ///
> loc_grand_name == "Curacao" | ///
> loc_grand_name == "Dominican Republic" | ///
> loc_grand_name == "Ecuador" | ///
> loc_grand_name == "El Salvador" | ///
> loc_grand_name == "French Guiana" | ///
> loc_grand_name == "Grenada" | ///
> loc_grand_name == "Guatemala" | ///
> loc_grand_name == "Guyana" | ///
> loc_grand_name == "Haiti" | ///
> loc_grand_name == "Honduras" | ///
> loc_grand_name == "Jamaica" | ///
> loc_grand_name == "Mexico" | ///
> loc_grand_name == "Nicaragua" | ///
> loc_grand_name == "Panama" | ///
> loc_grand_name == "Paraguay" | ///
> loc_grand_name == "Peru" | ///
> loc_grand_name == "St. Lucia" | ///
> loc_grand_name == "St. Vincent and the Grenadines" | ///
> loc_grand_name == "Suriname" | ///
> loc_grand_name == "Trinidad and Tobago" | ///
> loc_grand_name == "Uruguay" | ///
> loc_grand_name == "United States" | ///
> loc_grand_name == "Venezuela" 
{txt}(7,109,736 observations deleted)

{com}. 
. 
. 
. 
. collapse (sum) y_025 y_25 y_median y_mean y_75 y_975, by(date compartment scenario) 
{txt}
{com}. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. 
. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2)
{txt}
{com}. egen dateblock = concat(year month day)
{txt}
{com}. drop year month day
{txt}
{com}. 
. 
. * rename uncertainty limits
. 
. rename y_025    y_025_
{res}{txt}
{com}. rename y_25     y_250_
{res}{txt}
{com}. rename y_median y_med_
{res}{txt}
{com}. rename y_mean   y_mea_
{res}{txt}
{com}. rename y_75     y_750_
{res}{txt}
{com}. rename y_975    y_975_
{res}{txt}
{com}. 
. 
. foreach var of varlist y_025-y_975 {c -(}
{txt}  2{com}.         ds `var'
{txt}  3{com}.         label variable `var' `r(varlist)'
{txt}  4{com}. {c )-}
{txt}{col 1}y_025_
{col 1}y_250_
{col 1}y_med_
{col 1}y_mea_
{col 1}y_750_
{col 1}y_975_

{com}. *
. 
. 
. 
. * rename scenarios 
. 
. tab scenario 

                  {txt}scenario {c |}      Freq.     Percent        Cum.
{hline 27}{c +}{hline 35}
       Maintain Status Quo {c |}{res}      8,752       16.67       16.67
{txt}                Optimistic {c |}{res}      8,752       16.67       33.33
{txt}               Pessimistic {c |}{res}      8,752       16.67       50.00
{txt}Surged Maintain Status Quo {c |}{res}      8,752       16.67       66.67
{txt}         Surged Optimistic {c |}{res}      8,752       16.67       83.33
{txt}        Surged Pessimistic {c |}{res}      8,752       16.67      100.00
{txt}{hline 27}{c +}{hline 35}
                     Total {c |}{res}     52,512      100.00
{txt}
{com}. 
. 
. /*
> Scenarios:
> 
> S1  "Additional 50% Reduction"                  "S1_Add_Half_Reduction"
> S2  "Maintain Status Quo"                               "S2_Maintain_Staus_Quo"
> S3  "Relax Interventions 50%"                   "S3_Relax_Half_Intervention"
> 
> S4  "Surged Additional 50% Reduction"   "S4_Surged_Add_Half_Reduction"
> S5  "Surged Maintain Status Quo"                "S5_Surged_Maintain_Staus_Quo"
> S6  "Surged Relax Interventions 50%"    "S6_Surged_Relax_Half_Intervention"
> 
> With IMPE update 20211103 (2021-12-13_v9.csv.zip) released on 20211110., IMPE has new terms for their scenarios:
> 
> S1      Optimistic
> S2      Maintain Status Quo
> S3      Pessimistic
> 
> S4      Surged Optimistic
> S5      Surged Maintain Status Quo
> S6      Surged Pessimistic
> */
. 
. 
. gen scenario_snail = ""
{txt}(52,512 missing values generated)

{com}. replace scenario_snail = "S1" if scenario == "Optimistic"
{txt}variable {bf}scenario_snail{sf} was {bf}{res}str1{sf}{txt} now {bf}{res}str2{sf}
{txt}(8,752 real changes made)

{com}. replace scenario_snail = "S2" if scenario == "Maintain Status Quo"
{txt}(8,752 real changes made)

{com}. replace scenario_snail = "S3" if scenario == "Pessimistic"
{txt}(8,752 real changes made)

{com}. replace scenario_snail = "S4" if scenario == "Surged Optimistic"
{txt}(8,752 real changes made)

{com}. replace scenario_snail = "S5" if scenario == "Surged Maintain Status Quo"
{txt}(8,752 real changes made)

{com}. replace scenario_snail = "S6" if scenario == "Surged Pessimistic"
{txt}(8,752 real changes made)

{com}. 
. 
. gen underline = "_"
{txt}
{com}. egen scenario_snail_dateblock = concat(scenario_snail underline dateblock)
{txt}
{com}. 
. drop date_original scenario
{txt}
{com}. 
. drop scenario_snail_dateblock 
{txt}
{com}.   
. drop y_250_ y_med_ y_750_
{txt}
{com}.  
. 
. * Primary outcomes Total Deaths, Total infections, Daily Deaths, and Daily infections
. 
. replace compartment = "cumul_death" if compartment == "cumulative_deaths"
{txt}(4,770 real changes made)

{com}. replace compartment = "cumul_infec" if compartment == "cumulative_infections"
{txt}(4,770 real changes made)

{com}. replace compartment = "daily_death" if compartment == "deaths"
{txt}(4,770 real changes made)

{com}. replace compartment = "daily_infec" if compartment == "infections"
{txt}(4,770 real changes made)

{com}. 
. 
. * other outcomes
. 
. replace compartment = "icu___deman" if compartment == "ICU_demand"                      // Icd
{txt}(4,776 real changes made)

{com}. replace compartment = "icu___incid" if compartment == "ICU_incidence"           // Ici
{txt}(4,776 real changes made)

{com}. replace compartment = "reff_______" if compartment == "Reff"                            // Ref
{txt}(4,776 real changes made)

{com}. replace compartment = "rt_________" if compartment == "Rt"                                      // Rtt
{txt}(4,776 real changes made)

{com}. replace compartment = "hospi_deman" if compartment == "hospital_demand"         // Hod
{txt}(4,776 real changes made)

{com}. replace compartment = "hospi_incid" if compartment == "hospital_incidence"  // Hoi
{txt}(4,776 real changes made)

{com}. replace compartment = "preval_____" if compartment == "prevalence"                      // Pre
{txt}(4,776 real changes made)

{com}. 
. 
. 
. duplicates drop date compartment scenario, force

{p 0 4}{txt}Duplicates in terms of {res} dateblock compartment scenario_snail{p_end}

{txt}(0 observations are duplicates)

{com}. 
. * reshape
. 
. egen compartment_scenario_snail = concat(compartment underline scenario_snail)  
{txt}
{com}. 
. drop compartment underline scenario_snail
{txt}
{com}. 
. tab compartment_scenario_snail

{txt}compartment_sc {c |}
  enario_snail {c |}      Freq.     Percent        Cum.
{hline 15}{c +}{hline 35}
cumul_death_S1 {c |}{res}        795        1.51        1.51
{txt}cumul_death_S2 {c |}{res}        795        1.51        3.03
{txt}cumul_death_S3 {c |}{res}        795        1.51        4.54
{txt}cumul_death_S4 {c |}{res}        795        1.51        6.06
{txt}cumul_death_S5 {c |}{res}        795        1.51        7.57
{txt}cumul_death_S6 {c |}{res}        795        1.51        9.08
{txt}cumul_infec_S1 {c |}{res}        795        1.51       10.60
{txt}cumul_infec_S2 {c |}{res}        795        1.51       12.11
{txt}cumul_infec_S3 {c |}{res}        795        1.51       13.63
{txt}cumul_infec_S4 {c |}{res}        795        1.51       15.14
{txt}cumul_infec_S5 {c |}{res}        795        1.51       16.65
{txt}cumul_infec_S6 {c |}{res}        795        1.51       18.17
{txt}daily_death_S1 {c |}{res}        795        1.51       19.68
{txt}daily_death_S2 {c |}{res}        795        1.51       21.20
{txt}daily_death_S3 {c |}{res}        795        1.51       22.71
{txt}daily_death_S4 {c |}{res}        795        1.51       24.22
{txt}daily_death_S5 {c |}{res}        795        1.51       25.74
{txt}daily_death_S6 {c |}{res}        795        1.51       27.25
{txt}daily_infec_S1 {c |}{res}        795        1.51       28.76
{txt}daily_infec_S2 {c |}{res}        795        1.51       30.28
{txt}daily_infec_S3 {c |}{res}        795        1.51       31.79
{txt}daily_infec_S4 {c |}{res}        795        1.51       33.31
{txt}daily_infec_S5 {c |}{res}        795        1.51       34.82
{txt}daily_infec_S6 {c |}{res}        795        1.51       36.33
{txt}hospi_deman_S1 {c |}{res}        796        1.52       37.85
{txt}hospi_deman_S2 {c |}{res}        796        1.52       39.37
{txt}hospi_deman_S3 {c |}{res}        796        1.52       40.88
{txt}hospi_deman_S4 {c |}{res}        796        1.52       42.40
{txt}hospi_deman_S5 {c |}{res}        796        1.52       43.91
{txt}hospi_deman_S6 {c |}{res}        796        1.52       45.43
{txt}hospi_incid_S1 {c |}{res}        796        1.52       46.95
{txt}hospi_incid_S2 {c |}{res}        796        1.52       48.46
{txt}hospi_incid_S3 {c |}{res}        796        1.52       49.98
{txt}hospi_incid_S4 {c |}{res}        796        1.52       51.49
{txt}hospi_incid_S5 {c |}{res}        796        1.52       53.01
{txt}hospi_incid_S6 {c |}{res}        796        1.52       54.52
{txt}icu___deman_S1 {c |}{res}        796        1.52       56.04
{txt}icu___deman_S2 {c |}{res}        796        1.52       57.56
{txt}icu___deman_S3 {c |}{res}        796        1.52       59.07
{txt}icu___deman_S4 {c |}{res}        796        1.52       60.59
{txt}icu___deman_S5 {c |}{res}        796        1.52       62.10
{txt}icu___deman_S6 {c |}{res}        796        1.52       63.62
{txt}icu___incid_S1 {c |}{res}        796        1.52       65.14
{txt}icu___incid_S2 {c |}{res}        796        1.52       66.65
{txt}icu___incid_S3 {c |}{res}        796        1.52       68.17
{txt}icu___incid_S4 {c |}{res}        796        1.52       69.68
{txt}icu___incid_S5 {c |}{res}        796        1.52       71.20
{txt}icu___incid_S6 {c |}{res}        796        1.52       72.71
{txt}preval______S1 {c |}{res}        796        1.52       74.23
{txt}preval______S2 {c |}{res}        796        1.52       75.75
{txt}preval______S3 {c |}{res}        796        1.52       77.26
{txt}preval______S4 {c |}{res}        796        1.52       78.78
{txt}preval______S5 {c |}{res}        796        1.52       80.29
{txt}preval______S6 {c |}{res}        796        1.52       81.81
{txt}reff________S1 {c |}{res}        796        1.52       83.33
{txt}reff________S2 {c |}{res}        796        1.52       84.84
{txt}reff________S3 {c |}{res}        796        1.52       86.36
{txt}reff________S4 {c |}{res}        796        1.52       87.87
{txt}reff________S5 {c |}{res}        796        1.52       89.39
{txt}reff________S6 {c |}{res}        796        1.52       90.90
{txt}rt__________S1 {c |}{res}        796        1.52       92.42
{txt}rt__________S2 {c |}{res}        796        1.52       93.94
{txt}rt__________S3 {c |}{res}        796        1.52       95.45
{txt}rt__________S4 {c |}{res}        796        1.52       96.97
{txt}rt__________S5 {c |}{res}        796        1.52       98.48
{txt}rt__________S6 {c |}{res}        796        1.52      100.00
{txt}{hline 15}{c +}{hline 35}
         Total {c |}{res}     52,512      100.00
{txt}
{com}. 
. gen country = "AMRO"
{txt}
{com}. 
. reshape wide y_025_   y_mea_  y_975_, i(country dateblock) j(compartment_scenario_snail) string
{txt}(note: j = cumul_death_S1 cumul_death_S2 cumul_death_S3 cumul_death_S4 cumul_death_S5 cumul_death_S6 cumul_infec_S1 cumul_infec_S2 cumul_infec_S3 cumul_infec_S4 cumul_infec_S5 cumul_infec_S6 daily_death_S1 daily_death_S2 daily_death_S3 daily_death_S4 daily_death_S5 daily_death_S6 daily_infec_S1 daily_infec_S2 daily_infec_S3 daily_infec_S4 daily_infec_S5 daily_infec_S6 hospi_deman_S1 hospi_deman_S2 hospi_deman_S3 hospi_deman_S4 hospi_deman_S5 hospi_deman_S6 hospi_incid_S1 hospi_incid_S2 hospi_incid_S3 hospi_incid_S4 hospi_incid_S5 hospi_incid_S6 icu___deman_S1 icu___deman_S2 icu___deman_S3 icu___deman_S4 icu___deman_S5 icu___deman_S6 icu___incid_S1 icu___incid_S2 icu___incid_S3 icu___incid_S4 icu___incid_S5 icu___incid_S6 preval______S1 preval______S2 preval______S3 preval______S4 preval______S5 preval______S6 reff________S1 reff________S2 reff________S3 reff________S4 reff________S5 reff________S6 rt__________S1 rt__________S2 rt__________S3 rt__________S4 rt__________S5 rt__________S6)

Data{col 36}long{col 43}->{col 48}wide
{hline 77}
Number of obs.                 {res}   52512   {txt}->{res}     796
{txt}Number of variables            {res}       6   {txt}->{res}     200
{txt}j variable (66 values){res}compartment_scenario_snail{txt}->(dropped)
xij variables:
                                 {res}y_025_   {txt}->   {res}y_025_cumul_death_S1 y_025_cumul_death_S2 ... y_025_rt__________S6
                                 y_mea_   {txt}->   {res}y_mea_cumul_death_S1 y_mea_cumul_death_S2 ... y_mea_rt__________S6
                                 y_975_   {txt}->   {res}y_975_cumul_death_S1 y_975_cumul_death_S2 ... y_975_rt__________S6
{txt}{hline 77}

{com}. 
. 
. *
. 
. 
. 
. foreach v of varlist y_025_cumul_death_S1-y_975_rt__________S6 {c -(} 
{txt}  2{com}. 
.         local first = substr("`v'", 7, 11) 
{txt}  3{com}.         local second = substr("`v'", 6, 1)
{txt}  4{com}.         local third  = substr("`v'", 1, 5)
{txt}  5{com}.         local fourth = substr("`v'", 19, 2)
{txt}  6{com}.         label var `v' "`first'`second'`third'`second'`fourth'"
{txt}  7{com}. {c )-} 
{txt}
{com}. *
. 
. 
. 
. foreach v of varlist y_025_cumul_death_S1-y_975_rt__________S6 {c -(} 
{txt}  2{com}.         di `"`: var label `v''"' 
{txt}  3{com}.         local fifth `"`: var label `v''"'
{txt}  4{com}.         rename `v'   `fifth'
{txt}  5{com}. {c )-}
cumul_death_y_025_S1
{res}cumul_death_y_mea_S1
cumul_death_y_975_S1
cumul_death_y_025_S2
cumul_death_y_mea_S2
cumul_death_y_975_S2
cumul_death_y_025_S3
cumul_death_y_mea_S3
cumul_death_y_975_S3
cumul_death_y_025_S4
cumul_death_y_mea_S4
cumul_death_y_975_S4
cumul_death_y_025_S5
cumul_death_y_mea_S5
cumul_death_y_975_S5
cumul_death_y_025_S6
cumul_death_y_mea_S6
cumul_death_y_975_S6
cumul_infec_y_025_S1
cumul_infec_y_mea_S1
cumul_infec_y_975_S1
cumul_infec_y_025_S2
cumul_infec_y_mea_S2
cumul_infec_y_975_S2
cumul_infec_y_025_S3
cumul_infec_y_mea_S3
cumul_infec_y_975_S3
cumul_infec_y_025_S4
cumul_infec_y_mea_S4
cumul_infec_y_975_S4
cumul_infec_y_025_S5
cumul_infec_y_mea_S5
cumul_infec_y_975_S5
cumul_infec_y_025_S6
cumul_infec_y_mea_S6
cumul_infec_y_975_S6
daily_death_y_025_S1
daily_death_y_mea_S1
daily_death_y_975_S1
daily_death_y_025_S2
daily_death_y_mea_S2
daily_death_y_975_S2
daily_death_y_025_S3
daily_death_y_mea_S3
daily_death_y_975_S3
daily_death_y_025_S4
daily_death_y_mea_S4
daily_death_y_975_S4
daily_death_y_025_S5
daily_death_y_mea_S5
daily_death_y_975_S5
daily_death_y_025_S6
daily_death_y_mea_S6
daily_death_y_975_S6
daily_infec_y_025_S1
daily_infec_y_mea_S1
daily_infec_y_975_S1
daily_infec_y_025_S2
daily_infec_y_mea_S2
daily_infec_y_975_S2
daily_infec_y_025_S3
daily_infec_y_mea_S3
daily_infec_y_975_S3
daily_infec_y_025_S4
daily_infec_y_mea_S4
daily_infec_y_975_S4
daily_infec_y_025_S5
daily_infec_y_mea_S5
daily_infec_y_975_S5
daily_infec_y_025_S6
daily_infec_y_mea_S6
daily_infec_y_975_S6
hospi_deman_y_025_S1
hospi_deman_y_mea_S1
hospi_deman_y_975_S1
hospi_deman_y_025_S2
hospi_deman_y_mea_S2
hospi_deman_y_975_S2
hospi_deman_y_025_S3
hospi_deman_y_mea_S3
hospi_deman_y_975_S3
hospi_deman_y_025_S4
hospi_deman_y_mea_S4
hospi_deman_y_975_S4
hospi_deman_y_025_S5
hospi_deman_y_mea_S5
hospi_deman_y_975_S5
hospi_deman_y_025_S6
hospi_deman_y_mea_S6
hospi_deman_y_975_S6
hospi_incid_y_025_S1
hospi_incid_y_mea_S1
hospi_incid_y_975_S1
hospi_incid_y_025_S2
hospi_incid_y_mea_S2
hospi_incid_y_975_S2
hospi_incid_y_025_S3
hospi_incid_y_mea_S3
hospi_incid_y_975_S3
hospi_incid_y_025_S4
hospi_incid_y_mea_S4
hospi_incid_y_975_S4
hospi_incid_y_025_S5
hospi_incid_y_mea_S5
hospi_incid_y_975_S5
hospi_incid_y_025_S6
hospi_incid_y_mea_S6
hospi_incid_y_975_S6
icu___deman_y_025_S1
icu___deman_y_mea_S1
icu___deman_y_975_S1
icu___deman_y_025_S2
icu___deman_y_mea_S2
icu___deman_y_975_S2
icu___deman_y_025_S3
icu___deman_y_mea_S3
icu___deman_y_975_S3
icu___deman_y_025_S4
icu___deman_y_mea_S4
icu___deman_y_975_S4
icu___deman_y_025_S5
icu___deman_y_mea_S5
icu___deman_y_975_S5
icu___deman_y_025_S6
icu___deman_y_mea_S6
icu___deman_y_975_S6
icu___incid_y_025_S1
icu___incid_y_mea_S1
icu___incid_y_975_S1
icu___incid_y_025_S2
icu___incid_y_mea_S2
icu___incid_y_975_S2
icu___incid_y_025_S3
icu___incid_y_mea_S3
icu___incid_y_975_S3
icu___incid_y_025_S4
icu___incid_y_mea_S4
icu___incid_y_975_S4
icu___incid_y_025_S5
icu___incid_y_mea_S5
icu___incid_y_975_S5
icu___incid_y_025_S6
icu___incid_y_mea_S6
icu___incid_y_975_S6
preval______y_025_S1
preval______y_mea_S1
preval______y_975_S1
preval______y_025_S2
preval______y_mea_S2
preval______y_975_S2
preval______y_025_S3
preval______y_mea_S3
preval______y_975_S3
preval______y_025_S4
preval______y_mea_S4
preval______y_975_S4
preval______y_025_S5
preval______y_mea_S5
preval______y_975_S5
preval______y_025_S6
preval______y_mea_S6
preval______y_975_S6
reff________y_025_S1
reff________y_mea_S1
reff________y_975_S1
reff________y_025_S2
reff________y_mea_S2
reff________y_975_S2
reff________y_025_S3
reff________y_mea_S3
reff________y_975_S3
reff________y_025_S4
reff________y_mea_S4
reff________y_975_S4
reff________y_025_S5
reff________y_mea_S5
reff________y_975_S5
reff________y_025_S6
reff________y_mea_S6
reff________y_975_S6
rt__________y_025_S1
rt__________y_mea_S1
rt__________y_975_S1
rt__________y_025_S2
rt__________y_mea_S2
rt__________y_975_S2
rt__________y_025_S3
rt__________y_mea_S3
rt__________y_975_S3
rt__________y_025_S4
rt__________y_mea_S4
rt__________y_975_S4
rt__________y_025_S5
rt__________y_mea_S5
rt__________y_975_S5
rt__________y_025_S6
rt__________y_mea_S6
rt__________y_975_S6
{txt}
{com}. *
. 
. 
. * gen date
. 
. gen year = substr(dateblock,1,4) 
{txt}
{com}. gen month = substr(dateblock,5,2) 
{txt}
{com}. gen day = substr(dateblock,7,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21921{txt},{res}22716{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}07jan2020{txt},{res}12mar2022{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}796{col 51}{txt}missing .:  {res}0{txt}/{res}796

{txt}{col 19}mean:{res}{col 26} 22318.5{txt} = {res}07feb2021{txt} (+ 12 hours)
{col 15}std. dev:{res}{col 26}  229.93

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   22000{col 37} 22119.5{col 47} 22318.5{col 57} 22517.5{col 67}   22637
{col 26}26mar2020{col 36}23jul2020{col 46}07feb2021{col 56}25aug2021{col 66}23dec2021
{txt}
{com}. 
. 
. 
. * 
. 
. 
. * -renvars- somanyvars rather time consuming
. 
. foreach v of varlist cumul_death_y_025_S1-rt__________y_975_S6 {c -(} 
{txt}  2{com}. 
.     qui renvars, presub(cumul_death_y_025_ TotDeaLoRa)
{txt}  3{com}.     qui renvars, presub(cumul_death_y_975_ TotDeaUpRa)
{txt}  4{com}.     qui renvars, presub(cumul_death_y_mea_ TotDeaMeRa)
{txt}  5{com}. 
.         qui renvars, presub(daily_death_y_025_ DayDeaLoRa)
{txt}  6{com}.         qui renvars, presub(daily_death_y_975_ DayDeaUpRa)
{txt}  7{com}.         qui renvars, presub(daily_death_y_mea_ DayDeaMeRa)
{txt}  8{com}.         
.     qui renvars, presub(cumul_infec_y_025_ TotINFLoRa)
{txt}  9{com}.     qui renvars, presub(cumul_infec_y_975_ TotINFUpRa)
{txt} 10{com}.     qui renvars, presub(cumul_infec_y_mea_ TotINFMeRa)
{txt} 11{com}.         
.         qui renvars, presub(daily_infec_y_025_ DayINFLoRa)
{txt} 12{com}.         qui renvars, presub(daily_infec_y_975_ DayINFUpRa)
{txt} 13{com}.         qui renvars, presub(daily_infec_y_mea_ DayINFMeRa)
{txt} 14{com}.         
.         * other outcomes
.         
.         qui renvars, presub(icu___deman_y_025_ DayIcdLoRa) // "ICU_demand" 
{txt} 15{com}.         qui renvars, presub(icu___deman_y_975_ DayIcdUpRa)
{txt} 16{com}.         qui renvars, presub(icu___deman_y_mea_ DayIcdMeRa)
{txt} 17{com}.         
.         qui renvars, presub(icu___incid_y_025_ DayIciLoRa) // "ICU_incidence"
{txt} 18{com}.         qui renvars, presub(icu___incid_y_975_ DayIciUpRa)
{txt} 19{com}.         qui renvars, presub(icu___incid_y_mea_ DayIciMeRa)
{txt} 20{com}.         
.         qui renvars, presub(reff________y_025_ DayRefLoRa) // "Reff"
{txt} 21{com}.         qui renvars, presub(reff________y_975_ DayRefUpRa)
{txt} 22{com}.         qui renvars, presub(reff________y_mea_ DayRefMeRa)
{txt} 23{com}.         
.         qui renvars, presub(rt__________y_025_ DayRttLoRa) // "Rt"
{txt} 24{com}.         qui renvars, presub(rt__________y_975_ DayRttUpRa)
{txt} 25{com}.         qui renvars, presub(rt__________y_mea_ DayRttMeRa)
{txt} 26{com}.         
.         qui renvars, presub(hospi_deman_y_025_ DayHodLoRa) // "hospital_demand"
{txt} 27{com}.         qui renvars, presub(hospi_deman_y_975_ DayHodUpRa)
{txt} 28{com}.         qui renvars, presub(hospi_deman_y_mea_ DayHodMeRa)
{txt} 29{com}.         
.         qui renvars, presub(hospi_incid_y_025_ DayHoiLoRa) // "hospital_incidence"
{txt} 30{com}.         qui renvars, presub(hospi_incid_y_975_ DayHoiUpRa)
{txt} 31{com}.         qui renvars, presub(hospi_incid_y_mea_ DayHoiMeRa)
{txt} 32{com}.         
.         qui renvars, presub(preval______y_025_ DayPreLoRa) // "prevalence"
{txt} 33{com}.         qui renvars, presub(preval______y_975_ DayPreUpRa)
{txt} 34{com}.         qui renvars, presub(preval______y_mea_ DayPreMeRa)
{txt} 35{com}.         
.         qui renvars, postsub(S1 A03S01) 
{txt} 36{com}.         qui renvars, postsub(S2 A03S02) 
{txt} 37{com}.         qui renvars, postsub(S3 A03S03) 
{txt} 38{com}.         qui renvars, postsub(S4 A03S04) 
{txt} 39{com}.         qui renvars, postsub(S5 A03S05) 
{txt} 40{com}.         qui renvars, postsub(S6 A03S06) 
{txt} 41{com}.         
.         * "Wait Note: renvars are working ..."
.         
. {c )-} 
{txt}
{com}. *   
. 
. 
. 
. *
. 
. drop year month day date2 dateblock
{txt}
{com}. 
. order date  
{txt}
{com}. 
. label var DayINFLoRaA03S01 "Daily infections Lower A03 S01 "
{txt}
{com}. label var DayINFLoRaA03S02 "Daily infections Lower A03 S02 "
{txt}
{com}. label var DayINFLoRaA03S03 "Daily infections Lower A03 S03 "
{txt}
{com}. label var DayINFLoRaA03S04 "Daily infections Lower A03 S04 "
{txt}
{com}. label var DayINFLoRaA03S05 "Daily infections Lower A03 S05 "
{txt}
{com}. label var DayINFLoRaA03S06 "Daily infections Lower A03 S06 "
{txt}
{com}. label var DayINFMeRaA03S01 "Daily infections Mean A03 S01 "
{txt}
{com}. label var DayINFMeRaA03S02 "Daily infections Mean A03 S02 "
{txt}
{com}. label var DayINFMeRaA03S03 "Daily infections Mean A03 S03 "
{txt}
{com}. label var DayINFMeRaA03S04 "Daily infections Mean A03 S04 "
{txt}
{com}. label var DayINFMeRaA03S05 "Daily infections Mean A03 S05 "
{txt}
{com}. label var DayINFMeRaA03S06 "Daily infections Mean A03 S06 "
{txt}
{com}. label var DayINFUpRaA03S01 "Daily infections Upper A03 S01 "
{txt}
{com}. label var DayINFUpRaA03S02 "Daily infections Upper A03 S02 "
{txt}
{com}. label var DayINFUpRaA03S03 "Daily infections Upper A03 S03 "
{txt}
{com}. label var DayINFUpRaA03S04 "Daily infections Upper A03 S04 "
{txt}
{com}. label var DayINFUpRaA03S05 "Daily infections Upper A03 S05 "
{txt}
{com}. label var DayINFUpRaA03S06 "Daily infections Upper A03 S06 "
{txt}
{com}. label var DayDeaLoRaA03S01 "Daily Deaths Lower A03 S01 "
{txt}
{com}. label var DayDeaLoRaA03S02 "Daily Deaths Lower A03 S02 "
{txt}
{com}. label var DayDeaLoRaA03S03 "Daily Deaths Lower A03 S03 "
{txt}
{com}. label var DayDeaLoRaA03S04 "Daily Deaths Lower A03 S04 "
{txt}
{com}. label var DayDeaLoRaA03S05 "Daily Deaths Lower A03 S05 "
{txt}
{com}. label var DayDeaLoRaA03S06 "Daily Deaths Lower A03 S06 "
{txt}
{com}. label var DayDeaMeRaA03S01 "Daily Deaths Mean A03 S01 "
{txt}
{com}. label var DayDeaMeRaA03S02 "Daily Deaths Mean A03 S02 "
{txt}
{com}. label var DayDeaMeRaA03S03 "Daily Deaths Mean A03 S03 "
{txt}
{com}. label var DayDeaMeRaA03S04 "Daily Deaths Mean A03 S04 "
{txt}
{com}. label var DayDeaMeRaA03S05 "Daily Deaths Mean A03 S05 "
{txt}
{com}. label var DayDeaMeRaA03S06 "Daily Deaths Mean A03 S06 "
{txt}
{com}. label var DayDeaUpRaA03S01 "Daily Deaths Upper A03 S01 "
{txt}
{com}. label var DayDeaUpRaA03S02 "Daily Deaths Upper A03 S02 "
{txt}
{com}. label var DayDeaUpRaA03S03 "Daily Deaths Upper A03 S03 "
{txt}
{com}. label var DayDeaUpRaA03S04 "Daily Deaths Upper A03 S04 "
{txt}
{com}. label var DayDeaUpRaA03S05 "Daily Deaths Upper A03 S05 "
{txt}
{com}. label var DayDeaUpRaA03S06 "Daily Deaths Upper A03 S06 "
{txt}
{com}. label var TotINFLoRaA03S01 "Total infections Lower A03 S01 "
{txt}
{com}. label var TotINFLoRaA03S02 "Total infections Lower A03 S02 "
{txt}
{com}. label var TotINFLoRaA03S03 "Total infections Lower A03 S03 "
{txt}
{com}. label var TotINFLoRaA03S04 "Total infections Lower A03 S04 "
{txt}
{com}. label var TotINFLoRaA03S05 "Total infections Lower A03 S05 "
{txt}
{com}. label var TotINFLoRaA03S06 "Total infections Lower A03 S06 "
{txt}
{com}. label var TotINFMeRaA03S01 "Total infections Mean A03 S01 "
{txt}
{com}. label var TotINFMeRaA03S02 "Total infections Mean A03 S02 "
{txt}
{com}. label var TotINFMeRaA03S03 "Total infections Mean A03 S03 "
{txt}
{com}. label var TotINFMeRaA03S04 "Total infections Mean A03 S04 "
{txt}
{com}. label var TotINFMeRaA03S05 "Total infections Mean A03 S05 "
{txt}
{com}. label var TotINFMeRaA03S06 "Total infections Mean A03 S06 "
{txt}
{com}. label var TotINFUpRaA03S01 "Total infections Upper A03 S01 "
{txt}
{com}. label var TotINFUpRaA03S02 "Total infections Upper A03 S02 "
{txt}
{com}. label var TotINFUpRaA03S03 "Total infections Upper A03 S03 "
{txt}
{com}. label var TotINFUpRaA03S04 "Total infections Upper A03 S04 "
{txt}
{com}. label var TotINFUpRaA03S05 "Total infections Upper A03 S05 "
{txt}
{com}. label var TotINFUpRaA03S06 "Total infections Upper A03 S06 "
{txt}
{com}. label var TotDeaLoRaA03S01 "Total Deaths Lower A03 S01 "
{txt}
{com}. label var TotDeaLoRaA03S02 "Total Deaths Lower A03 S02 "
{txt}
{com}. label var TotDeaLoRaA03S03 "Total Deaths Lower A03 S03 "
{txt}
{com}. label var TotDeaLoRaA03S04 "Total Deaths Lower A03 S04 "
{txt}
{com}. label var TotDeaLoRaA03S05 "Total Deaths Lower A03 S05 "
{txt}
{com}. label var TotDeaLoRaA03S06 "Total Deaths Lower A03 S06 "
{txt}
{com}. label var TotDeaMeRaA03S01 "Total Deaths Mean A03 S01 "
{txt}
{com}. label var TotDeaMeRaA03S02 "Total Deaths Mean A03 S02 "
{txt}
{com}. label var TotDeaMeRaA03S03 "Total Deaths Mean A03 S03 "
{txt}
{com}. label var TotDeaMeRaA03S04 "Total Deaths Mean A03 S04 "
{txt}
{com}. label var TotDeaMeRaA03S05 "Total Deaths Mean A03 S05 "
{txt}
{com}. label var TotDeaMeRaA03S06 "Total Deaths Mean A03 S06 "
{txt}
{com}. label var TotDeaUpRaA03S01 "Total Deaths Upper A03 S01 "
{txt}
{com}. label var TotDeaUpRaA03S02 "Total Deaths Upper A03 S02 "
{txt}
{com}. label var TotDeaUpRaA03S03 "Total Deaths Upper A03 S03 "
{txt}
{com}. label var TotDeaUpRaA03S04 "Total Deaths Upper A03 S04 "
{txt}
{com}. label var TotDeaUpRaA03S05 "Total Deaths Upper A03 S05 "
{txt}
{com}. label var TotDeaUpRaA03S06 "Total Deaths Upper A03 S06 "
{txt}
{com}. 
. 
. * other outcomes
. 
. label var DayHodMeRaA03S01 "Daily hospital demand Mean A03 S01 "
{txt}
{com}. label var DayHodLoRaA03S01 "Daily hospital demand Lower A03 S01 "
{txt}
{com}. label var DayHodUpRaA03S01 "Daily hospital demand Upper A03 S01 "
{txt}
{com}. label var DayHodMeRaA03S02 "Daily hospital demand Mean A03 S02 "
{txt}
{com}. label var DayHodLoRaA03S02 "Daily hospital demand Lower A03 S02 "
{txt}
{com}. label var DayHodUpRaA03S02 "Daily hospital demand Upper A03 S02 "
{txt}
{com}. label var DayHodMeRaA03S03 "Daily hospital demand Mean A03 S03 "
{txt}
{com}. label var DayHodLoRaA03S03 "Daily hospital demand Lower A03 S03 "
{txt}
{com}. label var DayHodUpRaA03S03 "Daily hospital demand Upper A03 S03 "
{txt}
{com}. label var DayHodMeRaA03S04 "Daily hospital demand Mean A03 S04 "
{txt}
{com}. label var DayHodLoRaA03S04 "Daily hospital demand Lower A03 S04 "
{txt}
{com}. label var DayHodUpRaA03S04 "Daily hospital demand Upper A03 S04 " 
{txt}
{com}. label var DayHodMeRaA03S05 "Daily hospital demand Mean A03 S05 "
{txt}
{com}. label var DayHodLoRaA03S05 "Daily hospital demand Lower A03 S05 "
{txt}
{com}. label var DayHodUpRaA03S05 "Daily hospital demand Upper A03 S05 "
{txt}
{com}. label var DayHodMeRaA03S06 "Daily hospital demand Mean A03 S06 "
{txt}
{com}. label var DayHodLoRaA03S06 "Daily hospital demand Lower A03 S06 "
{txt}
{com}. label var DayHodUpRaA03S06 "Daily hospital demand Upper A03 S06 "
{txt}
{com}. 
. label var DayHoiMeRaA03S01 "Daily hospital incidence Mean A03 S01 "
{txt}
{com}. label var DayHoiLoRaA03S01 "Daily hospital incidence Lower A03 S01 "
{txt}
{com}. label var DayHoiUpRaA03S01 "Daily hospital incidence Upper A03 S01 "
{txt}
{com}. label var DayHoiMeRaA03S02 "Daily hospital incidence Mean A03 S02 "
{txt}
{com}. label var DayHoiLoRaA03S02 "Daily hospital incidence Lower A03 S02 "
{txt}
{com}. label var DayHoiUpRaA03S02 "Daily hospital incidence Upper A03 S02 "
{txt}
{com}. label var DayHoiMeRaA03S03 "Daily hospital incidence Mean A03 S03 "
{txt}
{com}. label var DayHoiLoRaA03S03 "Daily hospital incidence Lower A03 S03 "
{txt}
{com}. label var DayHoiUpRaA03S03 "Daily hospital incidence Upper A03 S03 "
{txt}
{com}. label var DayHoiMeRaA03S04 "Daily hospital incidence Mean A03 S04 "
{txt}
{com}. label var DayHoiLoRaA03S04 "Daily hospital incidence Lower A03 S04 "
{txt}
{com}. label var DayHoiUpRaA03S04 "Daily hospital incidence Upper A03 S04 "
{txt}
{com}. label var DayHoiMeRaA03S05 "Daily hospital incidence Mean A03 S05 "
{txt}
{com}. label var DayHoiLoRaA03S05 "Daily hospital incidence Lower A03 S05 "
{txt}
{com}. label var DayHoiUpRaA03S05 "Daily hospital incidence Upper A03 S05 "
{txt}
{com}. label var DayHoiMeRaA03S06 "Daily hospital incidence Mean A03 S06 "
{txt}
{com}. label var DayHoiLoRaA03S06 "Daily hospital incidence Lower A03 S06 "
{txt}
{com}. label var DayHoiUpRaA03S06 "Daily hospital incidence Upper A03 S06 "
{txt}
{com}. 
. label var DayIcdMeRaA03S01 "Daily ICU demand Mean A03 S01 "
{txt}
{com}. label var DayIcdLoRaA03S01 "Daily ICU demand Lower A03 S01 "
{txt}
{com}. label var DayIcdUpRaA03S01 "Daily ICU demand Upper A03 S01 "
{txt}
{com}. label var DayIcdMeRaA03S02 "Daily ICU demand Mean A03 S02 "
{txt}
{com}. label var DayIcdLoRaA03S02 "Daily ICU demand Lower A03 S02 "
{txt}
{com}. label var DayIcdUpRaA03S02 "Daily ICU demand Upper A03 S02 "
{txt}
{com}. label var DayIcdMeRaA03S03 "Daily ICU demand Mean A03 S03 "
{txt}
{com}. label var DayIcdLoRaA03S03 "Daily ICU demand Lower A03 S03 "
{txt}
{com}. label var DayIcdUpRaA03S03 "Daily ICU demand Upper A03 S03 "
{txt}
{com}. label var DayIcdMeRaA03S04 "Daily ICU demand Mean A03 S04 "
{txt}
{com}. label var DayIcdLoRaA03S04 "Daily ICU demand Lower A03 S04 "
{txt}
{com}. label var DayIcdUpRaA03S04 "Daily ICU demand Upper A03 S04 "
{txt}
{com}. label var DayIcdMeRaA03S05 "Daily ICU demand Mean A03 S05 "
{txt}
{com}. label var DayIcdLoRaA03S05 "Daily ICU demand Lower A03 S05 "
{txt}
{com}. label var DayIcdUpRaA03S05 "Daily ICU demand Upper A03 S05 "
{txt}
{com}. label var DayIcdMeRaA03S06 "Daily ICU demand Mean A03 S06 "
{txt}
{com}. label var DayIcdLoRaA03S06 "Daily ICU demand Lower A03 S06 "
{txt}
{com}. label var DayIcdUpRaA03S06 "Daily ICU demand Upper A03 S06 "
{txt}
{com}. 
. label var DayIciMeRaA03S01 "Daily ICU incidence Mean A03 S01 "
{txt}
{com}. label var DayIciLoRaA03S01 "Daily ICU incidence Lower A03 S01 "
{txt}
{com}. label var DayIciUpRaA03S01 "Daily ICU incidence Upper A03 S01 "
{txt}
{com}. label var DayIciMeRaA03S02 "Daily ICU incidence Mean A03 S02 "
{txt}
{com}. label var DayIciLoRaA03S02 "Daily ICU incidence Lower A03 S02 "
{txt}
{com}. label var DayIciUpRaA03S02 "Daily ICU incidence Upper A03 S02 "
{txt}
{com}. label var DayIciMeRaA03S03 "Daily ICU incidence Mean A03 S03 "
{txt}
{com}. label var DayIciLoRaA03S03 "Daily ICU incidence Lower A03 S03 "
{txt}
{com}. label var DayIciUpRaA03S03 "Daily ICU incidence Upper A03 S03 "
{txt}
{com}. label var DayIciMeRaA03S04 "Daily ICU incidence Mean A03 S04 "
{txt}
{com}. label var DayIciLoRaA03S04 "Daily ICU incidence Lower A03 S04 "
{txt}
{com}. label var DayIciUpRaA03S04 "Daily ICU incidence Upper A03 S04 "
{txt}
{com}. label var DayIciMeRaA03S05 "Daily ICU incidence Mean A03 S05 "
{txt}
{com}. label var DayIciLoRaA03S05 "Daily ICU incidence Lower A03 S05 "
{txt}
{com}. label var DayIciUpRaA03S05 "Daily ICU incidence Upper A03 S05 "
{txt}
{com}. label var DayIciMeRaA03S06 "Daily ICU incidence Mean A03 S06 "
{txt}
{com}. label var DayIciLoRaA03S06 "Daily ICU incidence Lower A03 S06 "
{txt}
{com}. label var DayIciUpRaA03S06 "Daily ICU incidence Upper A03 S06 "
{txt}
{com}. 
. label var DayPreMeRaA03S01 "Daily prevalence Mean A03 S01 "
{txt}
{com}. label var DayPreLoRaA03S01 "Daily prevalence Lower A03 S01 "
{txt}
{com}. label var DayPreUpRaA03S01 "Daily prevalence Upper A03 S01 "
{txt}
{com}. label var DayPreMeRaA03S02 "Daily prevalence Mean A03 S02 "
{txt}
{com}. label var DayPreLoRaA03S02 "Daily prevalence Lower A03 S02 "
{txt}
{com}. label var DayPreUpRaA03S02 "Daily prevalence Upper A03 S02 "
{txt}
{com}. label var DayPreMeRaA03S03 "Daily prevalence Mean A03 S03 "
{txt}
{com}. label var DayPreLoRaA03S03 "Daily prevalence Lower A03 S03 "
{txt}
{com}. label var DayPreUpRaA03S03 "Daily prevalence Upper A03 S03 "
{txt}
{com}. label var DayPreMeRaA03S04 "Daily prevalence Mean A03 S04 "
{txt}
{com}. label var DayPreLoRaA03S04 "Daily prevalence Lower A03 S04 "
{txt}
{com}. label var DayPreUpRaA03S04 "Daily prevalence Upper A03 S04 "
{txt}
{com}. label var DayPreMeRaA03S05 "Daily prevalence Mean A03 S05 "
{txt}
{com}. label var DayPreLoRaA03S05 "Daily prevalence Lower A03 S05 "
{txt}
{com}. label var DayPreUpRaA03S05 "Daily prevalence Upper A03 S05 "
{txt}
{com}. label var DayPreMeRaA03S06 "Daily prevalence Mean A03 S06 "
{txt}
{com}. label var DayPreLoRaA03S06 "Daily prevalence Lower A03 S06 "
{txt}
{com}. label var DayPreUpRaA03S06 "Daily prevalence Upper A03 S06 "
{txt}
{com}. 
. label var DayRefMeRaA03S01 "Daily R effective Mean A03 S01 "
{txt}
{com}. label var DayRefLoRaA03S01 "Daily R effective Lower A03 S01 "
{txt}
{com}. label var DayRefUpRaA03S01 "Daily R effective Upper A03 S01 "
{txt}
{com}. label var DayRefMeRaA03S02 "Daily R effective Mean A03 S02 "
{txt}
{com}. label var DayRefLoRaA03S02 "Daily R effective Lower A03 S02 "
{txt}
{com}. label var DayRefUpRaA03S02 "Daily R effective Upper A03 S02 "
{txt}
{com}. label var DayRefMeRaA03S03 "Daily R effective Mean A03 S03 "
{txt}
{com}. label var DayRefLoRaA03S03 "Daily R effective Lower A03 S03 "
{txt}
{com}. label var DayRefUpRaA03S03 "Daily R effective Upper A03 S03 "
{txt}
{com}. label var DayRefMeRaA03S04 "Daily R effective Mean A03 S04 "
{txt}
{com}. label var DayRefLoRaA03S04 "Daily R effective Lower A03 S04 "
{txt}
{com}. label var DayRefUpRaA03S04 "Daily R effective Upper A03 S04 "
{txt}
{com}. label var DayRefMeRaA03S05 "Daily R effective Mean A03 S05 "
{txt}
{com}. label var DayRefLoRaA03S05 "Daily R effective Lower A03 S05 "
{txt}
{com}. label var DayRefUpRaA03S05 "Daily R effective Upper A03 S05 "
{txt}
{com}. label var DayRefMeRaA03S06 "Daily R effective Mean A03 S06 "
{txt}
{com}. label var DayRefLoRaA03S06 "Daily R effective Lower A03 S06 "
{txt}
{com}. label var DayRefUpRaA03S06 "Daily R effective Upper A03 S06 "
{txt}
{com}. 
. label var DayRttMeRaA03S01 "Daily R t Mean A03 S01 "
{txt}
{com}. label var DayRttLoRaA03S01 "Daily R t Lower A03 S01 "
{txt}
{com}. label var DayRttUpRaA03S01 "Daily R t Upper A03 S01 "
{txt}
{com}. label var DayRttMeRaA03S02 "Daily R t Mean A03 S02 "
{txt}
{com}. label var DayRttLoRaA03S02 "Daily R t Lower A03 S02 "
{txt}
{com}. label var DayRttUpRaA03S02 "Daily R t Upper A03 S02 "
{txt}
{com}. label var DayRttMeRaA03S03 "Daily R t Mean A03 S03 "
{txt}
{com}. label var DayRttLoRaA03S03 "Daily R t Lower A03 S03 "
{txt}
{com}. label var DayRttUpRaA03S03 "Daily R t Upper A03 S03 "
{txt}
{com}. label var DayRttMeRaA03S04 "Daily R t Mean A03 S04 "
{txt}
{com}. label var DayRttLoRaA03S04 "Daily R t Lower A03 S04 "
{txt}
{com}. label var DayRttUpRaA03S04 "Daily R t Upper A03 S04 "
{txt}
{com}. label var DayRttMeRaA03S05 "Daily R t Mean A03 S05 "
{txt}
{com}. label var DayRttLoRaA03S05 "Daily R t Lower A03 S05 "
{txt}
{com}. label var DayRttUpRaA03S05 "Daily R t Upper A03 S05 "
{txt}
{com}. label var DayRttMeRaA03S06 "Daily R t Mean A03 S06 "
{txt}
{com}. label var DayRttLoRaA03S06 "Daily R t Lower A03 S06 "
{txt}
{com}. label var DayRttUpRaA03S06 "Daily R t Upper A03 S06 "
{txt}
{com}. 
. 
. rename country loc_grand_name
{res}{txt}
{com}. 
. 
. 
. order ///
> loc_grand_name date     ///
> TotDeaMeRaA03S01        TotDeaLoRaA03S01        TotDeaUpRaA03S01        ///
> TotDeaMeRaA03S02        TotDeaLoRaA03S02        TotDeaUpRaA03S02        ///
> TotDeaMeRaA03S03        TotDeaLoRaA03S03        TotDeaUpRaA03S03        ///
> TotDeaMeRaA03S04        TotDeaLoRaA03S04        TotDeaUpRaA03S04        ///
> TotDeaMeRaA03S05        TotDeaLoRaA03S05        TotDeaUpRaA03S05        ///
> TotDeaMeRaA03S06        TotDeaLoRaA03S06        TotDeaUpRaA03S06        ///
> DayDeaMeRaA03S01        DayDeaLoRaA03S01        DayDeaUpRaA03S01        ///
> DayDeaMeRaA03S02        DayDeaLoRaA03S02        DayDeaUpRaA03S02        ///
> DayDeaMeRaA03S03        DayDeaLoRaA03S03        DayDeaUpRaA03S03        ///
> DayDeaMeRaA03S04        DayDeaLoRaA03S04        DayDeaUpRaA03S04        ///
> DayDeaMeRaA03S05        DayDeaLoRaA03S05        DayDeaUpRaA03S05        ///
> DayDeaMeRaA03S06        DayDeaLoRaA03S06        DayDeaUpRaA03S06        ///
> TotINFMeRaA03S01        TotINFLoRaA03S01        TotINFUpRaA03S01        ///
> TotINFMeRaA03S02        TotINFLoRaA03S02        TotINFUpRaA03S02        ///
> TotINFMeRaA03S03        TotINFLoRaA03S03        TotINFUpRaA03S03        ///
> TotINFMeRaA03S04        TotINFLoRaA03S04        TotINFUpRaA03S04        ///
> TotINFMeRaA03S05        TotINFLoRaA03S05        TotINFUpRaA03S05        ///
> TotINFMeRaA03S06        TotINFLoRaA03S06        TotINFUpRaA03S06        ///
> DayINFMeRaA03S01        DayINFLoRaA03S01        DayINFUpRaA03S01        ///
> DayINFMeRaA03S02        DayINFLoRaA03S02        DayINFUpRaA03S02        ///
> DayINFMeRaA03S03        DayINFLoRaA03S03        DayINFUpRaA03S03        ///
> DayINFMeRaA03S04        DayINFLoRaA03S04        DayINFUpRaA03S04        ///
> DayINFMeRaA03S05        DayINFLoRaA03S05        DayINFUpRaA03S05        ///
> DayINFMeRaA03S06        DayINFLoRaA03S06        DayINFUpRaA03S06
{txt}
{com}. 
. 
.  *
.  
.  
. * gen IFR
. 
. gen DayIFRMeRaA03S01 = 100 * DayDeaMeRaA03S01 / DayINFMeRaA03S01 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S01 = 100 * DayDeaLoRaA03S01 / DayINFLoRaA03S01 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S01 = 100 * DayDeaUpRaA03S01 / DayINFUpRaA03S01 
{txt}(1 missing value generated)

{com}. gen DayIFRMeRaA03S02 = 100 * DayDeaMeRaA03S02 / DayINFMeRaA03S02 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S02 = 100 * DayDeaLoRaA03S02 / DayINFLoRaA03S02 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S02 = 100 * DayDeaUpRaA03S02 / DayINFUpRaA03S02 
{txt}(1 missing value generated)

{com}. gen DayIFRMeRaA03S03 = 100 * DayDeaMeRaA03S03 / DayINFMeRaA03S03 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S03 = 100 * DayDeaLoRaA03S03 / DayINFLoRaA03S03 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S03 = 100 * DayDeaUpRaA03S03 / DayINFUpRaA03S03 
{txt}(1 missing value generated)

{com}. gen DayIFRMeRaA03S04 = 100 * DayDeaMeRaA03S04 / DayINFMeRaA03S04 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S04 = 100 * DayDeaLoRaA03S04 / DayINFLoRaA03S04 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S04 = 100 * DayDeaUpRaA03S04 / DayINFUpRaA03S04 
{txt}(1 missing value generated)

{com}. gen DayIFRMeRaA03S05 = 100 * DayDeaMeRaA03S05 / DayINFMeRaA03S05 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S05 = 100 * DayDeaLoRaA03S05 / DayINFLoRaA03S05 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S05 = 100 * DayDeaUpRaA03S05 / DayINFUpRaA03S05 
{txt}(1 missing value generated)

{com}. gen DayIFRMeRaA03S06 = 100 * DayDeaMeRaA03S06 / DayINFMeRaA03S06 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S06 = 100 * DayDeaLoRaA03S06 / DayINFLoRaA03S06 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S06 = 100 * DayDeaUpRaA03S06 / DayINFUpRaA03S06 
{txt}(1 missing value generated)

{com}. 
. label var DayIFRMeRaA03S01 "Daily IFR Mean A03 S01 "
{txt}
{com}. label var DayIFRLoRaA03S01 "Daily IFR Lower A03 S01 "
{txt}
{com}. label var DayIFRUpRaA03S01 "Daily IFR Upper A03 S01 "
{txt}
{com}. label var DayIFRMeRaA03S02 "Daily IFR Mean A03 S02 "
{txt}
{com}. label var DayIFRLoRaA03S02 "Daily IFR Lower A03 S02 "
{txt}
{com}. label var DayIFRUpRaA03S02 "Daily IFR Upper A03 S02 "
{txt}
{com}. label var DayIFRMeRaA03S03 "Daily IFR Mean A03 S03 "
{txt}
{com}. label var DayIFRLoRaA03S03 "Daily IFR Lower A03 S03 "
{txt}
{com}. label var DayIFRUpRaA03S03 "Daily IFR Upper A03 S03 "
{txt}
{com}. label var DayIFRMeRaA03S04 "Daily IFR Mean A03 S04 "
{txt}
{com}. label var DayIFRLoRaA03S04 "Daily IFR Lower A03 S04 "
{txt}
{com}. label var DayIFRUpRaA03S04 "Daily IFR Upper A03 S04 "
{txt}
{com}. label var DayIFRMeRaA03S05 "Daily IFR Mean A03 S05 "
{txt}
{com}. label var DayIFRLoRaA03S05 "Daily IFR Lower A03 S05 "
{txt}
{com}. label var DayIFRUpRaA03S05 "Daily IFR Upper A03 S05 "
{txt}
{com}. label var DayIFRMeRaA03S06 "Daily IFR Mean A03 S06 "
{txt}
{com}. label var DayIFRLoRaA03S06 "Daily IFR Lower A03 S06 "
{txt}
{com}. label var DayIFRUpRaA03S06 "Daily IFR Upper A03 S06 "
{txt}
{com}. 
. 
. 
. 
. 
. * gen "Daily infections mean div by daily deaths mean IMPE DayCbD" for visulization of temporal relation of deaths and infections peaks 
. 
. 
. summ DayDeaMeRaA03S02 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~02 {c |}{res}        795    1845.332    1005.669          0    4960.72
{txt}
{com}. gen DayDeMMeRaA03S02 = r(mean)
{txt}
{com}. label var DayDeMMeRaA03S02 "Daily deaths mean IMPE DayDeM"
{txt}
{com}. 
. summ DayINFMeRaA03S02 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayINFMeR~02 {c |}{res}        795      536937      259202        .15    1278622
{txt}
{com}. gen DayCaMMeRaA03S02 = r(mean)
{txt}
{com}. label var DayCaMMeRaA03S02 "Daily infections mean IMPE DayCaM"
{txt}
{com}.                            
. gen DayCbDMeRaA03S02 = DayCaMMeRaA03S02 / DayDeMMeRaA03S02
{txt}
{com}. label var DayCbDMeRaA03S02 "Daily infections mean div by daily deaths mean IMPE DayCbD"
{txt}
{com}. summ DayCbDMeRaA03S02

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~02 {c |}{res}        796    290.9704           0   290.9704   290.9704
{txt}
{com}.                                               
. gen DayDMuMeRaA03S02 = DayDeaMeRaA03S02 * DayCbDMeRaA03S02
{txt}(1 missing value generated)

{com}. label var DayDMuMeRaA03S02 "Daily deaths scaled (times means of infections by deaths) IMPE"
{txt}
{com}. summ DayDMuMeRaA03S02

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~02 {c |}{res}        795      536937    292619.9          0    1443423
{txt}
{com}. 
. 
. 
. 
. 
. sort date loc_grand_name
{txt}
{com}. 
. order date loc_grand_name
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "IMPE AMRO.dta", replace
{txt}file IMPE AMRO.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *****************************
. 
. * gen EMRO
. 
. use "IMPE.dta", clear
{txt}
{com}. 
. rename country loc_grand_name
{res}{txt}
{com}. 
. keep if ///
> loc_grand_name == "Afghanistan" | ///
> loc_grand_name == "Bahrain" | ///
> loc_grand_name == "Djibouti" | ///
> loc_grand_name == "Egypt" | ///
> loc_grand_name == "Iran" | ///
> loc_grand_name == "Iraq" | ///
> loc_grand_name == "Jordan" | ///
> loc_grand_name == "Kuwait" | ///
> loc_grand_name == "Lebanon" | ///
> loc_grand_name == "Libya" | ///
> loc_grand_name == "Morocco" | ///
> loc_grand_name == "Oman" | ///
> loc_grand_name == "Pakistan" | ///
> loc_grand_name == "Qatar" | ///
> loc_grand_name == "Saudi Arabia" | ///
> loc_grand_name == "Somalia" | ///
> loc_grand_name == "State of Palestine" | ///
> loc_grand_name == "Sudan" | ///
> loc_grand_name == "Syria" | ///
> loc_grand_name == "Tunisia" | ///
> loc_grand_name == "United Arab Emirates" | ///
> loc_grand_name == "Yemen" 
{txt}(7,529,934 observations deleted)

{com}. 
. 
. 
. 
. 
. collapse (sum) y_025 y_25 y_median y_mean y_75 y_975, by(date compartment scenario) 
{txt}
{com}. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. 
. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2)
{txt}
{com}. egen dateblock = concat(year month day)
{txt}
{com}. drop year month day
{txt}
{com}. 
. 
. * rename uncertainty limits
. 
. rename y_025    y_025_
{res}{txt}
{com}. rename y_25     y_250_
{res}{txt}
{com}. rename y_median y_med_
{res}{txt}
{com}. rename y_mean   y_mea_
{res}{txt}
{com}. rename y_75     y_750_
{res}{txt}
{com}. rename y_975    y_975_
{res}{txt}
{com}. 
. 
. foreach var of varlist y_025-y_975 {c -(}
{txt}  2{com}.         ds `var'
{txt}  3{com}.         label variable `var' `r(varlist)'
{txt}  4{com}. {c )-}
{txt}{col 1}y_025_
{col 1}y_250_
{col 1}y_med_
{col 1}y_mea_
{col 1}y_750_
{col 1}y_975_

{com}. *
. 
. 
. 
. * rename scenarios 
. 
. tab scenario 

                  {txt}scenario {c |}      Freq.     Percent        Cum.
{hline 27}{c +}{hline 35}
       Maintain Status Quo {c |}{res}      8,895       16.67       16.67
{txt}                Optimistic {c |}{res}      8,895       16.67       33.33
{txt}               Pessimistic {c |}{res}      8,895       16.67       50.00
{txt}Surged Maintain Status Quo {c |}{res}      8,895       16.67       66.67
{txt}         Surged Optimistic {c |}{res}      8,895       16.67       83.33
{txt}        Surged Pessimistic {c |}{res}      8,895       16.67      100.00
{txt}{hline 27}{c +}{hline 35}
                     Total {c |}{res}     53,370      100.00
{txt}
{com}. 
. 
. /*
> Scenarios:
> 
> S1  "Additional 50% Reduction"                  "S1_Add_Half_Reduction"
> S2  "Maintain Status Quo"                               "S2_Maintain_Staus_Quo"
> S3  "Relax Interventions 50%"                   "S3_Relax_Half_Intervention"
> 
> S4  "Surged Additional 50% Reduction"   "S4_Surged_Add_Half_Reduction"
> S5  "Surged Maintain Status Quo"                "S5_Surged_Maintain_Staus_Quo"
> S6  "Surged Relax Interventions 50%"    "S6_Surged_Relax_Half_Intervention"
> 
> With IMPE update 20211103 (2021-12-13_v9.csv.zip) released on 20211110., IMPE has new terms for their scenarios:
> 
> S1      Optimistic
> S2      Maintain Status Quo
> S3      Pessimistic
> 
> S4      Surged Optimistic
> S5      Surged Maintain Status Quo
> S6      Surged Pessimistic
> */
. 
. 
. gen scenario_snail = ""
{txt}(53,370 missing values generated)

{com}. replace scenario_snail = "S1" if scenario == "Optimistic"
{txt}variable {bf}scenario_snail{sf} was {bf}{res}str1{sf}{txt} now {bf}{res}str2{sf}
{txt}(8,895 real changes made)

{com}. replace scenario_snail = "S2" if scenario == "Maintain Status Quo"
{txt}(8,895 real changes made)

{com}. replace scenario_snail = "S3" if scenario == "Pessimistic"
{txt}(8,895 real changes made)

{com}. replace scenario_snail = "S4" if scenario == "Surged Optimistic"
{txt}(8,895 real changes made)

{com}. replace scenario_snail = "S5" if scenario == "Surged Maintain Status Quo"
{txt}(8,895 real changes made)

{com}. replace scenario_snail = "S6" if scenario == "Surged Pessimistic"
{txt}(8,895 real changes made)

{com}. 
. 
. gen underline = "_"
{txt}
{com}. egen scenario_snail_dateblock = concat(scenario_snail underline dateblock)
{txt}
{com}. 
. drop date_original scenario
{txt}
{com}. 
. drop scenario_snail_dateblock 
{txt}
{com}.   
. drop y_250_ y_med_ y_750_
{txt}
{com}.  
. 
. * Primary outcomes Total Deaths, Total infections, Daily Deaths, and Daily infections
. 
. replace compartment = "cumul_death" if compartment == "cumulative_deaths"
{txt}(4,848 real changes made)

{com}. replace compartment = "cumul_infec" if compartment == "cumulative_infections"
{txt}(4,848 real changes made)

{com}. replace compartment = "daily_death" if compartment == "deaths"
{txt}(4,848 real changes made)

{com}. replace compartment = "daily_infec" if compartment == "infections"
{txt}(4,848 real changes made)

{com}. 
. 
. * other outcomes
. 
. replace compartment = "icu___deman" if compartment == "ICU_demand"                      // Icd
{txt}(4,854 real changes made)

{com}. replace compartment = "icu___incid" if compartment == "ICU_incidence"           // Ici
{txt}(4,854 real changes made)

{com}. replace compartment = "reff_______" if compartment == "Reff"                            // Ref
{txt}(4,854 real changes made)

{com}. replace compartment = "rt_________" if compartment == "Rt"                                      // Rtt
{txt}(4,854 real changes made)

{com}. replace compartment = "hospi_deman" if compartment == "hospital_demand"         // Hod
{txt}(4,854 real changes made)

{com}. replace compartment = "hospi_incid" if compartment == "hospital_incidence"  // Hoi
{txt}(4,854 real changes made)

{com}. replace compartment = "preval_____" if compartment == "prevalence"                      // Pre
{txt}(4,854 real changes made)

{com}. 
. 
. 
. duplicates drop date compartment scenario, force

{p 0 4}{txt}Duplicates in terms of {res} dateblock compartment scenario_snail{p_end}

{txt}(0 observations are duplicates)

{com}. 
. * reshape
. 
. egen compartment_scenario_snail = concat(compartment underline scenario_snail)  
{txt}
{com}. 
. drop compartment underline scenario_snail
{txt}
{com}. 
. tab compartment_scenario_snail

{txt}compartment_sc {c |}
  enario_snail {c |}      Freq.     Percent        Cum.
{hline 15}{c +}{hline 35}
cumul_death_S1 {c |}{res}        808        1.51        1.51
{txt}cumul_death_S2 {c |}{res}        808        1.51        3.03
{txt}cumul_death_S3 {c |}{res}        808        1.51        4.54
{txt}cumul_death_S4 {c |}{res}        808        1.51        6.06
{txt}cumul_death_S5 {c |}{res}        808        1.51        7.57
{txt}cumul_death_S6 {c |}{res}        808        1.51        9.08
{txt}cumul_infec_S1 {c |}{res}        808        1.51       10.60
{txt}cumul_infec_S2 {c |}{res}        808        1.51       12.11
{txt}cumul_infec_S3 {c |}{res}        808        1.51       13.63
{txt}cumul_infec_S4 {c |}{res}        808        1.51       15.14
{txt}cumul_infec_S5 {c |}{res}        808        1.51       16.65
{txt}cumul_infec_S6 {c |}{res}        808        1.51       18.17
{txt}daily_death_S1 {c |}{res}        808        1.51       19.68
{txt}daily_death_S2 {c |}{res}        808        1.51       21.20
{txt}daily_death_S3 {c |}{res}        808        1.51       22.71
{txt}daily_death_S4 {c |}{res}        808        1.51       24.22
{txt}daily_death_S5 {c |}{res}        808        1.51       25.74
{txt}daily_death_S6 {c |}{res}        808        1.51       27.25
{txt}daily_infec_S1 {c |}{res}        808        1.51       28.77
{txt}daily_infec_S2 {c |}{res}        808        1.51       30.28
{txt}daily_infec_S3 {c |}{res}        808        1.51       31.79
{txt}daily_infec_S4 {c |}{res}        808        1.51       33.31
{txt}daily_infec_S5 {c |}{res}        808        1.51       34.82
{txt}daily_infec_S6 {c |}{res}        808        1.51       36.34
{txt}hospi_deman_S1 {c |}{res}        809        1.52       37.85
{txt}hospi_deman_S2 {c |}{res}        809        1.52       39.37
{txt}hospi_deman_S3 {c |}{res}        809        1.52       40.88
{txt}hospi_deman_S4 {c |}{res}        809        1.52       42.40
{txt}hospi_deman_S5 {c |}{res}        809        1.52       43.91
{txt}hospi_deman_S6 {c |}{res}        809        1.52       45.43
{txt}hospi_incid_S1 {c |}{res}        809        1.52       46.95
{txt}hospi_incid_S2 {c |}{res}        809        1.52       48.46
{txt}hospi_incid_S3 {c |}{res}        809        1.52       49.98
{txt}hospi_incid_S4 {c |}{res}        809        1.52       51.49
{txt}hospi_incid_S5 {c |}{res}        809        1.52       53.01
{txt}hospi_incid_S6 {c |}{res}        809        1.52       54.53
{txt}icu___deman_S1 {c |}{res}        809        1.52       56.04
{txt}icu___deman_S2 {c |}{res}        809        1.52       57.56
{txt}icu___deman_S3 {c |}{res}        809        1.52       59.07
{txt}icu___deman_S4 {c |}{res}        809        1.52       60.59
{txt}icu___deman_S5 {c |}{res}        809        1.52       62.10
{txt}icu___deman_S6 {c |}{res}        809        1.52       63.62
{txt}icu___incid_S1 {c |}{res}        809        1.52       65.14
{txt}icu___incid_S2 {c |}{res}        809        1.52       66.65
{txt}icu___incid_S3 {c |}{res}        809        1.52       68.17
{txt}icu___incid_S4 {c |}{res}        809        1.52       69.68
{txt}icu___incid_S5 {c |}{res}        809        1.52       71.20
{txt}icu___incid_S6 {c |}{res}        809        1.52       72.72
{txt}preval______S1 {c |}{res}        809        1.52       74.23
{txt}preval______S2 {c |}{res}        809        1.52       75.75
{txt}preval______S3 {c |}{res}        809        1.52       77.26
{txt}preval______S4 {c |}{res}        809        1.52       78.78
{txt}preval______S5 {c |}{res}        809        1.52       80.29
{txt}preval______S6 {c |}{res}        809        1.52       81.81
{txt}reff________S1 {c |}{res}        809        1.52       83.33
{txt}reff________S2 {c |}{res}        809        1.52       84.84
{txt}reff________S3 {c |}{res}        809        1.52       86.36
{txt}reff________S4 {c |}{res}        809        1.52       87.87
{txt}reff________S5 {c |}{res}        809        1.52       89.39
{txt}reff________S6 {c |}{res}        809        1.52       90.91
{txt}rt__________S1 {c |}{res}        809        1.52       92.42
{txt}rt__________S2 {c |}{res}        809        1.52       93.94
{txt}rt__________S3 {c |}{res}        809        1.52       95.45
{txt}rt__________S4 {c |}{res}        809        1.52       96.97
{txt}rt__________S5 {c |}{res}        809        1.52       98.48
{txt}rt__________S6 {c |}{res}        809        1.52      100.00
{txt}{hline 15}{c +}{hline 35}
         Total {c |}{res}     53,370      100.00
{txt}
{com}. 
. gen country = "EMRO"
{txt}
{com}. 
. reshape wide y_025_   y_mea_  y_975_, i(country dateblock) j(compartment_scenario_snail) string
{txt}(note: j = cumul_death_S1 cumul_death_S2 cumul_death_S3 cumul_death_S4 cumul_death_S5 cumul_death_S6 cumul_infec_S1 cumul_infec_S2 cumul_infec_S3 cumul_infec_S4 cumul_infec_S5 cumul_infec_S6 daily_death_S1 daily_death_S2 daily_death_S3 daily_death_S4 daily_death_S5 daily_death_S6 daily_infec_S1 daily_infec_S2 daily_infec_S3 daily_infec_S4 daily_infec_S5 daily_infec_S6 hospi_deman_S1 hospi_deman_S2 hospi_deman_S3 hospi_deman_S4 hospi_deman_S5 hospi_deman_S6 hospi_incid_S1 hospi_incid_S2 hospi_incid_S3 hospi_incid_S4 hospi_incid_S5 hospi_incid_S6 icu___deman_S1 icu___deman_S2 icu___deman_S3 icu___deman_S4 icu___deman_S5 icu___deman_S6 icu___incid_S1 icu___incid_S2 icu___incid_S3 icu___incid_S4 icu___incid_S5 icu___incid_S6 preval______S1 preval______S2 preval______S3 preval______S4 preval______S5 preval______S6 reff________S1 reff________S2 reff________S3 reff________S4 reff________S5 reff________S6 rt__________S1 rt__________S2 rt__________S3 rt__________S4 rt__________S5 rt__________S6)

Data{col 36}long{col 43}->{col 48}wide
{hline 77}
Number of obs.                 {res}   53370   {txt}->{res}     809
{txt}Number of variables            {res}       6   {txt}->{res}     200
{txt}j variable (66 values){res}compartment_scenario_snail{txt}->(dropped)
xij variables:
                                 {res}y_025_   {txt}->   {res}y_025_cumul_death_S1 y_025_cumul_death_S2 ... y_025_rt__________S6
                                 y_mea_   {txt}->   {res}y_mea_cumul_death_S1 y_mea_cumul_death_S2 ... y_mea_rt__________S6
                                 y_975_   {txt}->   {res}y_975_cumul_death_S1 y_975_cumul_death_S2 ... y_975_rt__________S6
{txt}{hline 77}

{com}. 
. 
. *
. 
. 
. 
. foreach v of varlist y_025_cumul_death_S1-y_975_rt__________S6 {c -(} 
{txt}  2{com}. 
.         local first = substr("`v'", 7, 11) 
{txt}  3{com}.         local second = substr("`v'", 6, 1)
{txt}  4{com}.         local third  = substr("`v'", 1, 5)
{txt}  5{com}.         local fourth = substr("`v'", 19, 2)
{txt}  6{com}.         label var `v' "`first'`second'`third'`second'`fourth'"
{txt}  7{com}. {c )-} 
{txt}
{com}. *
. 
. 
. 
. foreach v of varlist y_025_cumul_death_S1-y_975_rt__________S6 {c -(} 
{txt}  2{com}.         di `"`: var label `v''"' 
{txt}  3{com}.         local fifth `"`: var label `v''"'
{txt}  4{com}.         rename `v'   `fifth'
{txt}  5{com}. {c )-}
cumul_death_y_025_S1
{res}cumul_death_y_mea_S1
cumul_death_y_975_S1
cumul_death_y_025_S2
cumul_death_y_mea_S2
cumul_death_y_975_S2
cumul_death_y_025_S3
cumul_death_y_mea_S3
cumul_death_y_975_S3
cumul_death_y_025_S4
cumul_death_y_mea_S4
cumul_death_y_975_S4
cumul_death_y_025_S5
cumul_death_y_mea_S5
cumul_death_y_975_S5
cumul_death_y_025_S6
cumul_death_y_mea_S6
cumul_death_y_975_S6
cumul_infec_y_025_S1
cumul_infec_y_mea_S1
cumul_infec_y_975_S1
cumul_infec_y_025_S2
cumul_infec_y_mea_S2
cumul_infec_y_975_S2
cumul_infec_y_025_S3
cumul_infec_y_mea_S3
cumul_infec_y_975_S3
cumul_infec_y_025_S4
cumul_infec_y_mea_S4
cumul_infec_y_975_S4
cumul_infec_y_025_S5
cumul_infec_y_mea_S5
cumul_infec_y_975_S5
cumul_infec_y_025_S6
cumul_infec_y_mea_S6
cumul_infec_y_975_S6
daily_death_y_025_S1
daily_death_y_mea_S1
daily_death_y_975_S1
daily_death_y_025_S2
daily_death_y_mea_S2
daily_death_y_975_S2
daily_death_y_025_S3
daily_death_y_mea_S3
daily_death_y_975_S3
daily_death_y_025_S4
daily_death_y_mea_S4
daily_death_y_975_S4
daily_death_y_025_S5
daily_death_y_mea_S5
daily_death_y_975_S5
daily_death_y_025_S6
daily_death_y_mea_S6
daily_death_y_975_S6
daily_infec_y_025_S1
daily_infec_y_mea_S1
daily_infec_y_975_S1
daily_infec_y_025_S2
daily_infec_y_mea_S2
daily_infec_y_975_S2
daily_infec_y_025_S3
daily_infec_y_mea_S3
daily_infec_y_975_S3
daily_infec_y_025_S4
daily_infec_y_mea_S4
daily_infec_y_975_S4
daily_infec_y_025_S5
daily_infec_y_mea_S5
daily_infec_y_975_S5
daily_infec_y_025_S6
daily_infec_y_mea_S6
daily_infec_y_975_S6
hospi_deman_y_025_S1
hospi_deman_y_mea_S1
hospi_deman_y_975_S1
hospi_deman_y_025_S2
hospi_deman_y_mea_S2
hospi_deman_y_975_S2
hospi_deman_y_025_S3
hospi_deman_y_mea_S3
hospi_deman_y_975_S3
hospi_deman_y_025_S4
hospi_deman_y_mea_S4
hospi_deman_y_975_S4
hospi_deman_y_025_S5
hospi_deman_y_mea_S5
hospi_deman_y_975_S5
hospi_deman_y_025_S6
hospi_deman_y_mea_S6
hospi_deman_y_975_S6
hospi_incid_y_025_S1
hospi_incid_y_mea_S1
hospi_incid_y_975_S1
hospi_incid_y_025_S2
hospi_incid_y_mea_S2
hospi_incid_y_975_S2
hospi_incid_y_025_S3
hospi_incid_y_mea_S3
hospi_incid_y_975_S3
hospi_incid_y_025_S4
hospi_incid_y_mea_S4
hospi_incid_y_975_S4
hospi_incid_y_025_S5
hospi_incid_y_mea_S5
hospi_incid_y_975_S5
hospi_incid_y_025_S6
hospi_incid_y_mea_S6
hospi_incid_y_975_S6
icu___deman_y_025_S1
icu___deman_y_mea_S1
icu___deman_y_975_S1
icu___deman_y_025_S2
icu___deman_y_mea_S2
icu___deman_y_975_S2
icu___deman_y_025_S3
icu___deman_y_mea_S3
icu___deman_y_975_S3
icu___deman_y_025_S4
icu___deman_y_mea_S4
icu___deman_y_975_S4
icu___deman_y_025_S5
icu___deman_y_mea_S5
icu___deman_y_975_S5
icu___deman_y_025_S6
icu___deman_y_mea_S6
icu___deman_y_975_S6
icu___incid_y_025_S1
icu___incid_y_mea_S1
icu___incid_y_975_S1
icu___incid_y_025_S2
icu___incid_y_mea_S2
icu___incid_y_975_S2
icu___incid_y_025_S3
icu___incid_y_mea_S3
icu___incid_y_975_S3
icu___incid_y_025_S4
icu___incid_y_mea_S4
icu___incid_y_975_S4
icu___incid_y_025_S5
icu___incid_y_mea_S5
icu___incid_y_975_S5
icu___incid_y_025_S6
icu___incid_y_mea_S6
icu___incid_y_975_S6
preval______y_025_S1
preval______y_mea_S1
preval______y_975_S1
preval______y_025_S2
preval______y_mea_S2
preval______y_975_S2
preval______y_025_S3
preval______y_mea_S3
preval______y_975_S3
preval______y_025_S4
preval______y_mea_S4
preval______y_975_S4
preval______y_025_S5
preval______y_mea_S5
preval______y_975_S5
preval______y_025_S6
preval______y_mea_S6
preval______y_975_S6
reff________y_025_S1
reff________y_mea_S1
reff________y_975_S1
reff________y_025_S2
reff________y_mea_S2
reff________y_975_S2
reff________y_025_S3
reff________y_mea_S3
reff________y_975_S3
reff________y_025_S4
reff________y_mea_S4
reff________y_975_S4
reff________y_025_S5
reff________y_mea_S5
reff________y_975_S5
reff________y_025_S6
reff________y_mea_S6
reff________y_975_S6
rt__________y_025_S1
rt__________y_mea_S1
rt__________y_975_S1
rt__________y_025_S2
rt__________y_mea_S2
rt__________y_975_S2
rt__________y_025_S3
rt__________y_mea_S3
rt__________y_975_S3
rt__________y_025_S4
rt__________y_mea_S4
rt__________y_975_S4
rt__________y_025_S5
rt__________y_mea_S5
rt__________y_975_S5
rt__________y_025_S6
rt__________y_mea_S6
rt__________y_975_S6
{txt}
{com}. *
. 
. 
. * gen date
. 
. gen year = substr(dateblock,1,4) 
{txt}
{com}. gen month = substr(dateblock,5,2) 
{txt}
{com}. gen day = substr(dateblock,7,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21908{txt},{res}22716{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}25dec2019{txt},{res}12mar2022{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}809{col 51}{txt}missing .:  {res}0{txt}/{res}809

{txt}{col 19}mean:{res}{col 26}   22312{txt} = {res}01feb2021{txt}
{col 15}std. dev:{res}{col 26} 233.682

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21988{col 37}   22110{col 47}   22312{col 57}   22514{col 67}   22636
{col 26}14mar2020{col 36}14jul2020{col 46}01feb2021{col 56}22aug2021{col 66}22dec2021
{txt}
{com}. 
. 
. 
. * 
. 
. 
. * -renvars- somanyvars rather time consuming
. 
. foreach v of varlist cumul_death_y_025_S1-rt__________y_975_S6 {c -(} 
{txt}  2{com}. 
.     qui renvars, presub(cumul_death_y_025_ TotDeaLoRa)
{txt}  3{com}.     qui renvars, presub(cumul_death_y_975_ TotDeaUpRa)
{txt}  4{com}.     qui renvars, presub(cumul_death_y_mea_ TotDeaMeRa)
{txt}  5{com}. 
.         qui renvars, presub(daily_death_y_025_ DayDeaLoRa)
{txt}  6{com}.         qui renvars, presub(daily_death_y_975_ DayDeaUpRa)
{txt}  7{com}.         qui renvars, presub(daily_death_y_mea_ DayDeaMeRa)
{txt}  8{com}.         
.     qui renvars, presub(cumul_infec_y_025_ TotINFLoRa)
{txt}  9{com}.     qui renvars, presub(cumul_infec_y_975_ TotINFUpRa)
{txt} 10{com}.     qui renvars, presub(cumul_infec_y_mea_ TotINFMeRa)
{txt} 11{com}.         
.         qui renvars, presub(daily_infec_y_025_ DayINFLoRa)
{txt} 12{com}.         qui renvars, presub(daily_infec_y_975_ DayINFUpRa)
{txt} 13{com}.         qui renvars, presub(daily_infec_y_mea_ DayINFMeRa)
{txt} 14{com}.         
.         * other outcomes
.         
.         qui renvars, presub(icu___deman_y_025_ DayIcdLoRa) // "ICU_demand" 
{txt} 15{com}.         qui renvars, presub(icu___deman_y_975_ DayIcdUpRa)
{txt} 16{com}.         qui renvars, presub(icu___deman_y_mea_ DayIcdMeRa)
{txt} 17{com}.         
.         qui renvars, presub(icu___incid_y_025_ DayIciLoRa) // "ICU_incidence"
{txt} 18{com}.         qui renvars, presub(icu___incid_y_975_ DayIciUpRa)
{txt} 19{com}.         qui renvars, presub(icu___incid_y_mea_ DayIciMeRa)
{txt} 20{com}.         
.         qui renvars, presub(reff________y_025_ DayRefLoRa) // "Reff"
{txt} 21{com}.         qui renvars, presub(reff________y_975_ DayRefUpRa)
{txt} 22{com}.         qui renvars, presub(reff________y_mea_ DayRefMeRa)
{txt} 23{com}.         
.         qui renvars, presub(rt__________y_025_ DayRttLoRa) // "Rt"
{txt} 24{com}.         qui renvars, presub(rt__________y_975_ DayRttUpRa)
{txt} 25{com}.         qui renvars, presub(rt__________y_mea_ DayRttMeRa)
{txt} 26{com}.         
.         qui renvars, presub(hospi_deman_y_025_ DayHodLoRa) // "hospital_demand"
{txt} 27{com}.         qui renvars, presub(hospi_deman_y_975_ DayHodUpRa)
{txt} 28{com}.         qui renvars, presub(hospi_deman_y_mea_ DayHodMeRa)
{txt} 29{com}.         
.         qui renvars, presub(hospi_incid_y_025_ DayHoiLoRa) // "hospital_incidence"
{txt} 30{com}.         qui renvars, presub(hospi_incid_y_975_ DayHoiUpRa)
{txt} 31{com}.         qui renvars, presub(hospi_incid_y_mea_ DayHoiMeRa)
{txt} 32{com}.         
.         qui renvars, presub(preval______y_025_ DayPreLoRa) // "prevalence"
{txt} 33{com}.         qui renvars, presub(preval______y_975_ DayPreUpRa)
{txt} 34{com}.         qui renvars, presub(preval______y_mea_ DayPreMeRa)
{txt} 35{com}.         
.         qui renvars, postsub(S1 A03S01) 
{txt} 36{com}.         qui renvars, postsub(S2 A03S02) 
{txt} 37{com}.         qui renvars, postsub(S3 A03S03) 
{txt} 38{com}.         qui renvars, postsub(S4 A03S04) 
{txt} 39{com}.         qui renvars, postsub(S5 A03S05) 
{txt} 40{com}.         qui renvars, postsub(S6 A03S06) 
{txt} 41{com}.         
.         * "Wait Note: renvars are working ..."
.         
. {c )-} 
{txt}
{com}. *   
. 
. 
. 
. *
. 
. drop year month day date2 dateblock
{txt}
{com}. 
. order date  
{txt}
{com}. 
. label var DayINFLoRaA03S01 "Daily infections Lower A03 S01 "
{txt}
{com}. label var DayINFLoRaA03S02 "Daily infections Lower A03 S02 "
{txt}
{com}. label var DayINFLoRaA03S03 "Daily infections Lower A03 S03 "
{txt}
{com}. label var DayINFLoRaA03S04 "Daily infections Lower A03 S04 "
{txt}
{com}. label var DayINFLoRaA03S05 "Daily infections Lower A03 S05 "
{txt}
{com}. label var DayINFLoRaA03S06 "Daily infections Lower A03 S06 "
{txt}
{com}. label var DayINFMeRaA03S01 "Daily infections Mean A03 S01 "
{txt}
{com}. label var DayINFMeRaA03S02 "Daily infections Mean A03 S02 "
{txt}
{com}. label var DayINFMeRaA03S03 "Daily infections Mean A03 S03 "
{txt}
{com}. label var DayINFMeRaA03S04 "Daily infections Mean A03 S04 "
{txt}
{com}. label var DayINFMeRaA03S05 "Daily infections Mean A03 S05 "
{txt}
{com}. label var DayINFMeRaA03S06 "Daily infections Mean A03 S06 "
{txt}
{com}. label var DayINFUpRaA03S01 "Daily infections Upper A03 S01 "
{txt}
{com}. label var DayINFUpRaA03S02 "Daily infections Upper A03 S02 "
{txt}
{com}. label var DayINFUpRaA03S03 "Daily infections Upper A03 S03 "
{txt}
{com}. label var DayINFUpRaA03S04 "Daily infections Upper A03 S04 "
{txt}
{com}. label var DayINFUpRaA03S05 "Daily infections Upper A03 S05 "
{txt}
{com}. label var DayINFUpRaA03S06 "Daily infections Upper A03 S06 "
{txt}
{com}. label var DayDeaLoRaA03S01 "Daily Deaths Lower A03 S01 "
{txt}
{com}. label var DayDeaLoRaA03S02 "Daily Deaths Lower A03 S02 "
{txt}
{com}. label var DayDeaLoRaA03S03 "Daily Deaths Lower A03 S03 "
{txt}
{com}. label var DayDeaLoRaA03S04 "Daily Deaths Lower A03 S04 "
{txt}
{com}. label var DayDeaLoRaA03S05 "Daily Deaths Lower A03 S05 "
{txt}
{com}. label var DayDeaLoRaA03S06 "Daily Deaths Lower A03 S06 "
{txt}
{com}. label var DayDeaMeRaA03S01 "Daily Deaths Mean A03 S01 "
{txt}
{com}. label var DayDeaMeRaA03S02 "Daily Deaths Mean A03 S02 "
{txt}
{com}. label var DayDeaMeRaA03S03 "Daily Deaths Mean A03 S03 "
{txt}
{com}. label var DayDeaMeRaA03S04 "Daily Deaths Mean A03 S04 "
{txt}
{com}. label var DayDeaMeRaA03S05 "Daily Deaths Mean A03 S05 "
{txt}
{com}. label var DayDeaMeRaA03S06 "Daily Deaths Mean A03 S06 "
{txt}
{com}. label var DayDeaUpRaA03S01 "Daily Deaths Upper A03 S01 "
{txt}
{com}. label var DayDeaUpRaA03S02 "Daily Deaths Upper A03 S02 "
{txt}
{com}. label var DayDeaUpRaA03S03 "Daily Deaths Upper A03 S03 "
{txt}
{com}. label var DayDeaUpRaA03S04 "Daily Deaths Upper A03 S04 "
{txt}
{com}. label var DayDeaUpRaA03S05 "Daily Deaths Upper A03 S05 "
{txt}
{com}. label var DayDeaUpRaA03S06 "Daily Deaths Upper A03 S06 "
{txt}
{com}. label var TotINFLoRaA03S01 "Total infections Lower A03 S01 "
{txt}
{com}. label var TotINFLoRaA03S02 "Total infections Lower A03 S02 "
{txt}
{com}. label var TotINFLoRaA03S03 "Total infections Lower A03 S03 "
{txt}
{com}. label var TotINFLoRaA03S04 "Total infections Lower A03 S04 "
{txt}
{com}. label var TotINFLoRaA03S05 "Total infections Lower A03 S05 "
{txt}
{com}. label var TotINFLoRaA03S06 "Total infections Lower A03 S06 "
{txt}
{com}. label var TotINFMeRaA03S01 "Total infections Mean A03 S01 "
{txt}
{com}. label var TotINFMeRaA03S02 "Total infections Mean A03 S02 "
{txt}
{com}. label var TotINFMeRaA03S03 "Total infections Mean A03 S03 "
{txt}
{com}. label var TotINFMeRaA03S04 "Total infections Mean A03 S04 "
{txt}
{com}. label var TotINFMeRaA03S05 "Total infections Mean A03 S05 "
{txt}
{com}. label var TotINFMeRaA03S06 "Total infections Mean A03 S06 "
{txt}
{com}. label var TotINFUpRaA03S01 "Total infections Upper A03 S01 "
{txt}
{com}. label var TotINFUpRaA03S02 "Total infections Upper A03 S02 "
{txt}
{com}. label var TotINFUpRaA03S03 "Total infections Upper A03 S03 "
{txt}
{com}. label var TotINFUpRaA03S04 "Total infections Upper A03 S04 "
{txt}
{com}. label var TotINFUpRaA03S05 "Total infections Upper A03 S05 "
{txt}
{com}. label var TotINFUpRaA03S06 "Total infections Upper A03 S06 "
{txt}
{com}. label var TotDeaLoRaA03S01 "Total Deaths Lower A03 S01 "
{txt}
{com}. label var TotDeaLoRaA03S02 "Total Deaths Lower A03 S02 "
{txt}
{com}. label var TotDeaLoRaA03S03 "Total Deaths Lower A03 S03 "
{txt}
{com}. label var TotDeaLoRaA03S04 "Total Deaths Lower A03 S04 "
{txt}
{com}. label var TotDeaLoRaA03S05 "Total Deaths Lower A03 S05 "
{txt}
{com}. label var TotDeaLoRaA03S06 "Total Deaths Lower A03 S06 "
{txt}
{com}. label var TotDeaMeRaA03S01 "Total Deaths Mean A03 S01 "
{txt}
{com}. label var TotDeaMeRaA03S02 "Total Deaths Mean A03 S02 "
{txt}
{com}. label var TotDeaMeRaA03S03 "Total Deaths Mean A03 S03 "
{txt}
{com}. label var TotDeaMeRaA03S04 "Total Deaths Mean A03 S04 "
{txt}
{com}. label var TotDeaMeRaA03S05 "Total Deaths Mean A03 S05 "
{txt}
{com}. label var TotDeaMeRaA03S06 "Total Deaths Mean A03 S06 "
{txt}
{com}. label var TotDeaUpRaA03S01 "Total Deaths Upper A03 S01 "
{txt}
{com}. label var TotDeaUpRaA03S02 "Total Deaths Upper A03 S02 "
{txt}
{com}. label var TotDeaUpRaA03S03 "Total Deaths Upper A03 S03 "
{txt}
{com}. label var TotDeaUpRaA03S04 "Total Deaths Upper A03 S04 "
{txt}
{com}. label var TotDeaUpRaA03S05 "Total Deaths Upper A03 S05 "
{txt}
{com}. label var TotDeaUpRaA03S06 "Total Deaths Upper A03 S06 "
{txt}
{com}. 
. 
. * other outcomes
. 
. label var DayHodMeRaA03S01 "Daily hospital demand Mean A03 S01 "
{txt}
{com}. label var DayHodLoRaA03S01 "Daily hospital demand Lower A03 S01 "
{txt}
{com}. label var DayHodUpRaA03S01 "Daily hospital demand Upper A03 S01 "
{txt}
{com}. label var DayHodMeRaA03S02 "Daily hospital demand Mean A03 S02 "
{txt}
{com}. label var DayHodLoRaA03S02 "Daily hospital demand Lower A03 S02 "
{txt}
{com}. label var DayHodUpRaA03S02 "Daily hospital demand Upper A03 S02 "
{txt}
{com}. label var DayHodMeRaA03S03 "Daily hospital demand Mean A03 S03 "
{txt}
{com}. label var DayHodLoRaA03S03 "Daily hospital demand Lower A03 S03 "
{txt}
{com}. label var DayHodUpRaA03S03 "Daily hospital demand Upper A03 S03 "
{txt}
{com}. label var DayHodMeRaA03S04 "Daily hospital demand Mean A03 S04 "
{txt}
{com}. label var DayHodLoRaA03S04 "Daily hospital demand Lower A03 S04 "
{txt}
{com}. label var DayHodUpRaA03S04 "Daily hospital demand Upper A03 S04 " 
{txt}
{com}. label var DayHodMeRaA03S05 "Daily hospital demand Mean A03 S05 "
{txt}
{com}. label var DayHodLoRaA03S05 "Daily hospital demand Lower A03 S05 "
{txt}
{com}. label var DayHodUpRaA03S05 "Daily hospital demand Upper A03 S05 "
{txt}
{com}. label var DayHodMeRaA03S06 "Daily hospital demand Mean A03 S06 "
{txt}
{com}. label var DayHodLoRaA03S06 "Daily hospital demand Lower A03 S06 "
{txt}
{com}. label var DayHodUpRaA03S06 "Daily hospital demand Upper A03 S06 "
{txt}
{com}. 
. label var DayHoiMeRaA03S01 "Daily hospital incidence Mean A03 S01 "
{txt}
{com}. label var DayHoiLoRaA03S01 "Daily hospital incidence Lower A03 S01 "
{txt}
{com}. label var DayHoiUpRaA03S01 "Daily hospital incidence Upper A03 S01 "
{txt}
{com}. label var DayHoiMeRaA03S02 "Daily hospital incidence Mean A03 S02 "
{txt}
{com}. label var DayHoiLoRaA03S02 "Daily hospital incidence Lower A03 S02 "
{txt}
{com}. label var DayHoiUpRaA03S02 "Daily hospital incidence Upper A03 S02 "
{txt}
{com}. label var DayHoiMeRaA03S03 "Daily hospital incidence Mean A03 S03 "
{txt}
{com}. label var DayHoiLoRaA03S03 "Daily hospital incidence Lower A03 S03 "
{txt}
{com}. label var DayHoiUpRaA03S03 "Daily hospital incidence Upper A03 S03 "
{txt}
{com}. label var DayHoiMeRaA03S04 "Daily hospital incidence Mean A03 S04 "
{txt}
{com}. label var DayHoiLoRaA03S04 "Daily hospital incidence Lower A03 S04 "
{txt}
{com}. label var DayHoiUpRaA03S04 "Daily hospital incidence Upper A03 S04 "
{txt}
{com}. label var DayHoiMeRaA03S05 "Daily hospital incidence Mean A03 S05 "
{txt}
{com}. label var DayHoiLoRaA03S05 "Daily hospital incidence Lower A03 S05 "
{txt}
{com}. label var DayHoiUpRaA03S05 "Daily hospital incidence Upper A03 S05 "
{txt}
{com}. label var DayHoiMeRaA03S06 "Daily hospital incidence Mean A03 S06 "
{txt}
{com}. label var DayHoiLoRaA03S06 "Daily hospital incidence Lower A03 S06 "
{txt}
{com}. label var DayHoiUpRaA03S06 "Daily hospital incidence Upper A03 S06 "
{txt}
{com}. 
. label var DayIcdMeRaA03S01 "Daily ICU demand Mean A03 S01 "
{txt}
{com}. label var DayIcdLoRaA03S01 "Daily ICU demand Lower A03 S01 "
{txt}
{com}. label var DayIcdUpRaA03S01 "Daily ICU demand Upper A03 S01 "
{txt}
{com}. label var DayIcdMeRaA03S02 "Daily ICU demand Mean A03 S02 "
{txt}
{com}. label var DayIcdLoRaA03S02 "Daily ICU demand Lower A03 S02 "
{txt}
{com}. label var DayIcdUpRaA03S02 "Daily ICU demand Upper A03 S02 "
{txt}
{com}. label var DayIcdMeRaA03S03 "Daily ICU demand Mean A03 S03 "
{txt}
{com}. label var DayIcdLoRaA03S03 "Daily ICU demand Lower A03 S03 "
{txt}
{com}. label var DayIcdUpRaA03S03 "Daily ICU demand Upper A03 S03 "
{txt}
{com}. label var DayIcdMeRaA03S04 "Daily ICU demand Mean A03 S04 "
{txt}
{com}. label var DayIcdLoRaA03S04 "Daily ICU demand Lower A03 S04 "
{txt}
{com}. label var DayIcdUpRaA03S04 "Daily ICU demand Upper A03 S04 "
{txt}
{com}. label var DayIcdMeRaA03S05 "Daily ICU demand Mean A03 S05 "
{txt}
{com}. label var DayIcdLoRaA03S05 "Daily ICU demand Lower A03 S05 "
{txt}
{com}. label var DayIcdUpRaA03S05 "Daily ICU demand Upper A03 S05 "
{txt}
{com}. label var DayIcdMeRaA03S06 "Daily ICU demand Mean A03 S06 "
{txt}
{com}. label var DayIcdLoRaA03S06 "Daily ICU demand Lower A03 S06 "
{txt}
{com}. label var DayIcdUpRaA03S06 "Daily ICU demand Upper A03 S06 "
{txt}
{com}. 
. label var DayIciMeRaA03S01 "Daily ICU incidence Mean A03 S01 "
{txt}
{com}. label var DayIciLoRaA03S01 "Daily ICU incidence Lower A03 S01 "
{txt}
{com}. label var DayIciUpRaA03S01 "Daily ICU incidence Upper A03 S01 "
{txt}
{com}. label var DayIciMeRaA03S02 "Daily ICU incidence Mean A03 S02 "
{txt}
{com}. label var DayIciLoRaA03S02 "Daily ICU incidence Lower A03 S02 "
{txt}
{com}. label var DayIciUpRaA03S02 "Daily ICU incidence Upper A03 S02 "
{txt}
{com}. label var DayIciMeRaA03S03 "Daily ICU incidence Mean A03 S03 "
{txt}
{com}. label var DayIciLoRaA03S03 "Daily ICU incidence Lower A03 S03 "
{txt}
{com}. label var DayIciUpRaA03S03 "Daily ICU incidence Upper A03 S03 "
{txt}
{com}. label var DayIciMeRaA03S04 "Daily ICU incidence Mean A03 S04 "
{txt}
{com}. label var DayIciLoRaA03S04 "Daily ICU incidence Lower A03 S04 "
{txt}
{com}. label var DayIciUpRaA03S04 "Daily ICU incidence Upper A03 S04 "
{txt}
{com}. label var DayIciMeRaA03S05 "Daily ICU incidence Mean A03 S05 "
{txt}
{com}. label var DayIciLoRaA03S05 "Daily ICU incidence Lower A03 S05 "
{txt}
{com}. label var DayIciUpRaA03S05 "Daily ICU incidence Upper A03 S05 "
{txt}
{com}. label var DayIciMeRaA03S06 "Daily ICU incidence Mean A03 S06 "
{txt}
{com}. label var DayIciLoRaA03S06 "Daily ICU incidence Lower A03 S06 "
{txt}
{com}. label var DayIciUpRaA03S06 "Daily ICU incidence Upper A03 S06 "
{txt}
{com}. 
. label var DayPreMeRaA03S01 "Daily prevalence Mean A03 S01 "
{txt}
{com}. label var DayPreLoRaA03S01 "Daily prevalence Lower A03 S01 "
{txt}
{com}. label var DayPreUpRaA03S01 "Daily prevalence Upper A03 S01 "
{txt}
{com}. label var DayPreMeRaA03S02 "Daily prevalence Mean A03 S02 "
{txt}
{com}. label var DayPreLoRaA03S02 "Daily prevalence Lower A03 S02 "
{txt}
{com}. label var DayPreUpRaA03S02 "Daily prevalence Upper A03 S02 "
{txt}
{com}. label var DayPreMeRaA03S03 "Daily prevalence Mean A03 S03 "
{txt}
{com}. label var DayPreLoRaA03S03 "Daily prevalence Lower A03 S03 "
{txt}
{com}. label var DayPreUpRaA03S03 "Daily prevalence Upper A03 S03 "
{txt}
{com}. label var DayPreMeRaA03S04 "Daily prevalence Mean A03 S04 "
{txt}
{com}. label var DayPreLoRaA03S04 "Daily prevalence Lower A03 S04 "
{txt}
{com}. label var DayPreUpRaA03S04 "Daily prevalence Upper A03 S04 "
{txt}
{com}. label var DayPreMeRaA03S05 "Daily prevalence Mean A03 S05 "
{txt}
{com}. label var DayPreLoRaA03S05 "Daily prevalence Lower A03 S05 "
{txt}
{com}. label var DayPreUpRaA03S05 "Daily prevalence Upper A03 S05 "
{txt}
{com}. label var DayPreMeRaA03S06 "Daily prevalence Mean A03 S06 "
{txt}
{com}. label var DayPreLoRaA03S06 "Daily prevalence Lower A03 S06 "
{txt}
{com}. label var DayPreUpRaA03S06 "Daily prevalence Upper A03 S06 "
{txt}
{com}. 
. label var DayRefMeRaA03S01 "Daily R effective Mean A03 S01 "
{txt}
{com}. label var DayRefLoRaA03S01 "Daily R effective Lower A03 S01 "
{txt}
{com}. label var DayRefUpRaA03S01 "Daily R effective Upper A03 S01 "
{txt}
{com}. label var DayRefMeRaA03S02 "Daily R effective Mean A03 S02 "
{txt}
{com}. label var DayRefLoRaA03S02 "Daily R effective Lower A03 S02 "
{txt}
{com}. label var DayRefUpRaA03S02 "Daily R effective Upper A03 S02 "
{txt}
{com}. label var DayRefMeRaA03S03 "Daily R effective Mean A03 S03 "
{txt}
{com}. label var DayRefLoRaA03S03 "Daily R effective Lower A03 S03 "
{txt}
{com}. label var DayRefUpRaA03S03 "Daily R effective Upper A03 S03 "
{txt}
{com}. label var DayRefMeRaA03S04 "Daily R effective Mean A03 S04 "
{txt}
{com}. label var DayRefLoRaA03S04 "Daily R effective Lower A03 S04 "
{txt}
{com}. label var DayRefUpRaA03S04 "Daily R effective Upper A03 S04 "
{txt}
{com}. label var DayRefMeRaA03S05 "Daily R effective Mean A03 S05 "
{txt}
{com}. label var DayRefLoRaA03S05 "Daily R effective Lower A03 S05 "
{txt}
{com}. label var DayRefUpRaA03S05 "Daily R effective Upper A03 S05 "
{txt}
{com}. label var DayRefMeRaA03S06 "Daily R effective Mean A03 S06 "
{txt}
{com}. label var DayRefLoRaA03S06 "Daily R effective Lower A03 S06 "
{txt}
{com}. label var DayRefUpRaA03S06 "Daily R effective Upper A03 S06 "
{txt}
{com}. 
. label var DayRttMeRaA03S01 "Daily R t Mean A03 S01 "
{txt}
{com}. label var DayRttLoRaA03S01 "Daily R t Lower A03 S01 "
{txt}
{com}. label var DayRttUpRaA03S01 "Daily R t Upper A03 S01 "
{txt}
{com}. label var DayRttMeRaA03S02 "Daily R t Mean A03 S02 "
{txt}
{com}. label var DayRttLoRaA03S02 "Daily R t Lower A03 S02 "
{txt}
{com}. label var DayRttUpRaA03S02 "Daily R t Upper A03 S02 "
{txt}
{com}. label var DayRttMeRaA03S03 "Daily R t Mean A03 S03 "
{txt}
{com}. label var DayRttLoRaA03S03 "Daily R t Lower A03 S03 "
{txt}
{com}. label var DayRttUpRaA03S03 "Daily R t Upper A03 S03 "
{txt}
{com}. label var DayRttMeRaA03S04 "Daily R t Mean A03 S04 "
{txt}
{com}. label var DayRttLoRaA03S04 "Daily R t Lower A03 S04 "
{txt}
{com}. label var DayRttUpRaA03S04 "Daily R t Upper A03 S04 "
{txt}
{com}. label var DayRttMeRaA03S05 "Daily R t Mean A03 S05 "
{txt}
{com}. label var DayRttLoRaA03S05 "Daily R t Lower A03 S05 "
{txt}
{com}. label var DayRttUpRaA03S05 "Daily R t Upper A03 S05 "
{txt}
{com}. label var DayRttMeRaA03S06 "Daily R t Mean A03 S06 "
{txt}
{com}. label var DayRttLoRaA03S06 "Daily R t Lower A03 S06 "
{txt}
{com}. label var DayRttUpRaA03S06 "Daily R t Upper A03 S06 "
{txt}
{com}. 
. 
. rename country loc_grand_name
{res}{txt}
{com}. 
. 
. 
. order ///
> loc_grand_name date     ///
> TotDeaMeRaA03S01        TotDeaLoRaA03S01        TotDeaUpRaA03S01        ///
> TotDeaMeRaA03S02        TotDeaLoRaA03S02        TotDeaUpRaA03S02        ///
> TotDeaMeRaA03S03        TotDeaLoRaA03S03        TotDeaUpRaA03S03        ///
> TotDeaMeRaA03S04        TotDeaLoRaA03S04        TotDeaUpRaA03S04        ///
> TotDeaMeRaA03S05        TotDeaLoRaA03S05        TotDeaUpRaA03S05        ///
> TotDeaMeRaA03S06        TotDeaLoRaA03S06        TotDeaUpRaA03S06        ///
> DayDeaMeRaA03S01        DayDeaLoRaA03S01        DayDeaUpRaA03S01        ///
> DayDeaMeRaA03S02        DayDeaLoRaA03S02        DayDeaUpRaA03S02        ///
> DayDeaMeRaA03S03        DayDeaLoRaA03S03        DayDeaUpRaA03S03        ///
> DayDeaMeRaA03S04        DayDeaLoRaA03S04        DayDeaUpRaA03S04        ///
> DayDeaMeRaA03S05        DayDeaLoRaA03S05        DayDeaUpRaA03S05        ///
> DayDeaMeRaA03S06        DayDeaLoRaA03S06        DayDeaUpRaA03S06        ///
> TotINFMeRaA03S01        TotINFLoRaA03S01        TotINFUpRaA03S01        ///
> TotINFMeRaA03S02        TotINFLoRaA03S02        TotINFUpRaA03S02        ///
> TotINFMeRaA03S03        TotINFLoRaA03S03        TotINFUpRaA03S03        ///
> TotINFMeRaA03S04        TotINFLoRaA03S04        TotINFUpRaA03S04        ///
> TotINFMeRaA03S05        TotINFLoRaA03S05        TotINFUpRaA03S05        ///
> TotINFMeRaA03S06        TotINFLoRaA03S06        TotINFUpRaA03S06        ///
> DayINFMeRaA03S01        DayINFLoRaA03S01        DayINFUpRaA03S01        ///
> DayINFMeRaA03S02        DayINFLoRaA03S02        DayINFUpRaA03S02        ///
> DayINFMeRaA03S03        DayINFLoRaA03S03        DayINFUpRaA03S03        ///
> DayINFMeRaA03S04        DayINFLoRaA03S04        DayINFUpRaA03S04        ///
> DayINFMeRaA03S05        DayINFLoRaA03S05        DayINFUpRaA03S05        ///
> DayINFMeRaA03S06        DayINFLoRaA03S06        DayINFUpRaA03S06
{txt}
{com}. 
. 
.  *
.  
.  
. * gen IFR
. 
. gen DayIFRMeRaA03S01 = 100 * DayDeaMeRaA03S01 / DayINFMeRaA03S01 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S01 = 100 * DayDeaLoRaA03S01 / DayINFLoRaA03S01 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S01 = 100 * DayDeaUpRaA03S01 / DayINFUpRaA03S01 
{txt}(1 missing value generated)

{com}. gen DayIFRMeRaA03S02 = 100 * DayDeaMeRaA03S02 / DayINFMeRaA03S02 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S02 = 100 * DayDeaLoRaA03S02 / DayINFLoRaA03S02 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S02 = 100 * DayDeaUpRaA03S02 / DayINFUpRaA03S02 
{txt}(1 missing value generated)

{com}. gen DayIFRMeRaA03S03 = 100 * DayDeaMeRaA03S03 / DayINFMeRaA03S03 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S03 = 100 * DayDeaLoRaA03S03 / DayINFLoRaA03S03 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S03 = 100 * DayDeaUpRaA03S03 / DayINFUpRaA03S03 
{txt}(1 missing value generated)

{com}. gen DayIFRMeRaA03S04 = 100 * DayDeaMeRaA03S04 / DayINFMeRaA03S04 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S04 = 100 * DayDeaLoRaA03S04 / DayINFLoRaA03S04 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S04 = 100 * DayDeaUpRaA03S04 / DayINFUpRaA03S04 
{txt}(1 missing value generated)

{com}. gen DayIFRMeRaA03S05 = 100 * DayDeaMeRaA03S05 / DayINFMeRaA03S05 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S05 = 100 * DayDeaLoRaA03S05 / DayINFLoRaA03S05 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S05 = 100 * DayDeaUpRaA03S05 / DayINFUpRaA03S05 
{txt}(1 missing value generated)

{com}. gen DayIFRMeRaA03S06 = 100 * DayDeaMeRaA03S06 / DayINFMeRaA03S06 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S06 = 100 * DayDeaLoRaA03S06 / DayINFLoRaA03S06 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S06 = 100 * DayDeaUpRaA03S06 / DayINFUpRaA03S06 
{txt}(1 missing value generated)

{com}. 
. label var DayIFRMeRaA03S01 "Daily IFR Mean A03 S01 "
{txt}
{com}. label var DayIFRLoRaA03S01 "Daily IFR Lower A03 S01 "
{txt}
{com}. label var DayIFRUpRaA03S01 "Daily IFR Upper A03 S01 "
{txt}
{com}. label var DayIFRMeRaA03S02 "Daily IFR Mean A03 S02 "
{txt}
{com}. label var DayIFRLoRaA03S02 "Daily IFR Lower A03 S02 "
{txt}
{com}. label var DayIFRUpRaA03S02 "Daily IFR Upper A03 S02 "
{txt}
{com}. label var DayIFRMeRaA03S03 "Daily IFR Mean A03 S03 "
{txt}
{com}. label var DayIFRLoRaA03S03 "Daily IFR Lower A03 S03 "
{txt}
{com}. label var DayIFRUpRaA03S03 "Daily IFR Upper A03 S03 "
{txt}
{com}. label var DayIFRMeRaA03S04 "Daily IFR Mean A03 S04 "
{txt}
{com}. label var DayIFRLoRaA03S04 "Daily IFR Lower A03 S04 "
{txt}
{com}. label var DayIFRUpRaA03S04 "Daily IFR Upper A03 S04 "
{txt}
{com}. label var DayIFRMeRaA03S05 "Daily IFR Mean A03 S05 "
{txt}
{com}. label var DayIFRLoRaA03S05 "Daily IFR Lower A03 S05 "
{txt}
{com}. label var DayIFRUpRaA03S05 "Daily IFR Upper A03 S05 "
{txt}
{com}. label var DayIFRMeRaA03S06 "Daily IFR Mean A03 S06 "
{txt}
{com}. label var DayIFRLoRaA03S06 "Daily IFR Lower A03 S06 "
{txt}
{com}. label var DayIFRUpRaA03S06 "Daily IFR Upper A03 S06 "
{txt}
{com}. 
. 
. 
. 
. 
. * gen "Daily infections mean div by daily deaths mean IMPE DayCbD" for visulization of temporal relation of deaths and infections peaks 
. 
. 
. summ DayDeaMeRaA03S02 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~02 {c |}{res}        808     396.782    249.4315          0     982.95
{txt}
{com}. gen DayDeMMeRaA03S02 = r(mean)
{txt}
{com}. label var DayDeMMeRaA03S02 "Daily deaths mean IMPE DayDeM"
{txt}
{com}. 
. summ DayINFMeRaA03S02 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayINFMeR~02 {c |}{res}        808    167439.6    109166.2        .18   504639.8
{txt}
{com}. gen DayCaMMeRaA03S02 = r(mean)
{txt}
{com}. label var DayCaMMeRaA03S02 "Daily infections mean IMPE DayCaM"
{txt}
{com}.                            
. gen DayCbDMeRaA03S02 = DayCaMMeRaA03S02 / DayDeMMeRaA03S02
{txt}
{com}. label var DayCbDMeRaA03S02 "Daily infections mean div by daily deaths mean IMPE DayCbD"
{txt}
{com}. summ DayCbDMeRaA03S02

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~02 {c |}{res}        809     421.994           0    421.994    421.994
{txt}
{com}.                                               
. gen DayDMuMeRaA03S02 = DayDeaMeRaA03S02 * DayCbDMeRaA03S02
{txt}(1 missing value generated)

{com}. label var DayDMuMeRaA03S02 "Daily deaths scaled (times means of infections by deaths) IMPE"
{txt}
{com}. summ DayDMuMeRaA03S02

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~02 {c |}{res}        808    167439.6    105258.6          0     414799
{txt}
{com}. 
. 
. 
. 
. 
. sort date loc_grand_name
{txt}
{com}. 
. order date loc_grand_name
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "IMPE EMRO.dta", replace
{txt}file IMPE EMRO.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *****************************
. 
. * gen EURO
. 
. use "IMPE.dta", clear
{txt}
{com}. 
. rename country loc_grand_name
{res}{txt}
{com}. 
. keep if ///
> loc_grand_name == "Albania" | ///
> loc_grand_name == "Angola" | ///
> loc_grand_name == "Armenia" | ///
> loc_grand_name == "Austria" | ///
> loc_grand_name == "Azerbaijan" | ///
> loc_grand_name == "Belarus" | ///
> loc_grand_name == "Belgium" | ///
> loc_grand_name == "Bosnia and Herzegovina" | ///
> loc_grand_name == "Bulgaria" | ///
> loc_grand_name == "Croatia" | ///
> loc_grand_name == "Cyprus" | ///
> loc_grand_name == "Czechia" | ///
> loc_grand_name == "Denmark" | ///
> loc_grand_name == "Estonia" | ///
> loc_grand_name == "Finland" | ///
> loc_grand_name == "France" | ///
> loc_grand_name == "Georgia" | ///
> loc_grand_name == "Germany" | ///
> loc_grand_name == "Greece" | ///
> loc_grand_name == "Hungary" | ///
> loc_grand_name == "Iceland" | ///
> loc_grand_name == "Ireland" | ///
> loc_grand_name == "Israel" | ///
> loc_grand_name == "Italy" | ///
> loc_grand_name == "Kazakhstan" | ///
> loc_grand_name == "Kyrgyz Republic" | ///
> loc_grand_name == "Latvia" | ///
> loc_grand_name == "Lithuania" | ///
> loc_grand_name == "Luxembourg" | ///
> loc_grand_name == "Malta" | ///
> loc_grand_name == "Moldova" | ///
> loc_grand_name == "Montenegro" | ///
> loc_grand_name == "Netherlands" | ///
> loc_grand_name == "North Macedonia" | ///
> loc_grand_name == "Norway" | ///
> loc_grand_name == "Poland" | ///
> loc_grand_name == "Portugal" | ///
> loc_grand_name == "Romania" | ///
> loc_grand_name == "Russia" | ///
> loc_grand_name == "Serbia" | ///
> loc_grand_name == "Slovakia" | ///
> loc_grand_name == "Slovenia" | ///
> loc_grand_name == "Spain" | ///
> loc_grand_name == "Sweden" | ///
> loc_grand_name == "Switzerland" | ///
> loc_grand_name == "Tajikistan" | ///
> loc_grand_name == "Turkey" | ///
> loc_grand_name == "Turkmenistan" | ///
> loc_grand_name == "Ukraine" | ///
> loc_grand_name == "United Kingdom" | ///
> loc_grand_name == "Uzbekistan" 
{txt}(6,096,681 observations deleted)

{com}. 
. 
. 
. 
. 
. collapse (sum) y_025 y_25 y_median y_mean y_75 y_975, by(date compartment scenario) 
{txt}
{com}. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. 
. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2)
{txt}
{com}. egen dateblock = concat(year month day)
{txt}
{com}. drop year month day
{txt}
{com}. 
. 
. * rename uncertainty limits
. 
. rename y_025    y_025_
{res}{txt}
{com}. rename y_25     y_250_
{res}{txt}
{com}. rename y_median y_med_
{res}{txt}
{com}. rename y_mean   y_mea_
{res}{txt}
{com}. rename y_75     y_750_
{res}{txt}
{com}. rename y_975    y_975_
{res}{txt}
{com}. 
. 
. foreach var of varlist y_025-y_975 {c -(}
{txt}  2{com}.         ds `var'
{txt}  3{com}.         label variable `var' `r(varlist)'
{txt}  4{com}. {c )-}
{txt}{col 1}y_025_
{col 1}y_250_
{col 1}y_med_
{col 1}y_mea_
{col 1}y_750_
{col 1}y_975_

{com}. *
. 
. 
. 
. * rename scenarios 
. 
. tab scenario 

                  {txt}scenario {c |}      Freq.     Percent        Cum.
{hline 27}{c +}{hline 35}
       Maintain Status Quo {c |}{res}      8,873       16.67       16.67
{txt}                Optimistic {c |}{res}      8,873       16.67       33.33
{txt}               Pessimistic {c |}{res}      8,873       16.67       50.00
{txt}Surged Maintain Status Quo {c |}{res}      8,873       16.67       66.67
{txt}         Surged Optimistic {c |}{res}      8,873       16.67       83.33
{txt}        Surged Pessimistic {c |}{res}      8,873       16.67      100.00
{txt}{hline 27}{c +}{hline 35}
                     Total {c |}{res}     53,238      100.00
{txt}
{com}. 
. 
. /*
> Scenarios:
> 
> S1  "Additional 50% Reduction"                  "S1_Add_Half_Reduction"
> S2  "Maintain Status Quo"                               "S2_Maintain_Staus_Quo"
> S3  "Relax Interventions 50%"                   "S3_Relax_Half_Intervention"
> 
> S4  "Surged Additional 50% Reduction"   "S4_Surged_Add_Half_Reduction"
> S5  "Surged Maintain Status Quo"                "S5_Surged_Maintain_Staus_Quo"
> S6  "Surged Relax Interventions 50%"    "S6_Surged_Relax_Half_Intervention"
> 
> With IMPE update 20211103 (2021-12-13_v9.csv.zip) released on 20211110., IMPE has new terms for their scenarios:
> 
> S1      Optimistic
> S2      Maintain Status Quo
> S3      Pessimistic
> 
> S4      Surged Optimistic
> S5      Surged Maintain Status Quo
> S6      Surged Pessimistic
> */
. 
. 
. gen scenario_snail = ""
{txt}(53,238 missing values generated)

{com}. replace scenario_snail = "S1" if scenario == "Optimistic"
{txt}variable {bf}scenario_snail{sf} was {bf}{res}str1{sf}{txt} now {bf}{res}str2{sf}
{txt}(8,873 real changes made)

{com}. replace scenario_snail = "S2" if scenario == "Maintain Status Quo"
{txt}(8,873 real changes made)

{com}. replace scenario_snail = "S3" if scenario == "Pessimistic"
{txt}(8,873 real changes made)

{com}. replace scenario_snail = "S4" if scenario == "Surged Optimistic"
{txt}(8,873 real changes made)

{com}. replace scenario_snail = "S5" if scenario == "Surged Maintain Status Quo"
{txt}(8,873 real changes made)

{com}. replace scenario_snail = "S6" if scenario == "Surged Pessimistic"
{txt}(8,873 real changes made)

{com}. 
. 
. gen underline = "_"
{txt}
{com}. egen scenario_snail_dateblock = concat(scenario_snail underline dateblock)
{txt}
{com}. 
. drop date_original scenario
{txt}
{com}. 
. drop scenario_snail_dateblock 
{txt}
{com}.   
. drop y_250_ y_med_ y_750_
{txt}
{com}.  
. 
. * Primary outcomes Total Deaths, Total infections, Daily Deaths, and Daily infections
. 
. replace compartment = "cumul_death" if compartment == "cumulative_deaths"
{txt}(4,836 real changes made)

{com}. replace compartment = "cumul_infec" if compartment == "cumulative_infections"
{txt}(4,836 real changes made)

{com}. replace compartment = "daily_death" if compartment == "deaths"
{txt}(4,836 real changes made)

{com}. replace compartment = "daily_infec" if compartment == "infections"
{txt}(4,836 real changes made)

{com}. 
. 
. * other outcomes
. 
. replace compartment = "icu___deman" if compartment == "ICU_demand"                      // Icd
{txt}(4,842 real changes made)

{com}. replace compartment = "icu___incid" if compartment == "ICU_incidence"           // Ici
{txt}(4,842 real changes made)

{com}. replace compartment = "reff_______" if compartment == "Reff"                            // Ref
{txt}(4,842 real changes made)

{com}. replace compartment = "rt_________" if compartment == "Rt"                                      // Rtt
{txt}(4,842 real changes made)

{com}. replace compartment = "hospi_deman" if compartment == "hospital_demand"         // Hod
{txt}(4,842 real changes made)

{com}. replace compartment = "hospi_incid" if compartment == "hospital_incidence"  // Hoi
{txt}(4,842 real changes made)

{com}. replace compartment = "preval_____" if compartment == "prevalence"                      // Pre
{txt}(4,842 real changes made)

{com}. 
. 
. 
. duplicates drop date compartment scenario, force

{p 0 4}{txt}Duplicates in terms of {res} dateblock compartment scenario_snail{p_end}

{txt}(0 observations are duplicates)

{com}. 
. * reshape
. 
. egen compartment_scenario_snail = concat(compartment underline scenario_snail)  
{txt}
{com}. 
. drop compartment underline scenario_snail
{txt}
{com}. 
. tab compartment_scenario_snail

{txt}compartment_sc {c |}
  enario_snail {c |}      Freq.     Percent        Cum.
{hline 15}{c +}{hline 35}
cumul_death_S1 {c |}{res}        806        1.51        1.51
{txt}cumul_death_S2 {c |}{res}        806        1.51        3.03
{txt}cumul_death_S3 {c |}{res}        806        1.51        4.54
{txt}cumul_death_S4 {c |}{res}        806        1.51        6.06
{txt}cumul_death_S5 {c |}{res}        806        1.51        7.57
{txt}cumul_death_S6 {c |}{res}        806        1.51        9.08
{txt}cumul_infec_S1 {c |}{res}        806        1.51       10.60
{txt}cumul_infec_S2 {c |}{res}        806        1.51       12.11
{txt}cumul_infec_S3 {c |}{res}        806        1.51       13.63
{txt}cumul_infec_S4 {c |}{res}        806        1.51       15.14
{txt}cumul_infec_S5 {c |}{res}        806        1.51       16.65
{txt}cumul_infec_S6 {c |}{res}        806        1.51       18.17
{txt}daily_death_S1 {c |}{res}        806        1.51       19.68
{txt}daily_death_S2 {c |}{res}        806        1.51       21.20
{txt}daily_death_S3 {c |}{res}        806        1.51       22.71
{txt}daily_death_S4 {c |}{res}        806        1.51       24.22
{txt}daily_death_S5 {c |}{res}        806        1.51       25.74
{txt}daily_death_S6 {c |}{res}        806        1.51       27.25
{txt}daily_infec_S1 {c |}{res}        806        1.51       28.77
{txt}daily_infec_S2 {c |}{res}        806        1.51       30.28
{txt}daily_infec_S3 {c |}{res}        806        1.51       31.79
{txt}daily_infec_S4 {c |}{res}        806        1.51       33.31
{txt}daily_infec_S5 {c |}{res}        806        1.51       34.82
{txt}daily_infec_S6 {c |}{res}        806        1.51       36.33
{txt}hospi_deman_S1 {c |}{res}        807        1.52       37.85
{txt}hospi_deman_S2 {c |}{res}        807        1.52       39.37
{txt}hospi_deman_S3 {c |}{res}        807        1.52       40.88
{txt}hospi_deman_S4 {c |}{res}        807        1.52       42.40
{txt}hospi_deman_S5 {c |}{res}        807        1.52       43.91
{txt}hospi_deman_S6 {c |}{res}        807        1.52       45.43
{txt}hospi_incid_S1 {c |}{res}        807        1.52       46.95
{txt}hospi_incid_S2 {c |}{res}        807        1.52       48.46
{txt}hospi_incid_S3 {c |}{res}        807        1.52       49.98
{txt}hospi_incid_S4 {c |}{res}        807        1.52       51.49
{txt}hospi_incid_S5 {c |}{res}        807        1.52       53.01
{txt}hospi_incid_S6 {c |}{res}        807        1.52       54.52
{txt}icu___deman_S1 {c |}{res}        807        1.52       56.04
{txt}icu___deman_S2 {c |}{res}        807        1.52       57.56
{txt}icu___deman_S3 {c |}{res}        807        1.52       59.07
{txt}icu___deman_S4 {c |}{res}        807        1.52       60.59
{txt}icu___deman_S5 {c |}{res}        807        1.52       62.10
{txt}icu___deman_S6 {c |}{res}        807        1.52       63.62
{txt}icu___incid_S1 {c |}{res}        807        1.52       65.14
{txt}icu___incid_S2 {c |}{res}        807        1.52       66.65
{txt}icu___incid_S3 {c |}{res}        807        1.52       68.17
{txt}icu___incid_S4 {c |}{res}        807        1.52       69.68
{txt}icu___incid_S5 {c |}{res}        807        1.52       71.20
{txt}icu___incid_S6 {c |}{res}        807        1.52       72.71
{txt}preval______S1 {c |}{res}        807        1.52       74.23
{txt}preval______S2 {c |}{res}        807        1.52       75.75
{txt}preval______S3 {c |}{res}        807        1.52       77.26
{txt}preval______S4 {c |}{res}        807        1.52       78.78
{txt}preval______S5 {c |}{res}        807        1.52       80.29
{txt}preval______S6 {c |}{res}        807        1.52       81.81
{txt}reff________S1 {c |}{res}        807        1.52       83.33
{txt}reff________S2 {c |}{res}        807        1.52       84.84
{txt}reff________S3 {c |}{res}        807        1.52       86.36
{txt}reff________S4 {c |}{res}        807        1.52       87.87
{txt}reff________S5 {c |}{res}        807        1.52       89.39
{txt}reff________S6 {c |}{res}        807        1.52       90.90
{txt}rt__________S1 {c |}{res}        807        1.52       92.42
{txt}rt__________S2 {c |}{res}        807        1.52       93.94
{txt}rt__________S3 {c |}{res}        807        1.52       95.45
{txt}rt__________S4 {c |}{res}        807        1.52       96.97
{txt}rt__________S5 {c |}{res}        807        1.52       98.48
{txt}rt__________S6 {c |}{res}        807        1.52      100.00
{txt}{hline 15}{c +}{hline 35}
         Total {c |}{res}     53,238      100.00
{txt}
{com}. 
. gen country = "EURO"
{txt}
{com}. 
. reshape wide y_025_   y_mea_  y_975_, i(country dateblock) j(compartment_scenario_snail) string
{txt}(note: j = cumul_death_S1 cumul_death_S2 cumul_death_S3 cumul_death_S4 cumul_death_S5 cumul_death_S6 cumul_infec_S1 cumul_infec_S2 cumul_infec_S3 cumul_infec_S4 cumul_infec_S5 cumul_infec_S6 daily_death_S1 daily_death_S2 daily_death_S3 daily_death_S4 daily_death_S5 daily_death_S6 daily_infec_S1 daily_infec_S2 daily_infec_S3 daily_infec_S4 daily_infec_S5 daily_infec_S6 hospi_deman_S1 hospi_deman_S2 hospi_deman_S3 hospi_deman_S4 hospi_deman_S5 hospi_deman_S6 hospi_incid_S1 hospi_incid_S2 hospi_incid_S3 hospi_incid_S4 hospi_incid_S5 hospi_incid_S6 icu___deman_S1 icu___deman_S2 icu___deman_S3 icu___deman_S4 icu___deman_S5 icu___deman_S6 icu___incid_S1 icu___incid_S2 icu___incid_S3 icu___incid_S4 icu___incid_S5 icu___incid_S6 preval______S1 preval______S2 preval______S3 preval______S4 preval______S5 preval______S6 reff________S1 reff________S2 reff________S3 reff________S4 reff________S5 reff________S6 rt__________S1 rt__________S2 rt__________S3 rt__________S4 rt__________S5 rt__________S6)

Data{col 36}long{col 43}->{col 48}wide
{hline 77}
Number of obs.                 {res}   53238   {txt}->{res}     807
{txt}Number of variables            {res}       6   {txt}->{res}     200
{txt}j variable (66 values){res}compartment_scenario_snail{txt}->(dropped)
xij variables:
                                 {res}y_025_   {txt}->   {res}y_025_cumul_death_S1 y_025_cumul_death_S2 ... y_025_rt__________S6
                                 y_mea_   {txt}->   {res}y_mea_cumul_death_S1 y_mea_cumul_death_S2 ... y_mea_rt__________S6
                                 y_975_   {txt}->   {res}y_975_cumul_death_S1 y_975_cumul_death_S2 ... y_975_rt__________S6
{txt}{hline 77}

{com}. 
. 
. *
. 
. 
. 
. foreach v of varlist y_025_cumul_death_S1-y_975_rt__________S6 {c -(} 
{txt}  2{com}. 
.         local first = substr("`v'", 7, 11) 
{txt}  3{com}.         local second = substr("`v'", 6, 1)
{txt}  4{com}.         local third  = substr("`v'", 1, 5)
{txt}  5{com}.         local fourth = substr("`v'", 19, 2)
{txt}  6{com}.         label var `v' "`first'`second'`third'`second'`fourth'"
{txt}  7{com}. {c )-} 
{txt}
{com}. *
. 
. 
. 
. foreach v of varlist y_025_cumul_death_S1-y_975_rt__________S6 {c -(} 
{txt}  2{com}.         di `"`: var label `v''"' 
{txt}  3{com}.         local fifth `"`: var label `v''"'
{txt}  4{com}.         rename `v'   `fifth'
{txt}  5{com}. {c )-}
cumul_death_y_025_S1
{res}cumul_death_y_mea_S1
cumul_death_y_975_S1
cumul_death_y_025_S2
cumul_death_y_mea_S2
cumul_death_y_975_S2
cumul_death_y_025_S3
cumul_death_y_mea_S3
cumul_death_y_975_S3
cumul_death_y_025_S4
cumul_death_y_mea_S4
cumul_death_y_975_S4
cumul_death_y_025_S5
cumul_death_y_mea_S5
cumul_death_y_975_S5
cumul_death_y_025_S6
cumul_death_y_mea_S6
cumul_death_y_975_S6
cumul_infec_y_025_S1
cumul_infec_y_mea_S1
cumul_infec_y_975_S1
cumul_infec_y_025_S2
cumul_infec_y_mea_S2
cumul_infec_y_975_S2
cumul_infec_y_025_S3
cumul_infec_y_mea_S3
cumul_infec_y_975_S3
cumul_infec_y_025_S4
cumul_infec_y_mea_S4
cumul_infec_y_975_S4
cumul_infec_y_025_S5
cumul_infec_y_mea_S5
cumul_infec_y_975_S5
cumul_infec_y_025_S6
cumul_infec_y_mea_S6
cumul_infec_y_975_S6
daily_death_y_025_S1
daily_death_y_mea_S1
daily_death_y_975_S1
daily_death_y_025_S2
daily_death_y_mea_S2
daily_death_y_975_S2
daily_death_y_025_S3
daily_death_y_mea_S3
daily_death_y_975_S3
daily_death_y_025_S4
daily_death_y_mea_S4
daily_death_y_975_S4
daily_death_y_025_S5
daily_death_y_mea_S5
daily_death_y_975_S5
daily_death_y_025_S6
daily_death_y_mea_S6
daily_death_y_975_S6
daily_infec_y_025_S1
daily_infec_y_mea_S1
daily_infec_y_975_S1
daily_infec_y_025_S2
daily_infec_y_mea_S2
daily_infec_y_975_S2
daily_infec_y_025_S3
daily_infec_y_mea_S3
daily_infec_y_975_S3
daily_infec_y_025_S4
daily_infec_y_mea_S4
daily_infec_y_975_S4
daily_infec_y_025_S5
daily_infec_y_mea_S5
daily_infec_y_975_S5
daily_infec_y_025_S6
daily_infec_y_mea_S6
daily_infec_y_975_S6
hospi_deman_y_025_S1
hospi_deman_y_mea_S1
hospi_deman_y_975_S1
hospi_deman_y_025_S2
hospi_deman_y_mea_S2
hospi_deman_y_975_S2
hospi_deman_y_025_S3
hospi_deman_y_mea_S3
hospi_deman_y_975_S3
hospi_deman_y_025_S4
hospi_deman_y_mea_S4
hospi_deman_y_975_S4
hospi_deman_y_025_S5
hospi_deman_y_mea_S5
hospi_deman_y_975_S5
hospi_deman_y_025_S6
hospi_deman_y_mea_S6
hospi_deman_y_975_S6
hospi_incid_y_025_S1
hospi_incid_y_mea_S1
hospi_incid_y_975_S1
hospi_incid_y_025_S2
hospi_incid_y_mea_S2
hospi_incid_y_975_S2
hospi_incid_y_025_S3
hospi_incid_y_mea_S3
hospi_incid_y_975_S3
hospi_incid_y_025_S4
hospi_incid_y_mea_S4
hospi_incid_y_975_S4
hospi_incid_y_025_S5
hospi_incid_y_mea_S5
hospi_incid_y_975_S5
hospi_incid_y_025_S6
hospi_incid_y_mea_S6
hospi_incid_y_975_S6
icu___deman_y_025_S1
icu___deman_y_mea_S1
icu___deman_y_975_S1
icu___deman_y_025_S2
icu___deman_y_mea_S2
icu___deman_y_975_S2
icu___deman_y_025_S3
icu___deman_y_mea_S3
icu___deman_y_975_S3
icu___deman_y_025_S4
icu___deman_y_mea_S4
icu___deman_y_975_S4
icu___deman_y_025_S5
icu___deman_y_mea_S5
icu___deman_y_975_S5
icu___deman_y_025_S6
icu___deman_y_mea_S6
icu___deman_y_975_S6
icu___incid_y_025_S1
icu___incid_y_mea_S1
icu___incid_y_975_S1
icu___incid_y_025_S2
icu___incid_y_mea_S2
icu___incid_y_975_S2
icu___incid_y_025_S3
icu___incid_y_mea_S3
icu___incid_y_975_S3
icu___incid_y_025_S4
icu___incid_y_mea_S4
icu___incid_y_975_S4
icu___incid_y_025_S5
icu___incid_y_mea_S5
icu___incid_y_975_S5
icu___incid_y_025_S6
icu___incid_y_mea_S6
icu___incid_y_975_S6
preval______y_025_S1
preval______y_mea_S1
preval______y_975_S1
preval______y_025_S2
preval______y_mea_S2
preval______y_975_S2
preval______y_025_S3
preval______y_mea_S3
preval______y_975_S3
preval______y_025_S4
preval______y_mea_S4
preval______y_975_S4
preval______y_025_S5
preval______y_mea_S5
preval______y_975_S5
preval______y_025_S6
preval______y_mea_S6
preval______y_975_S6
reff________y_025_S1
reff________y_mea_S1
reff________y_975_S1
reff________y_025_S2
reff________y_mea_S2
reff________y_975_S2
reff________y_025_S3
reff________y_mea_S3
reff________y_975_S3
reff________y_025_S4
reff________y_mea_S4
reff________y_975_S4
reff________y_025_S5
reff________y_mea_S5
reff________y_975_S5
reff________y_025_S6
reff________y_mea_S6
reff________y_975_S6
rt__________y_025_S1
rt__________y_mea_S1
rt__________y_975_S1
rt__________y_025_S2
rt__________y_mea_S2
rt__________y_975_S2
rt__________y_025_S3
rt__________y_mea_S3
rt__________y_975_S3
rt__________y_025_S4
rt__________y_mea_S4
rt__________y_975_S4
rt__________y_025_S5
rt__________y_mea_S5
rt__________y_975_S5
rt__________y_025_S6
rt__________y_mea_S6
rt__________y_975_S6
{txt}
{com}. *
. 
. 
. * gen date
. 
. gen year = substr(dateblock,1,4) 
{txt}
{com}. gen month = substr(dateblock,5,2) 
{txt}
{com}. gen day = substr(dateblock,7,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21910{txt},{res}22716{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}27dec2019{txt},{res}12mar2022{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}807{col 51}{txt}missing .:  {res}0{txt}/{res}807

{txt}{col 19}mean:{res}{col 26}   22313{txt} = {res}02feb2021{txt}
{col 15}std. dev:{res}{col 26} 233.105

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21990{col 37}   22111{col 47}   22313{col 57}   22515{col 67}   22636
{col 26}16mar2020{col 36}15jul2020{col 46}02feb2021{col 56}23aug2021{col 66}22dec2021
{txt}
{com}. 
. 
. 
. * 
. 
. 
. * -renvars- somanyvars rather time consuming
. 
. foreach v of varlist cumul_death_y_025_S1-rt__________y_975_S6 {c -(} 
{txt}  2{com}. 
.     qui renvars, presub(cumul_death_y_025_ TotDeaLoRa)
{txt}  3{com}.     qui renvars, presub(cumul_death_y_975_ TotDeaUpRa)
{txt}  4{com}.     qui renvars, presub(cumul_death_y_mea_ TotDeaMeRa)
{txt}  5{com}. 
.         qui renvars, presub(daily_death_y_025_ DayDeaLoRa)
{txt}  6{com}.         qui renvars, presub(daily_death_y_975_ DayDeaUpRa)
{txt}  7{com}.         qui renvars, presub(daily_death_y_mea_ DayDeaMeRa)
{txt}  8{com}.         
.     qui renvars, presub(cumul_infec_y_025_ TotINFLoRa)
{txt}  9{com}.     qui renvars, presub(cumul_infec_y_975_ TotINFUpRa)
{txt} 10{com}.     qui renvars, presub(cumul_infec_y_mea_ TotINFMeRa)
{txt} 11{com}.         
.         qui renvars, presub(daily_infec_y_025_ DayINFLoRa)
{txt} 12{com}.         qui renvars, presub(daily_infec_y_975_ DayINFUpRa)
{txt} 13{com}.         qui renvars, presub(daily_infec_y_mea_ DayINFMeRa)
{txt} 14{com}.         
.         * other outcomes
.         
.         qui renvars, presub(icu___deman_y_025_ DayIcdLoRa) // "ICU_demand" 
{txt} 15{com}.         qui renvars, presub(icu___deman_y_975_ DayIcdUpRa)
{txt} 16{com}.         qui renvars, presub(icu___deman_y_mea_ DayIcdMeRa)
{txt} 17{com}.         
.         qui renvars, presub(icu___incid_y_025_ DayIciLoRa) // "ICU_incidence"
{txt} 18{com}.         qui renvars, presub(icu___incid_y_975_ DayIciUpRa)
{txt} 19{com}.         qui renvars, presub(icu___incid_y_mea_ DayIciMeRa)
{txt} 20{com}.         
.         qui renvars, presub(reff________y_025_ DayRefLoRa) // "Reff"
{txt} 21{com}.         qui renvars, presub(reff________y_975_ DayRefUpRa)
{txt} 22{com}.         qui renvars, presub(reff________y_mea_ DayRefMeRa)
{txt} 23{com}.         
.         qui renvars, presub(rt__________y_025_ DayRttLoRa) // "Rt"
{txt} 24{com}.         qui renvars, presub(rt__________y_975_ DayRttUpRa)
{txt} 25{com}.         qui renvars, presub(rt__________y_mea_ DayRttMeRa)
{txt} 26{com}.         
.         qui renvars, presub(hospi_deman_y_025_ DayHodLoRa) // "hospital_demand"
{txt} 27{com}.         qui renvars, presub(hospi_deman_y_975_ DayHodUpRa)
{txt} 28{com}.         qui renvars, presub(hospi_deman_y_mea_ DayHodMeRa)
{txt} 29{com}.         
.         qui renvars, presub(hospi_incid_y_025_ DayHoiLoRa) // "hospital_incidence"
{txt} 30{com}.         qui renvars, presub(hospi_incid_y_975_ DayHoiUpRa)
{txt} 31{com}.         qui renvars, presub(hospi_incid_y_mea_ DayHoiMeRa)
{txt} 32{com}.         
.         qui renvars, presub(preval______y_025_ DayPreLoRa) // "prevalence"
{txt} 33{com}.         qui renvars, presub(preval______y_975_ DayPreUpRa)
{txt} 34{com}.         qui renvars, presub(preval______y_mea_ DayPreMeRa)
{txt} 35{com}.         
.         qui renvars, postsub(S1 A03S01) 
{txt} 36{com}.         qui renvars, postsub(S2 A03S02) 
{txt} 37{com}.         qui renvars, postsub(S3 A03S03) 
{txt} 38{com}.         qui renvars, postsub(S4 A03S04) 
{txt} 39{com}.         qui renvars, postsub(S5 A03S05) 
{txt} 40{com}.         qui renvars, postsub(S6 A03S06) 
{txt} 41{com}.         
.         * "Wait Note: renvars are working ..."
.         
. {c )-} 
{txt}
{com}. *   
. 
. 
. 
. *
. 
. drop year month day date2 dateblock
{txt}
{com}. 
. order date  
{txt}
{com}. 
. label var DayINFLoRaA03S01 "Daily infections Lower A03 S01 "
{txt}
{com}. label var DayINFLoRaA03S02 "Daily infections Lower A03 S02 "
{txt}
{com}. label var DayINFLoRaA03S03 "Daily infections Lower A03 S03 "
{txt}
{com}. label var DayINFLoRaA03S04 "Daily infections Lower A03 S04 "
{txt}
{com}. label var DayINFLoRaA03S05 "Daily infections Lower A03 S05 "
{txt}
{com}. label var DayINFLoRaA03S06 "Daily infections Lower A03 S06 "
{txt}
{com}. label var DayINFMeRaA03S01 "Daily infections Mean A03 S01 "
{txt}
{com}. label var DayINFMeRaA03S02 "Daily infections Mean A03 S02 "
{txt}
{com}. label var DayINFMeRaA03S03 "Daily infections Mean A03 S03 "
{txt}
{com}. label var DayINFMeRaA03S04 "Daily infections Mean A03 S04 "
{txt}
{com}. label var DayINFMeRaA03S05 "Daily infections Mean A03 S05 "
{txt}
{com}. label var DayINFMeRaA03S06 "Daily infections Mean A03 S06 "
{txt}
{com}. label var DayINFUpRaA03S01 "Daily infections Upper A03 S01 "
{txt}
{com}. label var DayINFUpRaA03S02 "Daily infections Upper A03 S02 "
{txt}
{com}. label var DayINFUpRaA03S03 "Daily infections Upper A03 S03 "
{txt}
{com}. label var DayINFUpRaA03S04 "Daily infections Upper A03 S04 "
{txt}
{com}. label var DayINFUpRaA03S05 "Daily infections Upper A03 S05 "
{txt}
{com}. label var DayINFUpRaA03S06 "Daily infections Upper A03 S06 "
{txt}
{com}. label var DayDeaLoRaA03S01 "Daily Deaths Lower A03 S01 "
{txt}
{com}. label var DayDeaLoRaA03S02 "Daily Deaths Lower A03 S02 "
{txt}
{com}. label var DayDeaLoRaA03S03 "Daily Deaths Lower A03 S03 "
{txt}
{com}. label var DayDeaLoRaA03S04 "Daily Deaths Lower A03 S04 "
{txt}
{com}. label var DayDeaLoRaA03S05 "Daily Deaths Lower A03 S05 "
{txt}
{com}. label var DayDeaLoRaA03S06 "Daily Deaths Lower A03 S06 "
{txt}
{com}. label var DayDeaMeRaA03S01 "Daily Deaths Mean A03 S01 "
{txt}
{com}. label var DayDeaMeRaA03S02 "Daily Deaths Mean A03 S02 "
{txt}
{com}. label var DayDeaMeRaA03S03 "Daily Deaths Mean A03 S03 "
{txt}
{com}. label var DayDeaMeRaA03S04 "Daily Deaths Mean A03 S04 "
{txt}
{com}. label var DayDeaMeRaA03S05 "Daily Deaths Mean A03 S05 "
{txt}
{com}. label var DayDeaMeRaA03S06 "Daily Deaths Mean A03 S06 "
{txt}
{com}. label var DayDeaUpRaA03S01 "Daily Deaths Upper A03 S01 "
{txt}
{com}. label var DayDeaUpRaA03S02 "Daily Deaths Upper A03 S02 "
{txt}
{com}. label var DayDeaUpRaA03S03 "Daily Deaths Upper A03 S03 "
{txt}
{com}. label var DayDeaUpRaA03S04 "Daily Deaths Upper A03 S04 "
{txt}
{com}. label var DayDeaUpRaA03S05 "Daily Deaths Upper A03 S05 "
{txt}
{com}. label var DayDeaUpRaA03S06 "Daily Deaths Upper A03 S06 "
{txt}
{com}. label var TotINFLoRaA03S01 "Total infections Lower A03 S01 "
{txt}
{com}. label var TotINFLoRaA03S02 "Total infections Lower A03 S02 "
{txt}
{com}. label var TotINFLoRaA03S03 "Total infections Lower A03 S03 "
{txt}
{com}. label var TotINFLoRaA03S04 "Total infections Lower A03 S04 "
{txt}
{com}. label var TotINFLoRaA03S05 "Total infections Lower A03 S05 "
{txt}
{com}. label var TotINFLoRaA03S06 "Total infections Lower A03 S06 "
{txt}
{com}. label var TotINFMeRaA03S01 "Total infections Mean A03 S01 "
{txt}
{com}. label var TotINFMeRaA03S02 "Total infections Mean A03 S02 "
{txt}
{com}. label var TotINFMeRaA03S03 "Total infections Mean A03 S03 "
{txt}
{com}. label var TotINFMeRaA03S04 "Total infections Mean A03 S04 "
{txt}
{com}. label var TotINFMeRaA03S05 "Total infections Mean A03 S05 "
{txt}
{com}. label var TotINFMeRaA03S06 "Total infections Mean A03 S06 "
{txt}
{com}. label var TotINFUpRaA03S01 "Total infections Upper A03 S01 "
{txt}
{com}. label var TotINFUpRaA03S02 "Total infections Upper A03 S02 "
{txt}
{com}. label var TotINFUpRaA03S03 "Total infections Upper A03 S03 "
{txt}
{com}. label var TotINFUpRaA03S04 "Total infections Upper A03 S04 "
{txt}
{com}. label var TotINFUpRaA03S05 "Total infections Upper A03 S05 "
{txt}
{com}. label var TotINFUpRaA03S06 "Total infections Upper A03 S06 "
{txt}
{com}. label var TotDeaLoRaA03S01 "Total Deaths Lower A03 S01 "
{txt}
{com}. label var TotDeaLoRaA03S02 "Total Deaths Lower A03 S02 "
{txt}
{com}. label var TotDeaLoRaA03S03 "Total Deaths Lower A03 S03 "
{txt}
{com}. label var TotDeaLoRaA03S04 "Total Deaths Lower A03 S04 "
{txt}
{com}. label var TotDeaLoRaA03S05 "Total Deaths Lower A03 S05 "
{txt}
{com}. label var TotDeaLoRaA03S06 "Total Deaths Lower A03 S06 "
{txt}
{com}. label var TotDeaMeRaA03S01 "Total Deaths Mean A03 S01 "
{txt}
{com}. label var TotDeaMeRaA03S02 "Total Deaths Mean A03 S02 "
{txt}
{com}. label var TotDeaMeRaA03S03 "Total Deaths Mean A03 S03 "
{txt}
{com}. label var TotDeaMeRaA03S04 "Total Deaths Mean A03 S04 "
{txt}
{com}. label var TotDeaMeRaA03S05 "Total Deaths Mean A03 S05 "
{txt}
{com}. label var TotDeaMeRaA03S06 "Total Deaths Mean A03 S06 "
{txt}
{com}. label var TotDeaUpRaA03S01 "Total Deaths Upper A03 S01 "
{txt}
{com}. label var TotDeaUpRaA03S02 "Total Deaths Upper A03 S02 "
{txt}
{com}. label var TotDeaUpRaA03S03 "Total Deaths Upper A03 S03 "
{txt}
{com}. label var TotDeaUpRaA03S04 "Total Deaths Upper A03 S04 "
{txt}
{com}. label var TotDeaUpRaA03S05 "Total Deaths Upper A03 S05 "
{txt}
{com}. label var TotDeaUpRaA03S06 "Total Deaths Upper A03 S06 "
{txt}
{com}. 
. 
. * other outcomes
. 
. label var DayHodMeRaA03S01 "Daily hospital demand Mean A03 S01 "
{txt}
{com}. label var DayHodLoRaA03S01 "Daily hospital demand Lower A03 S01 "
{txt}
{com}. label var DayHodUpRaA03S01 "Daily hospital demand Upper A03 S01 "
{txt}
{com}. label var DayHodMeRaA03S02 "Daily hospital demand Mean A03 S02 "
{txt}
{com}. label var DayHodLoRaA03S02 "Daily hospital demand Lower A03 S02 "
{txt}
{com}. label var DayHodUpRaA03S02 "Daily hospital demand Upper A03 S02 "
{txt}
{com}. label var DayHodMeRaA03S03 "Daily hospital demand Mean A03 S03 "
{txt}
{com}. label var DayHodLoRaA03S03 "Daily hospital demand Lower A03 S03 "
{txt}
{com}. label var DayHodUpRaA03S03 "Daily hospital demand Upper A03 S03 "
{txt}
{com}. label var DayHodMeRaA03S04 "Daily hospital demand Mean A03 S04 "
{txt}
{com}. label var DayHodLoRaA03S04 "Daily hospital demand Lower A03 S04 "
{txt}
{com}. label var DayHodUpRaA03S04 "Daily hospital demand Upper A03 S04 " 
{txt}
{com}. label var DayHodMeRaA03S05 "Daily hospital demand Mean A03 S05 "
{txt}
{com}. label var DayHodLoRaA03S05 "Daily hospital demand Lower A03 S05 "
{txt}
{com}. label var DayHodUpRaA03S05 "Daily hospital demand Upper A03 S05 "
{txt}
{com}. label var DayHodMeRaA03S06 "Daily hospital demand Mean A03 S06 "
{txt}
{com}. label var DayHodLoRaA03S06 "Daily hospital demand Lower A03 S06 "
{txt}
{com}. label var DayHodUpRaA03S06 "Daily hospital demand Upper A03 S06 "
{txt}
{com}. 
. label var DayHoiMeRaA03S01 "Daily hospital incidence Mean A03 S01 "
{txt}
{com}. label var DayHoiLoRaA03S01 "Daily hospital incidence Lower A03 S01 "
{txt}
{com}. label var DayHoiUpRaA03S01 "Daily hospital incidence Upper A03 S01 "
{txt}
{com}. label var DayHoiMeRaA03S02 "Daily hospital incidence Mean A03 S02 "
{txt}
{com}. label var DayHoiLoRaA03S02 "Daily hospital incidence Lower A03 S02 "
{txt}
{com}. label var DayHoiUpRaA03S02 "Daily hospital incidence Upper A03 S02 "
{txt}
{com}. label var DayHoiMeRaA03S03 "Daily hospital incidence Mean A03 S03 "
{txt}
{com}. label var DayHoiLoRaA03S03 "Daily hospital incidence Lower A03 S03 "
{txt}
{com}. label var DayHoiUpRaA03S03 "Daily hospital incidence Upper A03 S03 "
{txt}
{com}. label var DayHoiMeRaA03S04 "Daily hospital incidence Mean A03 S04 "
{txt}
{com}. label var DayHoiLoRaA03S04 "Daily hospital incidence Lower A03 S04 "
{txt}
{com}. label var DayHoiUpRaA03S04 "Daily hospital incidence Upper A03 S04 "
{txt}
{com}. label var DayHoiMeRaA03S05 "Daily hospital incidence Mean A03 S05 "
{txt}
{com}. label var DayHoiLoRaA03S05 "Daily hospital incidence Lower A03 S05 "
{txt}
{com}. label var DayHoiUpRaA03S05 "Daily hospital incidence Upper A03 S05 "
{txt}
{com}. label var DayHoiMeRaA03S06 "Daily hospital incidence Mean A03 S06 "
{txt}
{com}. label var DayHoiLoRaA03S06 "Daily hospital incidence Lower A03 S06 "
{txt}
{com}. label var DayHoiUpRaA03S06 "Daily hospital incidence Upper A03 S06 "
{txt}
{com}. 
. label var DayIcdMeRaA03S01 "Daily ICU demand Mean A03 S01 "
{txt}
{com}. label var DayIcdLoRaA03S01 "Daily ICU demand Lower A03 S01 "
{txt}
{com}. label var DayIcdUpRaA03S01 "Daily ICU demand Upper A03 S01 "
{txt}
{com}. label var DayIcdMeRaA03S02 "Daily ICU demand Mean A03 S02 "
{txt}
{com}. label var DayIcdLoRaA03S02 "Daily ICU demand Lower A03 S02 "
{txt}
{com}. label var DayIcdUpRaA03S02 "Daily ICU demand Upper A03 S02 "
{txt}
{com}. label var DayIcdMeRaA03S03 "Daily ICU demand Mean A03 S03 "
{txt}
{com}. label var DayIcdLoRaA03S03 "Daily ICU demand Lower A03 S03 "
{txt}
{com}. label var DayIcdUpRaA03S03 "Daily ICU demand Upper A03 S03 "
{txt}
{com}. label var DayIcdMeRaA03S04 "Daily ICU demand Mean A03 S04 "
{txt}
{com}. label var DayIcdLoRaA03S04 "Daily ICU demand Lower A03 S04 "
{txt}
{com}. label var DayIcdUpRaA03S04 "Daily ICU demand Upper A03 S04 "
{txt}
{com}. label var DayIcdMeRaA03S05 "Daily ICU demand Mean A03 S05 "
{txt}
{com}. label var DayIcdLoRaA03S05 "Daily ICU demand Lower A03 S05 "
{txt}
{com}. label var DayIcdUpRaA03S05 "Daily ICU demand Upper A03 S05 "
{txt}
{com}. label var DayIcdMeRaA03S06 "Daily ICU demand Mean A03 S06 "
{txt}
{com}. label var DayIcdLoRaA03S06 "Daily ICU demand Lower A03 S06 "
{txt}
{com}. label var DayIcdUpRaA03S06 "Daily ICU demand Upper A03 S06 "
{txt}
{com}. 
. label var DayIciMeRaA03S01 "Daily ICU incidence Mean A03 S01 "
{txt}
{com}. label var DayIciLoRaA03S01 "Daily ICU incidence Lower A03 S01 "
{txt}
{com}. label var DayIciUpRaA03S01 "Daily ICU incidence Upper A03 S01 "
{txt}
{com}. label var DayIciMeRaA03S02 "Daily ICU incidence Mean A03 S02 "
{txt}
{com}. label var DayIciLoRaA03S02 "Daily ICU incidence Lower A03 S02 "
{txt}
{com}. label var DayIciUpRaA03S02 "Daily ICU incidence Upper A03 S02 "
{txt}
{com}. label var DayIciMeRaA03S03 "Daily ICU incidence Mean A03 S03 "
{txt}
{com}. label var DayIciLoRaA03S03 "Daily ICU incidence Lower A03 S03 "
{txt}
{com}. label var DayIciUpRaA03S03 "Daily ICU incidence Upper A03 S03 "
{txt}
{com}. label var DayIciMeRaA03S04 "Daily ICU incidence Mean A03 S04 "
{txt}
{com}. label var DayIciLoRaA03S04 "Daily ICU incidence Lower A03 S04 "
{txt}
{com}. label var DayIciUpRaA03S04 "Daily ICU incidence Upper A03 S04 "
{txt}
{com}. label var DayIciMeRaA03S05 "Daily ICU incidence Mean A03 S05 "
{txt}
{com}. label var DayIciLoRaA03S05 "Daily ICU incidence Lower A03 S05 "
{txt}
{com}. label var DayIciUpRaA03S05 "Daily ICU incidence Upper A03 S05 "
{txt}
{com}. label var DayIciMeRaA03S06 "Daily ICU incidence Mean A03 S06 "
{txt}
{com}. label var DayIciLoRaA03S06 "Daily ICU incidence Lower A03 S06 "
{txt}
{com}. label var DayIciUpRaA03S06 "Daily ICU incidence Upper A03 S06 "
{txt}
{com}. 
. label var DayPreMeRaA03S01 "Daily prevalence Mean A03 S01 "
{txt}
{com}. label var DayPreLoRaA03S01 "Daily prevalence Lower A03 S01 "
{txt}
{com}. label var DayPreUpRaA03S01 "Daily prevalence Upper A03 S01 "
{txt}
{com}. label var DayPreMeRaA03S02 "Daily prevalence Mean A03 S02 "
{txt}
{com}. label var DayPreLoRaA03S02 "Daily prevalence Lower A03 S02 "
{txt}
{com}. label var DayPreUpRaA03S02 "Daily prevalence Upper A03 S02 "
{txt}
{com}. label var DayPreMeRaA03S03 "Daily prevalence Mean A03 S03 "
{txt}
{com}. label var DayPreLoRaA03S03 "Daily prevalence Lower A03 S03 "
{txt}
{com}. label var DayPreUpRaA03S03 "Daily prevalence Upper A03 S03 "
{txt}
{com}. label var DayPreMeRaA03S04 "Daily prevalence Mean A03 S04 "
{txt}
{com}. label var DayPreLoRaA03S04 "Daily prevalence Lower A03 S04 "
{txt}
{com}. label var DayPreUpRaA03S04 "Daily prevalence Upper A03 S04 "
{txt}
{com}. label var DayPreMeRaA03S05 "Daily prevalence Mean A03 S05 "
{txt}
{com}. label var DayPreLoRaA03S05 "Daily prevalence Lower A03 S05 "
{txt}
{com}. label var DayPreUpRaA03S05 "Daily prevalence Upper A03 S05 "
{txt}
{com}. label var DayPreMeRaA03S06 "Daily prevalence Mean A03 S06 "
{txt}
{com}. label var DayPreLoRaA03S06 "Daily prevalence Lower A03 S06 "
{txt}
{com}. label var DayPreUpRaA03S06 "Daily prevalence Upper A03 S06 "
{txt}
{com}. 
. label var DayRefMeRaA03S01 "Daily R effective Mean A03 S01 "
{txt}
{com}. label var DayRefLoRaA03S01 "Daily R effective Lower A03 S01 "
{txt}
{com}. label var DayRefUpRaA03S01 "Daily R effective Upper A03 S01 "
{txt}
{com}. label var DayRefMeRaA03S02 "Daily R effective Mean A03 S02 "
{txt}
{com}. label var DayRefLoRaA03S02 "Daily R effective Lower A03 S02 "
{txt}
{com}. label var DayRefUpRaA03S02 "Daily R effective Upper A03 S02 "
{txt}
{com}. label var DayRefMeRaA03S03 "Daily R effective Mean A03 S03 "
{txt}
{com}. label var DayRefLoRaA03S03 "Daily R effective Lower A03 S03 "
{txt}
{com}. label var DayRefUpRaA03S03 "Daily R effective Upper A03 S03 "
{txt}
{com}. label var DayRefMeRaA03S04 "Daily R effective Mean A03 S04 "
{txt}
{com}. label var DayRefLoRaA03S04 "Daily R effective Lower A03 S04 "
{txt}
{com}. label var DayRefUpRaA03S04 "Daily R effective Upper A03 S04 "
{txt}
{com}. label var DayRefMeRaA03S05 "Daily R effective Mean A03 S05 "
{txt}
{com}. label var DayRefLoRaA03S05 "Daily R effective Lower A03 S05 "
{txt}
{com}. label var DayRefUpRaA03S05 "Daily R effective Upper A03 S05 "
{txt}
{com}. label var DayRefMeRaA03S06 "Daily R effective Mean A03 S06 "
{txt}
{com}. label var DayRefLoRaA03S06 "Daily R effective Lower A03 S06 "
{txt}
{com}. label var DayRefUpRaA03S06 "Daily R effective Upper A03 S06 "
{txt}
{com}. 
. label var DayRttMeRaA03S01 "Daily R t Mean A03 S01 "
{txt}
{com}. label var DayRttLoRaA03S01 "Daily R t Lower A03 S01 "
{txt}
{com}. label var DayRttUpRaA03S01 "Daily R t Upper A03 S01 "
{txt}
{com}. label var DayRttMeRaA03S02 "Daily R t Mean A03 S02 "
{txt}
{com}. label var DayRttLoRaA03S02 "Daily R t Lower A03 S02 "
{txt}
{com}. label var DayRttUpRaA03S02 "Daily R t Upper A03 S02 "
{txt}
{com}. label var DayRttMeRaA03S03 "Daily R t Mean A03 S03 "
{txt}
{com}. label var DayRttLoRaA03S03 "Daily R t Lower A03 S03 "
{txt}
{com}. label var DayRttUpRaA03S03 "Daily R t Upper A03 S03 "
{txt}
{com}. label var DayRttMeRaA03S04 "Daily R t Mean A03 S04 "
{txt}
{com}. label var DayRttLoRaA03S04 "Daily R t Lower A03 S04 "
{txt}
{com}. label var DayRttUpRaA03S04 "Daily R t Upper A03 S04 "
{txt}
{com}. label var DayRttMeRaA03S05 "Daily R t Mean A03 S05 "
{txt}
{com}. label var DayRttLoRaA03S05 "Daily R t Lower A03 S05 "
{txt}
{com}. label var DayRttUpRaA03S05 "Daily R t Upper A03 S05 "
{txt}
{com}. label var DayRttMeRaA03S06 "Daily R t Mean A03 S06 "
{txt}
{com}. label var DayRttLoRaA03S06 "Daily R t Lower A03 S06 "
{txt}
{com}. label var DayRttUpRaA03S06 "Daily R t Upper A03 S06 "
{txt}
{com}. 
. 
. rename country loc_grand_name
{res}{txt}
{com}. 
. 
. 
. order ///
> loc_grand_name date     ///
> TotDeaMeRaA03S01        TotDeaLoRaA03S01        TotDeaUpRaA03S01        ///
> TotDeaMeRaA03S02        TotDeaLoRaA03S02        TotDeaUpRaA03S02        ///
> TotDeaMeRaA03S03        TotDeaLoRaA03S03        TotDeaUpRaA03S03        ///
> TotDeaMeRaA03S04        TotDeaLoRaA03S04        TotDeaUpRaA03S04        ///
> TotDeaMeRaA03S05        TotDeaLoRaA03S05        TotDeaUpRaA03S05        ///
> TotDeaMeRaA03S06        TotDeaLoRaA03S06        TotDeaUpRaA03S06        ///
> DayDeaMeRaA03S01        DayDeaLoRaA03S01        DayDeaUpRaA03S01        ///
> DayDeaMeRaA03S02        DayDeaLoRaA03S02        DayDeaUpRaA03S02        ///
> DayDeaMeRaA03S03        DayDeaLoRaA03S03        DayDeaUpRaA03S03        ///
> DayDeaMeRaA03S04        DayDeaLoRaA03S04        DayDeaUpRaA03S04        ///
> DayDeaMeRaA03S05        DayDeaLoRaA03S05        DayDeaUpRaA03S05        ///
> DayDeaMeRaA03S06        DayDeaLoRaA03S06        DayDeaUpRaA03S06        ///
> TotINFMeRaA03S01        TotINFLoRaA03S01        TotINFUpRaA03S01        ///
> TotINFMeRaA03S02        TotINFLoRaA03S02        TotINFUpRaA03S02        ///
> TotINFMeRaA03S03        TotINFLoRaA03S03        TotINFUpRaA03S03        ///
> TotINFMeRaA03S04        TotINFLoRaA03S04        TotINFUpRaA03S04        ///
> TotINFMeRaA03S05        TotINFLoRaA03S05        TotINFUpRaA03S05        ///
> TotINFMeRaA03S06        TotINFLoRaA03S06        TotINFUpRaA03S06        ///
> DayINFMeRaA03S01        DayINFLoRaA03S01        DayINFUpRaA03S01        ///
> DayINFMeRaA03S02        DayINFLoRaA03S02        DayINFUpRaA03S02        ///
> DayINFMeRaA03S03        DayINFLoRaA03S03        DayINFUpRaA03S03        ///
> DayINFMeRaA03S04        DayINFLoRaA03S04        DayINFUpRaA03S04        ///
> DayINFMeRaA03S05        DayINFLoRaA03S05        DayINFUpRaA03S05        ///
> DayINFMeRaA03S06        DayINFLoRaA03S06        DayINFUpRaA03S06
{txt}
{com}. 
. 
.  *
.  
.  
. * gen IFR
. 
. gen DayIFRMeRaA03S01 = 100 * DayDeaMeRaA03S01 / DayINFMeRaA03S01 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S01 = 100 * DayDeaLoRaA03S01 / DayINFLoRaA03S01 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S01 = 100 * DayDeaUpRaA03S01 / DayINFUpRaA03S01 
{txt}(1 missing value generated)

{com}. gen DayIFRMeRaA03S02 = 100 * DayDeaMeRaA03S02 / DayINFMeRaA03S02 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S02 = 100 * DayDeaLoRaA03S02 / DayINFLoRaA03S02 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S02 = 100 * DayDeaUpRaA03S02 / DayINFUpRaA03S02 
{txt}(1 missing value generated)

{com}. gen DayIFRMeRaA03S03 = 100 * DayDeaMeRaA03S03 / DayINFMeRaA03S03 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S03 = 100 * DayDeaLoRaA03S03 / DayINFLoRaA03S03 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S03 = 100 * DayDeaUpRaA03S03 / DayINFUpRaA03S03 
{txt}(1 missing value generated)

{com}. gen DayIFRMeRaA03S04 = 100 * DayDeaMeRaA03S04 / DayINFMeRaA03S04 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S04 = 100 * DayDeaLoRaA03S04 / DayINFLoRaA03S04 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S04 = 100 * DayDeaUpRaA03S04 / DayINFUpRaA03S04 
{txt}(1 missing value generated)

{com}. gen DayIFRMeRaA03S05 = 100 * DayDeaMeRaA03S05 / DayINFMeRaA03S05 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S05 = 100 * DayDeaLoRaA03S05 / DayINFLoRaA03S05 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S05 = 100 * DayDeaUpRaA03S05 / DayINFUpRaA03S05 
{txt}(1 missing value generated)

{com}. gen DayIFRMeRaA03S06 = 100 * DayDeaMeRaA03S06 / DayINFMeRaA03S06 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S06 = 100 * DayDeaLoRaA03S06 / DayINFLoRaA03S06 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S06 = 100 * DayDeaUpRaA03S06 / DayINFUpRaA03S06 
{txt}(1 missing value generated)

{com}. 
. label var DayIFRMeRaA03S01 "Daily IFR Mean A03 S01 "
{txt}
{com}. label var DayIFRLoRaA03S01 "Daily IFR Lower A03 S01 "
{txt}
{com}. label var DayIFRUpRaA03S01 "Daily IFR Upper A03 S01 "
{txt}
{com}. label var DayIFRMeRaA03S02 "Daily IFR Mean A03 S02 "
{txt}
{com}. label var DayIFRLoRaA03S02 "Daily IFR Lower A03 S02 "
{txt}
{com}. label var DayIFRUpRaA03S02 "Daily IFR Upper A03 S02 "
{txt}
{com}. label var DayIFRMeRaA03S03 "Daily IFR Mean A03 S03 "
{txt}
{com}. label var DayIFRLoRaA03S03 "Daily IFR Lower A03 S03 "
{txt}
{com}. label var DayIFRUpRaA03S03 "Daily IFR Upper A03 S03 "
{txt}
{com}. label var DayIFRMeRaA03S04 "Daily IFR Mean A03 S04 "
{txt}
{com}. label var DayIFRLoRaA03S04 "Daily IFR Lower A03 S04 "
{txt}
{com}. label var DayIFRUpRaA03S04 "Daily IFR Upper A03 S04 "
{txt}
{com}. label var DayIFRMeRaA03S05 "Daily IFR Mean A03 S05 "
{txt}
{com}. label var DayIFRLoRaA03S05 "Daily IFR Lower A03 S05 "
{txt}
{com}. label var DayIFRUpRaA03S05 "Daily IFR Upper A03 S05 "
{txt}
{com}. label var DayIFRMeRaA03S06 "Daily IFR Mean A03 S06 "
{txt}
{com}. label var DayIFRLoRaA03S06 "Daily IFR Lower A03 S06 "
{txt}
{com}. label var DayIFRUpRaA03S06 "Daily IFR Upper A03 S06 "
{txt}
{com}. 
. 
. 
. 
. 
. * gen "Daily infections mean div by daily deaths mean IMPE DayCbD" for visulization of temporal relation of deaths and infections peaks 
. 
. 
. summ DayDeaMeRaA03S02 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~02 {c |}{res}        806     2269.32    1636.368          0    5609.92
{txt}
{com}. gen DayDeMMeRaA03S02 = r(mean)
{txt}
{com}. label var DayDeMMeRaA03S02 "Daily deaths mean IMPE DayDeM"
{txt}
{com}. 
. summ DayINFMeRaA03S02 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayINFMeR~02 {c |}{res}        806    605077.3    385645.4        .14    1340725
{txt}
{com}. gen DayCaMMeRaA03S02 = r(mean)
{txt}
{com}. label var DayCaMMeRaA03S02 "Daily infections mean IMPE DayCaM"
{txt}
{com}.                            
. gen DayCbDMeRaA03S02 = DayCaMMeRaA03S02 / DayDeMMeRaA03S02
{txt}
{com}. label var DayCbDMeRaA03S02 "Daily infections mean div by daily deaths mean IMPE DayCbD"
{txt}
{com}. summ DayCbDMeRaA03S02

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~02 {c |}{res}        807    266.6337           0   266.6337   266.6337
{txt}
{com}.                                               
. gen DayDMuMeRaA03S02 = DayDeaMeRaA03S02 * DayCbDMeRaA03S02
{txt}(1 missing value generated)

{com}. label var DayDMuMeRaA03S02 "Daily deaths scaled (times means of infections by deaths) IMPE"
{txt}
{com}. summ DayDMuMeRaA03S02

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~02 {c |}{res}        806    605077.3    436310.9          0    1495794
{txt}
{com}. 
. 
. 
. 
. 
. sort date loc_grand_name
{txt}
{com}. 
. order date loc_grand_name
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "IMPE EURO.dta", replace
{txt}file IMPE EURO.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *****************************
. 
. * gen SEARO
. 
. use "IMPE.dta", clear
{txt}
{com}. 
. rename country loc_grand_name
{res}{txt}
{com}. 
. keep if ///
> loc_grand_name == "Bangladesh" | ///
> loc_grand_name == "Bhutan" | ///
> loc_grand_name == "India" | ///
> loc_grand_name == "Indonesia" | ///
> loc_grand_name == "Maldives" | ///
> loc_grand_name == "Myanmar" | ///
> loc_grand_name == "Nepal" | ///
> loc_grand_name == "North Korea" | ///
> loc_grand_name == "Sri Lanka" | ///
> loc_grand_name == "Thailand" | ///
> loc_grand_name == "Timor-Leste" 
{txt}(8,190,132 observations deleted)

{com}. 
. 
. 
. 
. 
. collapse (sum) y_025 y_25 y_median y_mean y_75 y_975, by(date compartment scenario) 
{txt}
{com}. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. 
. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2)
{txt}
{com}. egen dateblock = concat(year month day)
{txt}
{com}. drop year month day
{txt}
{com}. 
. 
. * rename uncertainty limits
. 
. rename y_025    y_025_
{res}{txt}
{com}. rename y_25     y_250_
{res}{txt}
{com}. rename y_median y_med_
{res}{txt}
{com}. rename y_mean   y_mea_
{res}{txt}
{com}. rename y_75     y_750_
{res}{txt}
{com}. rename y_975    y_975_
{res}{txt}
{com}. 
. 
. foreach var of varlist y_025-y_975 {c -(}
{txt}  2{com}.         ds `var'
{txt}  3{com}.         label variable `var' `r(varlist)'
{txt}  4{com}. {c )-}
{txt}{col 1}y_025_
{col 1}y_250_
{col 1}y_med_
{col 1}y_mea_
{col 1}y_750_
{col 1}y_975_

{com}. *
. 
. 
. 
. * rename scenarios 
. 
. tab scenario 

                  {txt}scenario {c |}      Freq.     Percent        Cum.
{hline 27}{c +}{hline 35}
       Maintain Status Quo {c |}{res}      8,653       16.67       16.67
{txt}                Optimistic {c |}{res}      8,653       16.67       33.33
{txt}               Pessimistic {c |}{res}      8,653       16.67       50.00
{txt}Surged Maintain Status Quo {c |}{res}      8,653       16.67       66.67
{txt}         Surged Optimistic {c |}{res}      8,653       16.67       83.33
{txt}        Surged Pessimistic {c |}{res}      8,653       16.67      100.00
{txt}{hline 27}{c +}{hline 35}
                     Total {c |}{res}     51,918      100.00
{txt}
{com}. 
. 
. /*
> Scenarios:
> 
> S1  "Additional 50% Reduction"                  "S1_Add_Half_Reduction"
> S2  "Maintain Status Quo"                               "S2_Maintain_Staus_Quo"
> S3  "Relax Interventions 50%"                   "S3_Relax_Half_Intervention"
> 
> S4  "Surged Additional 50% Reduction"   "S4_Surged_Add_Half_Reduction"
> S5  "Surged Maintain Status Quo"                "S5_Surged_Maintain_Staus_Quo"
> S6  "Surged Relax Interventions 50%"    "S6_Surged_Relax_Half_Intervention"
> 
> With IMPE update 20211103 (2021-12-13_v9.csv.zip) released on 20211110., IMPE has new terms for their scenarios:
> 
> S1      Optimistic
> S2      Maintain Status Quo
> S3      Pessimistic
> 
> S4      Surged Optimistic
> S5      Surged Maintain Status Quo
> S6      Surged Pessimistic
> */
. 
. 
. gen scenario_snail = ""
{txt}(51,918 missing values generated)

{com}. replace scenario_snail = "S1" if scenario == "Optimistic"
{txt}variable {bf}scenario_snail{sf} was {bf}{res}str1{sf}{txt} now {bf}{res}str2{sf}
{txt}(8,653 real changes made)

{com}. replace scenario_snail = "S2" if scenario == "Maintain Status Quo"
{txt}(8,653 real changes made)

{com}. replace scenario_snail = "S3" if scenario == "Pessimistic"
{txt}(8,653 real changes made)

{com}. replace scenario_snail = "S4" if scenario == "Surged Optimistic"
{txt}(8,653 real changes made)

{com}. replace scenario_snail = "S5" if scenario == "Surged Maintain Status Quo"
{txt}(8,653 real changes made)

{com}. replace scenario_snail = "S6" if scenario == "Surged Pessimistic"
{txt}(8,653 real changes made)

{com}. 
. 
. gen underline = "_"
{txt}
{com}. egen scenario_snail_dateblock = concat(scenario_snail underline dateblock)
{txt}
{com}. 
. drop date_original scenario
{txt}
{com}. 
. drop scenario_snail_dateblock 
{txt}
{com}.   
. drop y_250_ y_med_ y_750_
{txt}
{com}.  
. 
. * Primary outcomes Total Deaths, Total infections, Daily Deaths, and Daily infections
. 
. replace compartment = "cumul_death" if compartment == "cumulative_deaths"
{txt}(4,716 real changes made)

{com}. replace compartment = "cumul_infec" if compartment == "cumulative_infections"
{txt}(4,716 real changes made)

{com}. replace compartment = "daily_death" if compartment == "deaths"
{txt}(4,716 real changes made)

{com}. replace compartment = "daily_infec" if compartment == "infections"
{txt}(4,716 real changes made)

{com}. 
. 
. * other outcomes
. 
. replace compartment = "icu___deman" if compartment == "ICU_demand"                      // Icd
{txt}(4,722 real changes made)

{com}. replace compartment = "icu___incid" if compartment == "ICU_incidence"           // Ici
{txt}(4,722 real changes made)

{com}. replace compartment = "reff_______" if compartment == "Reff"                            // Ref
{txt}(4,722 real changes made)

{com}. replace compartment = "rt_________" if compartment == "Rt"                                      // Rtt
{txt}(4,722 real changes made)

{com}. replace compartment = "hospi_deman" if compartment == "hospital_demand"         // Hod
{txt}(4,722 real changes made)

{com}. replace compartment = "hospi_incid" if compartment == "hospital_incidence"  // Hoi
{txt}(4,722 real changes made)

{com}. replace compartment = "preval_____" if compartment == "prevalence"                      // Pre
{txt}(4,722 real changes made)

{com}. 
. 
. 
. duplicates drop date compartment scenario, force

{p 0 4}{txt}Duplicates in terms of {res} dateblock compartment scenario_snail{p_end}

{txt}(0 observations are duplicates)

{com}. 
. * reshape
. 
. egen compartment_scenario_snail = concat(compartment underline scenario_snail)  
{txt}
{com}. 
. drop compartment underline scenario_snail
{txt}
{com}. 
. tab compartment_scenario_snail

{txt}compartment_sc {c |}
  enario_snail {c |}      Freq.     Percent        Cum.
{hline 15}{c +}{hline 35}
cumul_death_S1 {c |}{res}        786        1.51        1.51
{txt}cumul_death_S2 {c |}{res}        786        1.51        3.03
{txt}cumul_death_S3 {c |}{res}        786        1.51        4.54
{txt}cumul_death_S4 {c |}{res}        786        1.51        6.06
{txt}cumul_death_S5 {c |}{res}        786        1.51        7.57
{txt}cumul_death_S6 {c |}{res}        786        1.51        9.08
{txt}cumul_infec_S1 {c |}{res}        786        1.51       10.60
{txt}cumul_infec_S2 {c |}{res}        786        1.51       12.11
{txt}cumul_infec_S3 {c |}{res}        786        1.51       13.63
{txt}cumul_infec_S4 {c |}{res}        786        1.51       15.14
{txt}cumul_infec_S5 {c |}{res}        786        1.51       16.65
{txt}cumul_infec_S6 {c |}{res}        786        1.51       18.17
{txt}daily_death_S1 {c |}{res}        786        1.51       19.68
{txt}daily_death_S2 {c |}{res}        786        1.51       21.19
{txt}daily_death_S3 {c |}{res}        786        1.51       22.71
{txt}daily_death_S4 {c |}{res}        786        1.51       24.22
{txt}daily_death_S5 {c |}{res}        786        1.51       25.74
{txt}daily_death_S6 {c |}{res}        786        1.51       27.25
{txt}daily_infec_S1 {c |}{res}        786        1.51       28.76
{txt}daily_infec_S2 {c |}{res}        786        1.51       30.28
{txt}daily_infec_S3 {c |}{res}        786        1.51       31.79
{txt}daily_infec_S4 {c |}{res}        786        1.51       33.31
{txt}daily_infec_S5 {c |}{res}        786        1.51       34.82
{txt}daily_infec_S6 {c |}{res}        786        1.51       36.33
{txt}hospi_deman_S1 {c |}{res}        787        1.52       37.85
{txt}hospi_deman_S2 {c |}{res}        787        1.52       39.37
{txt}hospi_deman_S3 {c |}{res}        787        1.52       40.88
{txt}hospi_deman_S4 {c |}{res}        787        1.52       42.40
{txt}hospi_deman_S5 {c |}{res}        787        1.52       43.91
{txt}hospi_deman_S6 {c |}{res}        787        1.52       45.43
{txt}hospi_incid_S1 {c |}{res}        787        1.52       46.95
{txt}hospi_incid_S2 {c |}{res}        787        1.52       48.46
{txt}hospi_incid_S3 {c |}{res}        787        1.52       49.98
{txt}hospi_incid_S4 {c |}{res}        787        1.52       51.49
{txt}hospi_incid_S5 {c |}{res}        787        1.52       53.01
{txt}hospi_incid_S6 {c |}{res}        787        1.52       54.52
{txt}icu___deman_S1 {c |}{res}        787        1.52       56.04
{txt}icu___deman_S2 {c |}{res}        787        1.52       57.56
{txt}icu___deman_S3 {c |}{res}        787        1.52       59.07
{txt}icu___deman_S4 {c |}{res}        787        1.52       60.59
{txt}icu___deman_S5 {c |}{res}        787        1.52       62.10
{txt}icu___deman_S6 {c |}{res}        787        1.52       63.62
{txt}icu___incid_S1 {c |}{res}        787        1.52       65.14
{txt}icu___incid_S2 {c |}{res}        787        1.52       66.65
{txt}icu___incid_S3 {c |}{res}        787        1.52       68.17
{txt}icu___incid_S4 {c |}{res}        787        1.52       69.68
{txt}icu___incid_S5 {c |}{res}        787        1.52       71.20
{txt}icu___incid_S6 {c |}{res}        787        1.52       72.71
{txt}preval______S1 {c |}{res}        787        1.52       74.23
{txt}preval______S2 {c |}{res}        787        1.52       75.75
{txt}preval______S3 {c |}{res}        787        1.52       77.26
{txt}preval______S4 {c |}{res}        787        1.52       78.78
{txt}preval______S5 {c |}{res}        787        1.52       80.29
{txt}preval______S6 {c |}{res}        787        1.52       81.81
{txt}reff________S1 {c |}{res}        787        1.52       83.33
{txt}reff________S2 {c |}{res}        787        1.52       84.84
{txt}reff________S3 {c |}{res}        787        1.52       86.36
{txt}reff________S4 {c |}{res}        787        1.52       87.87
{txt}reff________S5 {c |}{res}        787        1.52       89.39
{txt}reff________S6 {c |}{res}        787        1.52       90.90
{txt}rt__________S1 {c |}{res}        787        1.52       92.42
{txt}rt__________S2 {c |}{res}        787        1.52       93.94
{txt}rt__________S3 {c |}{res}        787        1.52       95.45
{txt}rt__________S4 {c |}{res}        787        1.52       96.97
{txt}rt__________S5 {c |}{res}        787        1.52       98.48
{txt}rt__________S6 {c |}{res}        787        1.52      100.00
{txt}{hline 15}{c +}{hline 35}
         Total {c |}{res}     51,918      100.00
{txt}
{com}. 
. gen country = "SEARO"
{txt}
{com}. 
. reshape wide y_025_   y_mea_  y_975_, i(country dateblock) j(compartment_scenario_snail) string
{txt}(note: j = cumul_death_S1 cumul_death_S2 cumul_death_S3 cumul_death_S4 cumul_death_S5 cumul_death_S6 cumul_infec_S1 cumul_infec_S2 cumul_infec_S3 cumul_infec_S4 cumul_infec_S5 cumul_infec_S6 daily_death_S1 daily_death_S2 daily_death_S3 daily_death_S4 daily_death_S5 daily_death_S6 daily_infec_S1 daily_infec_S2 daily_infec_S3 daily_infec_S4 daily_infec_S5 daily_infec_S6 hospi_deman_S1 hospi_deman_S2 hospi_deman_S3 hospi_deman_S4 hospi_deman_S5 hospi_deman_S6 hospi_incid_S1 hospi_incid_S2 hospi_incid_S3 hospi_incid_S4 hospi_incid_S5 hospi_incid_S6 icu___deman_S1 icu___deman_S2 icu___deman_S3 icu___deman_S4 icu___deman_S5 icu___deman_S6 icu___incid_S1 icu___incid_S2 icu___incid_S3 icu___incid_S4 icu___incid_S5 icu___incid_S6 preval______S1 preval______S2 preval______S3 preval______S4 preval______S5 preval______S6 reff________S1 reff________S2 reff________S3 reff________S4 reff________S5 reff________S6 rt__________S1 rt__________S2 rt__________S3 rt__________S4 rt__________S5 rt__________S6)

Data{col 36}long{col 43}->{col 48}wide
{hline 77}
Number of obs.                 {res}   51918   {txt}->{res}     787
{txt}Number of variables            {res}       6   {txt}->{res}     200
{txt}j variable (66 values){res}compartment_scenario_snail{txt}->(dropped)
xij variables:
                                 {res}y_025_   {txt}->   {res}y_025_cumul_death_S1 y_025_cumul_death_S2 ... y_025_rt__________S6
                                 y_mea_   {txt}->   {res}y_mea_cumul_death_S1 y_mea_cumul_death_S2 ... y_mea_rt__________S6
                                 y_975_   {txt}->   {res}y_975_cumul_death_S1 y_975_cumul_death_S2 ... y_975_rt__________S6
{txt}{hline 77}

{com}. 
. 
. *
. 
. 
. 
. foreach v of varlist y_025_cumul_death_S1-y_975_rt__________S6 {c -(} 
{txt}  2{com}. 
.         local first = substr("`v'", 7, 11) 
{txt}  3{com}.         local second = substr("`v'", 6, 1)
{txt}  4{com}.         local third  = substr("`v'", 1, 5)
{txt}  5{com}.         local fourth = substr("`v'", 19, 2)
{txt}  6{com}.         label var `v' "`first'`second'`third'`second'`fourth'"
{txt}  7{com}. {c )-} 
{txt}
{com}. *
. 
. 
. 
. foreach v of varlist y_025_cumul_death_S1-y_975_rt__________S6 {c -(} 
{txt}  2{com}.         di `"`: var label `v''"' 
{txt}  3{com}.         local fifth `"`: var label `v''"'
{txt}  4{com}.         rename `v'   `fifth'
{txt}  5{com}. {c )-}
cumul_death_y_025_S1
{res}cumul_death_y_mea_S1
cumul_death_y_975_S1
cumul_death_y_025_S2
cumul_death_y_mea_S2
cumul_death_y_975_S2
cumul_death_y_025_S3
cumul_death_y_mea_S3
cumul_death_y_975_S3
cumul_death_y_025_S4
cumul_death_y_mea_S4
cumul_death_y_975_S4
cumul_death_y_025_S5
cumul_death_y_mea_S5
cumul_death_y_975_S5
cumul_death_y_025_S6
cumul_death_y_mea_S6
cumul_death_y_975_S6
cumul_infec_y_025_S1
cumul_infec_y_mea_S1
cumul_infec_y_975_S1
cumul_infec_y_025_S2
cumul_infec_y_mea_S2
cumul_infec_y_975_S2
cumul_infec_y_025_S3
cumul_infec_y_mea_S3
cumul_infec_y_975_S3
cumul_infec_y_025_S4
cumul_infec_y_mea_S4
cumul_infec_y_975_S4
cumul_infec_y_025_S5
cumul_infec_y_mea_S5
cumul_infec_y_975_S5
cumul_infec_y_025_S6
cumul_infec_y_mea_S6
cumul_infec_y_975_S6
daily_death_y_025_S1
daily_death_y_mea_S1
daily_death_y_975_S1
daily_death_y_025_S2
daily_death_y_mea_S2
daily_death_y_975_S2
daily_death_y_025_S3
daily_death_y_mea_S3
daily_death_y_975_S3
daily_death_y_025_S4
daily_death_y_mea_S4
daily_death_y_975_S4
daily_death_y_025_S5
daily_death_y_mea_S5
daily_death_y_975_S5
daily_death_y_025_S6
daily_death_y_mea_S6
daily_death_y_975_S6
daily_infec_y_025_S1
daily_infec_y_mea_S1
daily_infec_y_975_S1
daily_infec_y_025_S2
daily_infec_y_mea_S2
daily_infec_y_975_S2
daily_infec_y_025_S3
daily_infec_y_mea_S3
daily_infec_y_975_S3
daily_infec_y_025_S4
daily_infec_y_mea_S4
daily_infec_y_975_S4
daily_infec_y_025_S5
daily_infec_y_mea_S5
daily_infec_y_975_S5
daily_infec_y_025_S6
daily_infec_y_mea_S6
daily_infec_y_975_S6
hospi_deman_y_025_S1
hospi_deman_y_mea_S1
hospi_deman_y_975_S1
hospi_deman_y_025_S2
hospi_deman_y_mea_S2
hospi_deman_y_975_S2
hospi_deman_y_025_S3
hospi_deman_y_mea_S3
hospi_deman_y_975_S3
hospi_deman_y_025_S4
hospi_deman_y_mea_S4
hospi_deman_y_975_S4
hospi_deman_y_025_S5
hospi_deman_y_mea_S5
hospi_deman_y_975_S5
hospi_deman_y_025_S6
hospi_deman_y_mea_S6
hospi_deman_y_975_S6
hospi_incid_y_025_S1
hospi_incid_y_mea_S1
hospi_incid_y_975_S1
hospi_incid_y_025_S2
hospi_incid_y_mea_S2
hospi_incid_y_975_S2
hospi_incid_y_025_S3
hospi_incid_y_mea_S3
hospi_incid_y_975_S3
hospi_incid_y_025_S4
hospi_incid_y_mea_S4
hospi_incid_y_975_S4
hospi_incid_y_025_S5
hospi_incid_y_mea_S5
hospi_incid_y_975_S5
hospi_incid_y_025_S6
hospi_incid_y_mea_S6
hospi_incid_y_975_S6
icu___deman_y_025_S1
icu___deman_y_mea_S1
icu___deman_y_975_S1
icu___deman_y_025_S2
icu___deman_y_mea_S2
icu___deman_y_975_S2
icu___deman_y_025_S3
icu___deman_y_mea_S3
icu___deman_y_975_S3
icu___deman_y_025_S4
icu___deman_y_mea_S4
icu___deman_y_975_S4
icu___deman_y_025_S5
icu___deman_y_mea_S5
icu___deman_y_975_S5
icu___deman_y_025_S6
icu___deman_y_mea_S6
icu___deman_y_975_S6
icu___incid_y_025_S1
icu___incid_y_mea_S1
icu___incid_y_975_S1
icu___incid_y_025_S2
icu___incid_y_mea_S2
icu___incid_y_975_S2
icu___incid_y_025_S3
icu___incid_y_mea_S3
icu___incid_y_975_S3
icu___incid_y_025_S4
icu___incid_y_mea_S4
icu___incid_y_975_S4
icu___incid_y_025_S5
icu___incid_y_mea_S5
icu___incid_y_975_S5
icu___incid_y_025_S6
icu___incid_y_mea_S6
icu___incid_y_975_S6
preval______y_025_S1
preval______y_mea_S1
preval______y_975_S1
preval______y_025_S2
preval______y_mea_S2
preval______y_975_S2
preval______y_025_S3
preval______y_mea_S3
preval______y_975_S3
preval______y_025_S4
preval______y_mea_S4
preval______y_975_S4
preval______y_025_S5
preval______y_mea_S5
preval______y_975_S5
preval______y_025_S6
preval______y_mea_S6
preval______y_975_S6
reff________y_025_S1
reff________y_mea_S1
reff________y_975_S1
reff________y_025_S2
reff________y_mea_S2
reff________y_975_S2
reff________y_025_S3
reff________y_mea_S3
reff________y_975_S3
reff________y_025_S4
reff________y_mea_S4
reff________y_975_S4
reff________y_025_S5
reff________y_mea_S5
reff________y_975_S5
reff________y_025_S6
reff________y_mea_S6
reff________y_975_S6
rt__________y_025_S1
rt__________y_mea_S1
rt__________y_975_S1
rt__________y_025_S2
rt__________y_mea_S2
rt__________y_975_S2
rt__________y_025_S3
rt__________y_mea_S3
rt__________y_975_S3
rt__________y_025_S4
rt__________y_mea_S4
rt__________y_975_S4
rt__________y_025_S5
rt__________y_mea_S5
rt__________y_975_S5
rt__________y_025_S6
rt__________y_mea_S6
rt__________y_975_S6
{txt}
{com}. *
. 
. 
. * gen date
. 
. gen year = substr(dateblock,1,4) 
{txt}
{com}. gen month = substr(dateblock,5,2) 
{txt}
{com}. gen day = substr(dateblock,7,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21930{txt},{res}22716{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}16jan2020{txt},{res}12mar2022{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}787{col 51}{txt}missing .:  {res}0{txt}/{res}787

{txt}{col 19}mean:{res}{col 26}   22323{txt} = {res}12feb2021{txt}
{col 15}std. dev:{res}{col 26} 227.332

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   22008{col 37}   22126{col 47}   22323{col 57}   22520{col 67}   22638
{col 26}03apr2020{col 36}30jul2020{col 46}12feb2021{col 56}28aug2021{col 66}24dec2021
{txt}
{com}. 
. 
. 
. * 
. 
. 
. * -renvars- somanyvars rather time consuming
. 
. foreach v of varlist cumul_death_y_025_S1-rt__________y_975_S6 {c -(} 
{txt}  2{com}. 
.     qui renvars, presub(cumul_death_y_025_ TotDeaLoRa)
{txt}  3{com}.     qui renvars, presub(cumul_death_y_975_ TotDeaUpRa)
{txt}  4{com}.     qui renvars, presub(cumul_death_y_mea_ TotDeaMeRa)
{txt}  5{com}. 
.         qui renvars, presub(daily_death_y_025_ DayDeaLoRa)
{txt}  6{com}.         qui renvars, presub(daily_death_y_975_ DayDeaUpRa)
{txt}  7{com}.         qui renvars, presub(daily_death_y_mea_ DayDeaMeRa)
{txt}  8{com}.         
.     qui renvars, presub(cumul_infec_y_025_ TotINFLoRa)
{txt}  9{com}.     qui renvars, presub(cumul_infec_y_975_ TotINFUpRa)
{txt} 10{com}.     qui renvars, presub(cumul_infec_y_mea_ TotINFMeRa)
{txt} 11{com}.         
.         qui renvars, presub(daily_infec_y_025_ DayINFLoRa)
{txt} 12{com}.         qui renvars, presub(daily_infec_y_975_ DayINFUpRa)
{txt} 13{com}.         qui renvars, presub(daily_infec_y_mea_ DayINFMeRa)
{txt} 14{com}.         
.         * other outcomes
.         
.         qui renvars, presub(icu___deman_y_025_ DayIcdLoRa) // "ICU_demand" 
{txt} 15{com}.         qui renvars, presub(icu___deman_y_975_ DayIcdUpRa)
{txt} 16{com}.         qui renvars, presub(icu___deman_y_mea_ DayIcdMeRa)
{txt} 17{com}.         
.         qui renvars, presub(icu___incid_y_025_ DayIciLoRa) // "ICU_incidence"
{txt} 18{com}.         qui renvars, presub(icu___incid_y_975_ DayIciUpRa)
{txt} 19{com}.         qui renvars, presub(icu___incid_y_mea_ DayIciMeRa)
{txt} 20{com}.         
.         qui renvars, presub(reff________y_025_ DayRefLoRa) // "Reff"
{txt} 21{com}.         qui renvars, presub(reff________y_975_ DayRefUpRa)
{txt} 22{com}.         qui renvars, presub(reff________y_mea_ DayRefMeRa)
{txt} 23{com}.         
.         qui renvars, presub(rt__________y_025_ DayRttLoRa) // "Rt"
{txt} 24{com}.         qui renvars, presub(rt__________y_975_ DayRttUpRa)
{txt} 25{com}.         qui renvars, presub(rt__________y_mea_ DayRttMeRa)
{txt} 26{com}.         
.         qui renvars, presub(hospi_deman_y_025_ DayHodLoRa) // "hospital_demand"
{txt} 27{com}.         qui renvars, presub(hospi_deman_y_975_ DayHodUpRa)
{txt} 28{com}.         qui renvars, presub(hospi_deman_y_mea_ DayHodMeRa)
{txt} 29{com}.         
.         qui renvars, presub(hospi_incid_y_025_ DayHoiLoRa) // "hospital_incidence"
{txt} 30{com}.         qui renvars, presub(hospi_incid_y_975_ DayHoiUpRa)
{txt} 31{com}.         qui renvars, presub(hospi_incid_y_mea_ DayHoiMeRa)
{txt} 32{com}.         
.         qui renvars, presub(preval______y_025_ DayPreLoRa) // "prevalence"
{txt} 33{com}.         qui renvars, presub(preval______y_975_ DayPreUpRa)
{txt} 34{com}.         qui renvars, presub(preval______y_mea_ DayPreMeRa)
{txt} 35{com}.         
.         qui renvars, postsub(S1 A03S01) 
{txt} 36{com}.         qui renvars, postsub(S2 A03S02) 
{txt} 37{com}.         qui renvars, postsub(S3 A03S03) 
{txt} 38{com}.         qui renvars, postsub(S4 A03S04) 
{txt} 39{com}.         qui renvars, postsub(S5 A03S05) 
{txt} 40{com}.         qui renvars, postsub(S6 A03S06) 
{txt} 41{com}.         
.         * "Wait Note: renvars are working ..."
.         
. {c )-} 
{txt}
{com}. *   
. 
. 
. 
. *
. 
. drop year month day date2 dateblock
{txt}
{com}. 
. order date  
{txt}
{com}. 
. label var DayINFLoRaA03S01 "Daily infections Lower A03 S01 "
{txt}
{com}. label var DayINFLoRaA03S02 "Daily infections Lower A03 S02 "
{txt}
{com}. label var DayINFLoRaA03S03 "Daily infections Lower A03 S03 "
{txt}
{com}. label var DayINFLoRaA03S04 "Daily infections Lower A03 S04 "
{txt}
{com}. label var DayINFLoRaA03S05 "Daily infections Lower A03 S05 "
{txt}
{com}. label var DayINFLoRaA03S06 "Daily infections Lower A03 S06 "
{txt}
{com}. label var DayINFMeRaA03S01 "Daily infections Mean A03 S01 "
{txt}
{com}. label var DayINFMeRaA03S02 "Daily infections Mean A03 S02 "
{txt}
{com}. label var DayINFMeRaA03S03 "Daily infections Mean A03 S03 "
{txt}
{com}. label var DayINFMeRaA03S04 "Daily infections Mean A03 S04 "
{txt}
{com}. label var DayINFMeRaA03S05 "Daily infections Mean A03 S05 "
{txt}
{com}. label var DayINFMeRaA03S06 "Daily infections Mean A03 S06 "
{txt}
{com}. label var DayINFUpRaA03S01 "Daily infections Upper A03 S01 "
{txt}
{com}. label var DayINFUpRaA03S02 "Daily infections Upper A03 S02 "
{txt}
{com}. label var DayINFUpRaA03S03 "Daily infections Upper A03 S03 "
{txt}
{com}. label var DayINFUpRaA03S04 "Daily infections Upper A03 S04 "
{txt}
{com}. label var DayINFUpRaA03S05 "Daily infections Upper A03 S05 "
{txt}
{com}. label var DayINFUpRaA03S06 "Daily infections Upper A03 S06 "
{txt}
{com}. label var DayDeaLoRaA03S01 "Daily Deaths Lower A03 S01 "
{txt}
{com}. label var DayDeaLoRaA03S02 "Daily Deaths Lower A03 S02 "
{txt}
{com}. label var DayDeaLoRaA03S03 "Daily Deaths Lower A03 S03 "
{txt}
{com}. label var DayDeaLoRaA03S04 "Daily Deaths Lower A03 S04 "
{txt}
{com}. label var DayDeaLoRaA03S05 "Daily Deaths Lower A03 S05 "
{txt}
{com}. label var DayDeaLoRaA03S06 "Daily Deaths Lower A03 S06 "
{txt}
{com}. label var DayDeaMeRaA03S01 "Daily Deaths Mean A03 S01 "
{txt}
{com}. label var DayDeaMeRaA03S02 "Daily Deaths Mean A03 S02 "
{txt}
{com}. label var DayDeaMeRaA03S03 "Daily Deaths Mean A03 S03 "
{txt}
{com}. label var DayDeaMeRaA03S04 "Daily Deaths Mean A03 S04 "
{txt}
{com}. label var DayDeaMeRaA03S05 "Daily Deaths Mean A03 S05 "
{txt}
{com}. label var DayDeaMeRaA03S06 "Daily Deaths Mean A03 S06 "
{txt}
{com}. label var DayDeaUpRaA03S01 "Daily Deaths Upper A03 S01 "
{txt}
{com}. label var DayDeaUpRaA03S02 "Daily Deaths Upper A03 S02 "
{txt}
{com}. label var DayDeaUpRaA03S03 "Daily Deaths Upper A03 S03 "
{txt}
{com}. label var DayDeaUpRaA03S04 "Daily Deaths Upper A03 S04 "
{txt}
{com}. label var DayDeaUpRaA03S05 "Daily Deaths Upper A03 S05 "
{txt}
{com}. label var DayDeaUpRaA03S06 "Daily Deaths Upper A03 S06 "
{txt}
{com}. label var TotINFLoRaA03S01 "Total infections Lower A03 S01 "
{txt}
{com}. label var TotINFLoRaA03S02 "Total infections Lower A03 S02 "
{txt}
{com}. label var TotINFLoRaA03S03 "Total infections Lower A03 S03 "
{txt}
{com}. label var TotINFLoRaA03S04 "Total infections Lower A03 S04 "
{txt}
{com}. label var TotINFLoRaA03S05 "Total infections Lower A03 S05 "
{txt}
{com}. label var TotINFLoRaA03S06 "Total infections Lower A03 S06 "
{txt}
{com}. label var TotINFMeRaA03S01 "Total infections Mean A03 S01 "
{txt}
{com}. label var TotINFMeRaA03S02 "Total infections Mean A03 S02 "
{txt}
{com}. label var TotINFMeRaA03S03 "Total infections Mean A03 S03 "
{txt}
{com}. label var TotINFMeRaA03S04 "Total infections Mean A03 S04 "
{txt}
{com}. label var TotINFMeRaA03S05 "Total infections Mean A03 S05 "
{txt}
{com}. label var TotINFMeRaA03S06 "Total infections Mean A03 S06 "
{txt}
{com}. label var TotINFUpRaA03S01 "Total infections Upper A03 S01 "
{txt}
{com}. label var TotINFUpRaA03S02 "Total infections Upper A03 S02 "
{txt}
{com}. label var TotINFUpRaA03S03 "Total infections Upper A03 S03 "
{txt}
{com}. label var TotINFUpRaA03S04 "Total infections Upper A03 S04 "
{txt}
{com}. label var TotINFUpRaA03S05 "Total infections Upper A03 S05 "
{txt}
{com}. label var TotINFUpRaA03S06 "Total infections Upper A03 S06 "
{txt}
{com}. label var TotDeaLoRaA03S01 "Total Deaths Lower A03 S01 "
{txt}
{com}. label var TotDeaLoRaA03S02 "Total Deaths Lower A03 S02 "
{txt}
{com}. label var TotDeaLoRaA03S03 "Total Deaths Lower A03 S03 "
{txt}
{com}. label var TotDeaLoRaA03S04 "Total Deaths Lower A03 S04 "
{txt}
{com}. label var TotDeaLoRaA03S05 "Total Deaths Lower A03 S05 "
{txt}
{com}. label var TotDeaLoRaA03S06 "Total Deaths Lower A03 S06 "
{txt}
{com}. label var TotDeaMeRaA03S01 "Total Deaths Mean A03 S01 "
{txt}
{com}. label var TotDeaMeRaA03S02 "Total Deaths Mean A03 S02 "
{txt}
{com}. label var TotDeaMeRaA03S03 "Total Deaths Mean A03 S03 "
{txt}
{com}. label var TotDeaMeRaA03S04 "Total Deaths Mean A03 S04 "
{txt}
{com}. label var TotDeaMeRaA03S05 "Total Deaths Mean A03 S05 "
{txt}
{com}. label var TotDeaMeRaA03S06 "Total Deaths Mean A03 S06 "
{txt}
{com}. label var TotDeaUpRaA03S01 "Total Deaths Upper A03 S01 "
{txt}
{com}. label var TotDeaUpRaA03S02 "Total Deaths Upper A03 S02 "
{txt}
{com}. label var TotDeaUpRaA03S03 "Total Deaths Upper A03 S03 "
{txt}
{com}. label var TotDeaUpRaA03S04 "Total Deaths Upper A03 S04 "
{txt}
{com}. label var TotDeaUpRaA03S05 "Total Deaths Upper A03 S05 "
{txt}
{com}. label var TotDeaUpRaA03S06 "Total Deaths Upper A03 S06 "
{txt}
{com}. 
. 
. * other outcomes
. 
. label var DayHodMeRaA03S01 "Daily hospital demand Mean A03 S01 "
{txt}
{com}. label var DayHodLoRaA03S01 "Daily hospital demand Lower A03 S01 "
{txt}
{com}. label var DayHodUpRaA03S01 "Daily hospital demand Upper A03 S01 "
{txt}
{com}. label var DayHodMeRaA03S02 "Daily hospital demand Mean A03 S02 "
{txt}
{com}. label var DayHodLoRaA03S02 "Daily hospital demand Lower A03 S02 "
{txt}
{com}. label var DayHodUpRaA03S02 "Daily hospital demand Upper A03 S02 "
{txt}
{com}. label var DayHodMeRaA03S03 "Daily hospital demand Mean A03 S03 "
{txt}
{com}. label var DayHodLoRaA03S03 "Daily hospital demand Lower A03 S03 "
{txt}
{com}. label var DayHodUpRaA03S03 "Daily hospital demand Upper A03 S03 "
{txt}
{com}. label var DayHodMeRaA03S04 "Daily hospital demand Mean A03 S04 "
{txt}
{com}. label var DayHodLoRaA03S04 "Daily hospital demand Lower A03 S04 "
{txt}
{com}. label var DayHodUpRaA03S04 "Daily hospital demand Upper A03 S04 " 
{txt}
{com}. label var DayHodMeRaA03S05 "Daily hospital demand Mean A03 S05 "
{txt}
{com}. label var DayHodLoRaA03S05 "Daily hospital demand Lower A03 S05 "
{txt}
{com}. label var DayHodUpRaA03S05 "Daily hospital demand Upper A03 S05 "
{txt}
{com}. label var DayHodMeRaA03S06 "Daily hospital demand Mean A03 S06 "
{txt}
{com}. label var DayHodLoRaA03S06 "Daily hospital demand Lower A03 S06 "
{txt}
{com}. label var DayHodUpRaA03S06 "Daily hospital demand Upper A03 S06 "
{txt}
{com}. 
. label var DayHoiMeRaA03S01 "Daily hospital incidence Mean A03 S01 "
{txt}
{com}. label var DayHoiLoRaA03S01 "Daily hospital incidence Lower A03 S01 "
{txt}
{com}. label var DayHoiUpRaA03S01 "Daily hospital incidence Upper A03 S01 "
{txt}
{com}. label var DayHoiMeRaA03S02 "Daily hospital incidence Mean A03 S02 "
{txt}
{com}. label var DayHoiLoRaA03S02 "Daily hospital incidence Lower A03 S02 "
{txt}
{com}. label var DayHoiUpRaA03S02 "Daily hospital incidence Upper A03 S02 "
{txt}
{com}. label var DayHoiMeRaA03S03 "Daily hospital incidence Mean A03 S03 "
{txt}
{com}. label var DayHoiLoRaA03S03 "Daily hospital incidence Lower A03 S03 "
{txt}
{com}. label var DayHoiUpRaA03S03 "Daily hospital incidence Upper A03 S03 "
{txt}
{com}. label var DayHoiMeRaA03S04 "Daily hospital incidence Mean A03 S04 "
{txt}
{com}. label var DayHoiLoRaA03S04 "Daily hospital incidence Lower A03 S04 "
{txt}
{com}. label var DayHoiUpRaA03S04 "Daily hospital incidence Upper A03 S04 "
{txt}
{com}. label var DayHoiMeRaA03S05 "Daily hospital incidence Mean A03 S05 "
{txt}
{com}. label var DayHoiLoRaA03S05 "Daily hospital incidence Lower A03 S05 "
{txt}
{com}. label var DayHoiUpRaA03S05 "Daily hospital incidence Upper A03 S05 "
{txt}
{com}. label var DayHoiMeRaA03S06 "Daily hospital incidence Mean A03 S06 "
{txt}
{com}. label var DayHoiLoRaA03S06 "Daily hospital incidence Lower A03 S06 "
{txt}
{com}. label var DayHoiUpRaA03S06 "Daily hospital incidence Upper A03 S06 "
{txt}
{com}. 
. label var DayIcdMeRaA03S01 "Daily ICU demand Mean A03 S01 "
{txt}
{com}. label var DayIcdLoRaA03S01 "Daily ICU demand Lower A03 S01 "
{txt}
{com}. label var DayIcdUpRaA03S01 "Daily ICU demand Upper A03 S01 "
{txt}
{com}. label var DayIcdMeRaA03S02 "Daily ICU demand Mean A03 S02 "
{txt}
{com}. label var DayIcdLoRaA03S02 "Daily ICU demand Lower A03 S02 "
{txt}
{com}. label var DayIcdUpRaA03S02 "Daily ICU demand Upper A03 S02 "
{txt}
{com}. label var DayIcdMeRaA03S03 "Daily ICU demand Mean A03 S03 "
{txt}
{com}. label var DayIcdLoRaA03S03 "Daily ICU demand Lower A03 S03 "
{txt}
{com}. label var DayIcdUpRaA03S03 "Daily ICU demand Upper A03 S03 "
{txt}
{com}. label var DayIcdMeRaA03S04 "Daily ICU demand Mean A03 S04 "
{txt}
{com}. label var DayIcdLoRaA03S04 "Daily ICU demand Lower A03 S04 "
{txt}
{com}. label var DayIcdUpRaA03S04 "Daily ICU demand Upper A03 S04 "
{txt}
{com}. label var DayIcdMeRaA03S05 "Daily ICU demand Mean A03 S05 "
{txt}
{com}. label var DayIcdLoRaA03S05 "Daily ICU demand Lower A03 S05 "
{txt}
{com}. label var DayIcdUpRaA03S05 "Daily ICU demand Upper A03 S05 "
{txt}
{com}. label var DayIcdMeRaA03S06 "Daily ICU demand Mean A03 S06 "
{txt}
{com}. label var DayIcdLoRaA03S06 "Daily ICU demand Lower A03 S06 "
{txt}
{com}. label var DayIcdUpRaA03S06 "Daily ICU demand Upper A03 S06 "
{txt}
{com}. 
. label var DayIciMeRaA03S01 "Daily ICU incidence Mean A03 S01 "
{txt}
{com}. label var DayIciLoRaA03S01 "Daily ICU incidence Lower A03 S01 "
{txt}
{com}. label var DayIciUpRaA03S01 "Daily ICU incidence Upper A03 S01 "
{txt}
{com}. label var DayIciMeRaA03S02 "Daily ICU incidence Mean A03 S02 "
{txt}
{com}. label var DayIciLoRaA03S02 "Daily ICU incidence Lower A03 S02 "
{txt}
{com}. label var DayIciUpRaA03S02 "Daily ICU incidence Upper A03 S02 "
{txt}
{com}. label var DayIciMeRaA03S03 "Daily ICU incidence Mean A03 S03 "
{txt}
{com}. label var DayIciLoRaA03S03 "Daily ICU incidence Lower A03 S03 "
{txt}
{com}. label var DayIciUpRaA03S03 "Daily ICU incidence Upper A03 S03 "
{txt}
{com}. label var DayIciMeRaA03S04 "Daily ICU incidence Mean A03 S04 "
{txt}
{com}. label var DayIciLoRaA03S04 "Daily ICU incidence Lower A03 S04 "
{txt}
{com}. label var DayIciUpRaA03S04 "Daily ICU incidence Upper A03 S04 "
{txt}
{com}. label var DayIciMeRaA03S05 "Daily ICU incidence Mean A03 S05 "
{txt}
{com}. label var DayIciLoRaA03S05 "Daily ICU incidence Lower A03 S05 "
{txt}
{com}. label var DayIciUpRaA03S05 "Daily ICU incidence Upper A03 S05 "
{txt}
{com}. label var DayIciMeRaA03S06 "Daily ICU incidence Mean A03 S06 "
{txt}
{com}. label var DayIciLoRaA03S06 "Daily ICU incidence Lower A03 S06 "
{txt}
{com}. label var DayIciUpRaA03S06 "Daily ICU incidence Upper A03 S06 "
{txt}
{com}. 
. label var DayPreMeRaA03S01 "Daily prevalence Mean A03 S01 "
{txt}
{com}. label var DayPreLoRaA03S01 "Daily prevalence Lower A03 S01 "
{txt}
{com}. label var DayPreUpRaA03S01 "Daily prevalence Upper A03 S01 "
{txt}
{com}. label var DayPreMeRaA03S02 "Daily prevalence Mean A03 S02 "
{txt}
{com}. label var DayPreLoRaA03S02 "Daily prevalence Lower A03 S02 "
{txt}
{com}. label var DayPreUpRaA03S02 "Daily prevalence Upper A03 S02 "
{txt}
{com}. label var DayPreMeRaA03S03 "Daily prevalence Mean A03 S03 "
{txt}
{com}. label var DayPreLoRaA03S03 "Daily prevalence Lower A03 S03 "
{txt}
{com}. label var DayPreUpRaA03S03 "Daily prevalence Upper A03 S03 "
{txt}
{com}. label var DayPreMeRaA03S04 "Daily prevalence Mean A03 S04 "
{txt}
{com}. label var DayPreLoRaA03S04 "Daily prevalence Lower A03 S04 "
{txt}
{com}. label var DayPreUpRaA03S04 "Daily prevalence Upper A03 S04 "
{txt}
{com}. label var DayPreMeRaA03S05 "Daily prevalence Mean A03 S05 "
{txt}
{com}. label var DayPreLoRaA03S05 "Daily prevalence Lower A03 S05 "
{txt}
{com}. label var DayPreUpRaA03S05 "Daily prevalence Upper A03 S05 "
{txt}
{com}. label var DayPreMeRaA03S06 "Daily prevalence Mean A03 S06 "
{txt}
{com}. label var DayPreLoRaA03S06 "Daily prevalence Lower A03 S06 "
{txt}
{com}. label var DayPreUpRaA03S06 "Daily prevalence Upper A03 S06 "
{txt}
{com}. 
. label var DayRefMeRaA03S01 "Daily R effective Mean A03 S01 "
{txt}
{com}. label var DayRefLoRaA03S01 "Daily R effective Lower A03 S01 "
{txt}
{com}. label var DayRefUpRaA03S01 "Daily R effective Upper A03 S01 "
{txt}
{com}. label var DayRefMeRaA03S02 "Daily R effective Mean A03 S02 "
{txt}
{com}. label var DayRefLoRaA03S02 "Daily R effective Lower A03 S02 "
{txt}
{com}. label var DayRefUpRaA03S02 "Daily R effective Upper A03 S02 "
{txt}
{com}. label var DayRefMeRaA03S03 "Daily R effective Mean A03 S03 "
{txt}
{com}. label var DayRefLoRaA03S03 "Daily R effective Lower A03 S03 "
{txt}
{com}. label var DayRefUpRaA03S03 "Daily R effective Upper A03 S03 "
{txt}
{com}. label var DayRefMeRaA03S04 "Daily R effective Mean A03 S04 "
{txt}
{com}. label var DayRefLoRaA03S04 "Daily R effective Lower A03 S04 "
{txt}
{com}. label var DayRefUpRaA03S04 "Daily R effective Upper A03 S04 "
{txt}
{com}. label var DayRefMeRaA03S05 "Daily R effective Mean A03 S05 "
{txt}
{com}. label var DayRefLoRaA03S05 "Daily R effective Lower A03 S05 "
{txt}
{com}. label var DayRefUpRaA03S05 "Daily R effective Upper A03 S05 "
{txt}
{com}. label var DayRefMeRaA03S06 "Daily R effective Mean A03 S06 "
{txt}
{com}. label var DayRefLoRaA03S06 "Daily R effective Lower A03 S06 "
{txt}
{com}. label var DayRefUpRaA03S06 "Daily R effective Upper A03 S06 "
{txt}
{com}. 
. label var DayRttMeRaA03S01 "Daily R t Mean A03 S01 "
{txt}
{com}. label var DayRttLoRaA03S01 "Daily R t Lower A03 S01 "
{txt}
{com}. label var DayRttUpRaA03S01 "Daily R t Upper A03 S01 "
{txt}
{com}. label var DayRttMeRaA03S02 "Daily R t Mean A03 S02 "
{txt}
{com}. label var DayRttLoRaA03S02 "Daily R t Lower A03 S02 "
{txt}
{com}. label var DayRttUpRaA03S02 "Daily R t Upper A03 S02 "
{txt}
{com}. label var DayRttMeRaA03S03 "Daily R t Mean A03 S03 "
{txt}
{com}. label var DayRttLoRaA03S03 "Daily R t Lower A03 S03 "
{txt}
{com}. label var DayRttUpRaA03S03 "Daily R t Upper A03 S03 "
{txt}
{com}. label var DayRttMeRaA03S04 "Daily R t Mean A03 S04 "
{txt}
{com}. label var DayRttLoRaA03S04 "Daily R t Lower A03 S04 "
{txt}
{com}. label var DayRttUpRaA03S04 "Daily R t Upper A03 S04 "
{txt}
{com}. label var DayRttMeRaA03S05 "Daily R t Mean A03 S05 "
{txt}
{com}. label var DayRttLoRaA03S05 "Daily R t Lower A03 S05 "
{txt}
{com}. label var DayRttUpRaA03S05 "Daily R t Upper A03 S05 "
{txt}
{com}. label var DayRttMeRaA03S06 "Daily R t Mean A03 S06 "
{txt}
{com}. label var DayRttLoRaA03S06 "Daily R t Lower A03 S06 "
{txt}
{com}. label var DayRttUpRaA03S06 "Daily R t Upper A03 S06 "
{txt}
{com}. 
. 
. rename country loc_grand_name
{res}{txt}
{com}. 
. 
. 
. order ///
> loc_grand_name date     ///
> TotDeaMeRaA03S01        TotDeaLoRaA03S01        TotDeaUpRaA03S01        ///
> TotDeaMeRaA03S02        TotDeaLoRaA03S02        TotDeaUpRaA03S02        ///
> TotDeaMeRaA03S03        TotDeaLoRaA03S03        TotDeaUpRaA03S03        ///
> TotDeaMeRaA03S04        TotDeaLoRaA03S04        TotDeaUpRaA03S04        ///
> TotDeaMeRaA03S05        TotDeaLoRaA03S05        TotDeaUpRaA03S05        ///
> TotDeaMeRaA03S06        TotDeaLoRaA03S06        TotDeaUpRaA03S06        ///
> DayDeaMeRaA03S01        DayDeaLoRaA03S01        DayDeaUpRaA03S01        ///
> DayDeaMeRaA03S02        DayDeaLoRaA03S02        DayDeaUpRaA03S02        ///
> DayDeaMeRaA03S03        DayDeaLoRaA03S03        DayDeaUpRaA03S03        ///
> DayDeaMeRaA03S04        DayDeaLoRaA03S04        DayDeaUpRaA03S04        ///
> DayDeaMeRaA03S05        DayDeaLoRaA03S05        DayDeaUpRaA03S05        ///
> DayDeaMeRaA03S06        DayDeaLoRaA03S06        DayDeaUpRaA03S06        ///
> TotINFMeRaA03S01        TotINFLoRaA03S01        TotINFUpRaA03S01        ///
> TotINFMeRaA03S02        TotINFLoRaA03S02        TotINFUpRaA03S02        ///
> TotINFMeRaA03S03        TotINFLoRaA03S03        TotINFUpRaA03S03        ///
> TotINFMeRaA03S04        TotINFLoRaA03S04        TotINFUpRaA03S04        ///
> TotINFMeRaA03S05        TotINFLoRaA03S05        TotINFUpRaA03S05        ///
> TotINFMeRaA03S06        TotINFLoRaA03S06        TotINFUpRaA03S06        ///
> DayINFMeRaA03S01        DayINFLoRaA03S01        DayINFUpRaA03S01        ///
> DayINFMeRaA03S02        DayINFLoRaA03S02        DayINFUpRaA03S02        ///
> DayINFMeRaA03S03        DayINFLoRaA03S03        DayINFUpRaA03S03        ///
> DayINFMeRaA03S04        DayINFLoRaA03S04        DayINFUpRaA03S04        ///
> DayINFMeRaA03S05        DayINFLoRaA03S05        DayINFUpRaA03S05        ///
> DayINFMeRaA03S06        DayINFLoRaA03S06        DayINFUpRaA03S06
{txt}
{com}. 
. 
.  *
.  
.  
. * gen IFR
. 
. gen DayIFRMeRaA03S01 = 100 * DayDeaMeRaA03S01 / DayINFMeRaA03S01 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S01 = 100 * DayDeaLoRaA03S01 / DayINFLoRaA03S01 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S01 = 100 * DayDeaUpRaA03S01 / DayINFUpRaA03S01 
{txt}(1 missing value generated)

{com}. gen DayIFRMeRaA03S02 = 100 * DayDeaMeRaA03S02 / DayINFMeRaA03S02 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S02 = 100 * DayDeaLoRaA03S02 / DayINFLoRaA03S02 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S02 = 100 * DayDeaUpRaA03S02 / DayINFUpRaA03S02 
{txt}(1 missing value generated)

{com}. gen DayIFRMeRaA03S03 = 100 * DayDeaMeRaA03S03 / DayINFMeRaA03S03 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S03 = 100 * DayDeaLoRaA03S03 / DayINFLoRaA03S03 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S03 = 100 * DayDeaUpRaA03S03 / DayINFUpRaA03S03 
{txt}(1 missing value generated)

{com}. gen DayIFRMeRaA03S04 = 100 * DayDeaMeRaA03S04 / DayINFMeRaA03S04 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S04 = 100 * DayDeaLoRaA03S04 / DayINFLoRaA03S04 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S04 = 100 * DayDeaUpRaA03S04 / DayINFUpRaA03S04 
{txt}(1 missing value generated)

{com}. gen DayIFRMeRaA03S05 = 100 * DayDeaMeRaA03S05 / DayINFMeRaA03S05 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S05 = 100 * DayDeaLoRaA03S05 / DayINFLoRaA03S05 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S05 = 100 * DayDeaUpRaA03S05 / DayINFUpRaA03S05 
{txt}(1 missing value generated)

{com}. gen DayIFRMeRaA03S06 = 100 * DayDeaMeRaA03S06 / DayINFMeRaA03S06 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S06 = 100 * DayDeaLoRaA03S06 / DayINFLoRaA03S06 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S06 = 100 * DayDeaUpRaA03S06 / DayINFUpRaA03S06 
{txt}(1 missing value generated)

{com}. 
. label var DayIFRMeRaA03S01 "Daily IFR Mean A03 S01 "
{txt}
{com}. label var DayIFRLoRaA03S01 "Daily IFR Lower A03 S01 "
{txt}
{com}. label var DayIFRUpRaA03S01 "Daily IFR Upper A03 S01 "
{txt}
{com}. label var DayIFRMeRaA03S02 "Daily IFR Mean A03 S02 "
{txt}
{com}. label var DayIFRLoRaA03S02 "Daily IFR Lower A03 S02 "
{txt}
{com}. label var DayIFRUpRaA03S02 "Daily IFR Upper A03 S02 "
{txt}
{com}. label var DayIFRMeRaA03S03 "Daily IFR Mean A03 S03 "
{txt}
{com}. label var DayIFRLoRaA03S03 "Daily IFR Lower A03 S03 "
{txt}
{com}. label var DayIFRUpRaA03S03 "Daily IFR Upper A03 S03 "
{txt}
{com}. label var DayIFRMeRaA03S04 "Daily IFR Mean A03 S04 "
{txt}
{com}. label var DayIFRLoRaA03S04 "Daily IFR Lower A03 S04 "
{txt}
{com}. label var DayIFRUpRaA03S04 "Daily IFR Upper A03 S04 "
{txt}
{com}. label var DayIFRMeRaA03S05 "Daily IFR Mean A03 S05 "
{txt}
{com}. label var DayIFRLoRaA03S05 "Daily IFR Lower A03 S05 "
{txt}
{com}. label var DayIFRUpRaA03S05 "Daily IFR Upper A03 S05 "
{txt}
{com}. label var DayIFRMeRaA03S06 "Daily IFR Mean A03 S06 "
{txt}
{com}. label var DayIFRLoRaA03S06 "Daily IFR Lower A03 S06 "
{txt}
{com}. label var DayIFRUpRaA03S06 "Daily IFR Upper A03 S06 "
{txt}
{com}. 
. 
. 
. 
. 
. * gen "Daily infections mean div by daily deaths mean IMPE DayCbD" for visulization of temporal relation of deaths and infections peaks 
. 
. 
. summ DayDeaMeRaA03S02 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~02 {c |}{res}        786    952.6181    1010.218          0    4688.89
{txt}
{com}. gen DayDeMMeRaA03S02 = r(mean)
{txt}
{com}. label var DayDeMMeRaA03S02 "Daily deaths mean IMPE DayDeM"
{txt}
{com}. 
. summ DayINFMeRaA03S02 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayINFMeR~02 {c |}{res}        786    348982.1    363213.6        .12    2166137
{txt}
{com}. gen DayCaMMeRaA03S02 = r(mean)
{txt}
{com}. label var DayCaMMeRaA03S02 "Daily infections mean IMPE DayCaM"
{txt}
{com}.                            
. gen DayCbDMeRaA03S02 = DayCaMMeRaA03S02 / DayDeMMeRaA03S02
{txt}
{com}. label var DayCbDMeRaA03S02 "Daily infections mean div by daily deaths mean IMPE DayCbD"
{txt}
{com}. summ DayCbDMeRaA03S02

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~02 {c |}{res}        787      366.34           0     366.34     366.34
{txt}
{com}.                                               
. gen DayDMuMeRaA03S02 = DayDeaMeRaA03S02 * DayCbDMeRaA03S02
{txt}(1 missing value generated)

{com}. label var DayDMuMeRaA03S02 "Daily deaths scaled (times means of infections by deaths) IMPE"
{txt}
{com}. summ DayDMuMeRaA03S02

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~02 {c |}{res}        786    348982.1    370083.3          0    1717728
{txt}
{com}. 
. 
. 
. 
. 
. sort date loc_grand_name
{txt}
{com}. 
. order date loc_grand_name
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "IMPE SEARO.dta", replace
{txt}file IMPE SEARO.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *****************************
. 
. * gen WPRO
. 
. use "IMPE.dta", clear
{txt}
{com}. 
. rename country loc_grand_name
{res}{txt}
{com}. 
. keep if ///
> loc_grand_name == "Australia" | ///
> loc_grand_name == "Brunei Darussalam" | ///
> loc_grand_name == "Cambodia" | ///
> loc_grand_name == "China" | ///
> loc_grand_name == "Fiji" | ///
> loc_grand_name == "French Polynesia" | ///
> loc_grand_name == "Guam" | ///
> loc_grand_name == "Hong Kong" | ///
> loc_grand_name == "Japan" | ///
> loc_grand_name == "Kiribati" | ///
> loc_grand_name == "Lao PDR" | ///
> loc_grand_name == "Macao" | ///
> loc_grand_name == "Malaysia" | ///
> loc_grand_name == "Micronesia" | ///
> loc_grand_name == "Mongolia" | ///
> loc_grand_name == "New Caledonia" | ///
> loc_grand_name == "New Zealand" | ///
> loc_grand_name == "Papua New Guinea" | ///
> loc_grand_name == "Philippines" | ///
> loc_grand_name == "Samoa" | ///
> loc_grand_name == "Singapore" | ///
> loc_grand_name == "Solomon Islands" | ///
> loc_grand_name == "South Korea" | ///
> loc_grand_name == "Taiwan" | ///
> loc_grand_name == "Tonga" | ///
> loc_grand_name == "Vanuatu" | ///
> loc_grand_name == "Vietnam" 
{txt}(7,824,777 observations deleted)

{com}. 
. 
. 
. 
. 
. collapse (sum) y_025 y_25 y_median y_mean y_75 y_975, by(date compartment scenario) 
{txt}
{com}. 
. 
. 
. * gen date 
. 
. rename date date_original
{res}{txt}
{com}. 
. gen year = substr(date_original,1,4) 
{txt}
{com}. gen month = substr(date_original,6,2) 
{txt}
{com}. gen day = substr(date_original,9,2)
{txt}
{com}. egen dateblock = concat(year month day)
{txt}
{com}. drop year month day
{txt}
{com}. 
. 
. * rename uncertainty limits
. 
. rename y_025    y_025_
{res}{txt}
{com}. rename y_25     y_250_
{res}{txt}
{com}. rename y_median y_med_
{res}{txt}
{com}. rename y_mean   y_mea_
{res}{txt}
{com}. rename y_75     y_750_
{res}{txt}
{com}. rename y_975    y_975_
{res}{txt}
{com}. 
. 
. foreach var of varlist y_025-y_975 {c -(}
{txt}  2{com}.         ds `var'
{txt}  3{com}.         label variable `var' `r(varlist)'
{txt}  4{com}. {c )-}
{txt}{col 1}y_025_
{col 1}y_250_
{col 1}y_med_
{col 1}y_mea_
{col 1}y_750_
{col 1}y_975_

{com}. *
. 
. 
. 
. * rename scenarios 
. 
. tab scenario 

                  {txt}scenario {c |}      Freq.     Percent        Cum.
{hline 27}{c +}{hline 35}
       Maintain Status Quo {c |}{res}      9,181       16.67       16.67
{txt}                Optimistic {c |}{res}      9,181       16.67       33.33
{txt}               Pessimistic {c |}{res}      9,181       16.67       50.00
{txt}Surged Maintain Status Quo {c |}{res}      9,181       16.67       66.67
{txt}         Surged Optimistic {c |}{res}      9,181       16.67       83.33
{txt}        Surged Pessimistic {c |}{res}      9,181       16.67      100.00
{txt}{hline 27}{c +}{hline 35}
                     Total {c |}{res}     55,086      100.00
{txt}
{com}. 
. 
. /*
> Scenarios:
> 
> S1  "Additional 50% Reduction"                  "S1_Add_Half_Reduction"
> S2  "Maintain Status Quo"                               "S2_Maintain_Staus_Quo"
> S3  "Relax Interventions 50%"                   "S3_Relax_Half_Intervention"
> 
> S4  "Surged Additional 50% Reduction"   "S4_Surged_Add_Half_Reduction"
> S5  "Surged Maintain Status Quo"                "S5_Surged_Maintain_Staus_Quo"
> S6  "Surged Relax Interventions 50%"    "S6_Surged_Relax_Half_Intervention"
> 
> With IMPE update 20211103 (2021-12-13_v9.csv.zip) released on 20211110., IMPE has new terms for their scenarios:
> 
> S1      Optimistic
> S2      Maintain Status Quo
> S3      Pessimistic
> 
> S4      Surged Optimistic
> S5      Surged Maintain Status Quo
> S6      Surged Pessimistic
> */
. 
. 
. gen scenario_snail = ""
{txt}(55,086 missing values generated)

{com}. replace scenario_snail = "S1" if scenario == "Optimistic"
{txt}variable {bf}scenario_snail{sf} was {bf}{res}str1{sf}{txt} now {bf}{res}str2{sf}
{txt}(9,181 real changes made)

{com}. replace scenario_snail = "S2" if scenario == "Maintain Status Quo"
{txt}(9,181 real changes made)

{com}. replace scenario_snail = "S3" if scenario == "Pessimistic"
{txt}(9,181 real changes made)

{com}. replace scenario_snail = "S4" if scenario == "Surged Optimistic"
{txt}(9,181 real changes made)

{com}. replace scenario_snail = "S5" if scenario == "Surged Maintain Status Quo"
{txt}(9,181 real changes made)

{com}. replace scenario_snail = "S6" if scenario == "Surged Pessimistic"
{txt}(9,181 real changes made)

{com}. 
. 
. gen underline = "_"
{txt}
{com}. egen scenario_snail_dateblock = concat(scenario_snail underline dateblock)
{txt}
{com}. 
. drop date_original scenario
{txt}
{com}. 
. drop scenario_snail_dateblock 
{txt}
{com}.   
. drop y_250_ y_med_ y_750_
{txt}
{com}.  
. 
. * Primary outcomes Total Deaths, Total infections, Daily Deaths, and Daily infections
. 
. replace compartment = "cumul_death" if compartment == "cumulative_deaths"
{txt}(5,004 real changes made)

{com}. replace compartment = "cumul_infec" if compartment == "cumulative_infections"
{txt}(5,004 real changes made)

{com}. replace compartment = "daily_death" if compartment == "deaths"
{txt}(5,004 real changes made)

{com}. replace compartment = "daily_infec" if compartment == "infections"
{txt}(5,004 real changes made)

{com}. 
. 
. * other outcomes
. 
. replace compartment = "icu___deman" if compartment == "ICU_demand"                      // Icd
{txt}(5,010 real changes made)

{com}. replace compartment = "icu___incid" if compartment == "ICU_incidence"           // Ici
{txt}(5,010 real changes made)

{com}. replace compartment = "reff_______" if compartment == "Reff"                            // Ref
{txt}(5,010 real changes made)

{com}. replace compartment = "rt_________" if compartment == "Rt"                                      // Rtt
{txt}(5,010 real changes made)

{com}. replace compartment = "hospi_deman" if compartment == "hospital_demand"         // Hod
{txt}(5,010 real changes made)

{com}. replace compartment = "hospi_incid" if compartment == "hospital_incidence"  // Hoi
{txt}(5,010 real changes made)

{com}. replace compartment = "preval_____" if compartment == "prevalence"                      // Pre
{txt}(5,010 real changes made)

{com}. 
. 
. 
. duplicates drop date compartment scenario, force

{p 0 4}{txt}Duplicates in terms of {res} dateblock compartment scenario_snail{p_end}

{txt}(0 observations are duplicates)

{com}. 
. * reshape
. 
. egen compartment_scenario_snail = concat(compartment underline scenario_snail)  
{txt}
{com}. 
. drop compartment underline scenario_snail
{txt}
{com}. 
. tab compartment_scenario_snail

{txt}compartment_sc {c |}
  enario_snail {c |}      Freq.     Percent        Cum.
{hline 15}{c +}{hline 35}
cumul_death_S1 {c |}{res}        834        1.51        1.51
{txt}cumul_death_S2 {c |}{res}        834        1.51        3.03
{txt}cumul_death_S3 {c |}{res}        834        1.51        4.54
{txt}cumul_death_S4 {c |}{res}        834        1.51        6.06
{txt}cumul_death_S5 {c |}{res}        834        1.51        7.57
{txt}cumul_death_S6 {c |}{res}        834        1.51        9.08
{txt}cumul_infec_S1 {c |}{res}        834        1.51       10.60
{txt}cumul_infec_S2 {c |}{res}        834        1.51       12.11
{txt}cumul_infec_S3 {c |}{res}        834        1.51       13.63
{txt}cumul_infec_S4 {c |}{res}        834        1.51       15.14
{txt}cumul_infec_S5 {c |}{res}        834        1.51       16.65
{txt}cumul_infec_S6 {c |}{res}        834        1.51       18.17
{txt}daily_death_S1 {c |}{res}        834        1.51       19.68
{txt}daily_death_S2 {c |}{res}        834        1.51       21.20
{txt}daily_death_S3 {c |}{res}        834        1.51       22.71
{txt}daily_death_S4 {c |}{res}        834        1.51       24.22
{txt}daily_death_S5 {c |}{res}        834        1.51       25.74
{txt}daily_death_S6 {c |}{res}        834        1.51       27.25
{txt}daily_infec_S1 {c |}{res}        834        1.51       28.77
{txt}daily_infec_S2 {c |}{res}        834        1.51       30.28
{txt}daily_infec_S3 {c |}{res}        834        1.51       31.79
{txt}daily_infec_S4 {c |}{res}        834        1.51       33.31
{txt}daily_infec_S5 {c |}{res}        834        1.51       34.82
{txt}daily_infec_S6 {c |}{res}        834        1.51       36.34
{txt}hospi_deman_S1 {c |}{res}        835        1.52       37.85
{txt}hospi_deman_S2 {c |}{res}        835        1.52       39.37
{txt}hospi_deman_S3 {c |}{res}        835        1.52       40.88
{txt}hospi_deman_S4 {c |}{res}        835        1.52       42.40
{txt}hospi_deman_S5 {c |}{res}        835        1.52       43.91
{txt}hospi_deman_S6 {c |}{res}        835        1.52       45.43
{txt}hospi_incid_S1 {c |}{res}        835        1.52       46.95
{txt}hospi_incid_S2 {c |}{res}        835        1.52       48.46
{txt}hospi_incid_S3 {c |}{res}        835        1.52       49.98
{txt}hospi_incid_S4 {c |}{res}        835        1.52       51.49
{txt}hospi_incid_S5 {c |}{res}        835        1.52       53.01
{txt}hospi_incid_S6 {c |}{res}        835        1.52       54.53
{txt}icu___deman_S1 {c |}{res}        835        1.52       56.04
{txt}icu___deman_S2 {c |}{res}        835        1.52       57.56
{txt}icu___deman_S3 {c |}{res}        835        1.52       59.07
{txt}icu___deman_S4 {c |}{res}        835        1.52       60.59
{txt}icu___deman_S5 {c |}{res}        835        1.52       62.10
{txt}icu___deman_S6 {c |}{res}        835        1.52       63.62
{txt}icu___incid_S1 {c |}{res}        835        1.52       65.14
{txt}icu___incid_S2 {c |}{res}        835        1.52       66.65
{txt}icu___incid_S3 {c |}{res}        835        1.52       68.17
{txt}icu___incid_S4 {c |}{res}        835        1.52       69.68
{txt}icu___incid_S5 {c |}{res}        835        1.52       71.20
{txt}icu___incid_S6 {c |}{res}        835        1.52       72.72
{txt}preval______S1 {c |}{res}        835        1.52       74.23
{txt}preval______S2 {c |}{res}        835        1.52       75.75
{txt}preval______S3 {c |}{res}        835        1.52       77.26
{txt}preval______S4 {c |}{res}        835        1.52       78.78
{txt}preval______S5 {c |}{res}        835        1.52       80.29
{txt}preval______S6 {c |}{res}        835        1.52       81.81
{txt}reff________S1 {c |}{res}        835        1.52       83.33
{txt}reff________S2 {c |}{res}        835        1.52       84.84
{txt}reff________S3 {c |}{res}        835        1.52       86.36
{txt}reff________S4 {c |}{res}        835        1.52       87.87
{txt}reff________S5 {c |}{res}        835        1.52       89.39
{txt}reff________S6 {c |}{res}        835        1.52       90.91
{txt}rt__________S1 {c |}{res}        835        1.52       92.42
{txt}rt__________S2 {c |}{res}        835        1.52       93.94
{txt}rt__________S3 {c |}{res}        835        1.52       95.45
{txt}rt__________S4 {c |}{res}        835        1.52       96.97
{txt}rt__________S5 {c |}{res}        835        1.52       98.48
{txt}rt__________S6 {c |}{res}        835        1.52      100.00
{txt}{hline 15}{c +}{hline 35}
         Total {c |}{res}     55,086      100.00
{txt}
{com}. 
. gen country = "WPRO"
{txt}
{com}. 
. reshape wide y_025_   y_mea_  y_975_, i(country dateblock) j(compartment_scenario_snail) string
{txt}(note: j = cumul_death_S1 cumul_death_S2 cumul_death_S3 cumul_death_S4 cumul_death_S5 cumul_death_S6 cumul_infec_S1 cumul_infec_S2 cumul_infec_S3 cumul_infec_S4 cumul_infec_S5 cumul_infec_S6 daily_death_S1 daily_death_S2 daily_death_S3 daily_death_S4 daily_death_S5 daily_death_S6 daily_infec_S1 daily_infec_S2 daily_infec_S3 daily_infec_S4 daily_infec_S5 daily_infec_S6 hospi_deman_S1 hospi_deman_S2 hospi_deman_S3 hospi_deman_S4 hospi_deman_S5 hospi_deman_S6 hospi_incid_S1 hospi_incid_S2 hospi_incid_S3 hospi_incid_S4 hospi_incid_S5 hospi_incid_S6 icu___deman_S1 icu___deman_S2 icu___deman_S3 icu___deman_S4 icu___deman_S5 icu___deman_S6 icu___incid_S1 icu___incid_S2 icu___incid_S3 icu___incid_S4 icu___incid_S5 icu___incid_S6 preval______S1 preval______S2 preval______S3 preval______S4 preval______S5 preval______S6 reff________S1 reff________S2 reff________S3 reff________S4 reff________S5 reff________S6 rt__________S1 rt__________S2 rt__________S3 rt__________S4 rt__________S5 rt__________S6)

Data{col 36}long{col 43}->{col 48}wide
{hline 77}
Number of obs.                 {res}   55086   {txt}->{res}     835
{txt}Number of variables            {res}       6   {txt}->{res}     200
{txt}j variable (66 values){res}compartment_scenario_snail{txt}->(dropped)
xij variables:
                                 {res}y_025_   {txt}->   {res}y_025_cumul_death_S1 y_025_cumul_death_S2 ... y_025_rt__________S6
                                 y_mea_   {txt}->   {res}y_mea_cumul_death_S1 y_mea_cumul_death_S2 ... y_mea_rt__________S6
                                 y_975_   {txt}->   {res}y_975_cumul_death_S1 y_975_cumul_death_S2 ... y_975_rt__________S6
{txt}{hline 77}

{com}. 
. 
. *
. 
. 
. 
. foreach v of varlist y_025_cumul_death_S1-y_975_rt__________S6 {c -(} 
{txt}  2{com}. 
.         local first = substr("`v'", 7, 11) 
{txt}  3{com}.         local second = substr("`v'", 6, 1)
{txt}  4{com}.         local third  = substr("`v'", 1, 5)
{txt}  5{com}.         local fourth = substr("`v'", 19, 2)
{txt}  6{com}.         label var `v' "`first'`second'`third'`second'`fourth'"
{txt}  7{com}. {c )-} 
{txt}
{com}. *
. 
. 
. 
. foreach v of varlist y_025_cumul_death_S1-y_975_rt__________S6 {c -(} 
{txt}  2{com}.         di `"`: var label `v''"' 
{txt}  3{com}.         local fifth `"`: var label `v''"'
{txt}  4{com}.         rename `v'   `fifth'
{txt}  5{com}. {c )-}
cumul_death_y_025_S1
{res}cumul_death_y_mea_S1
cumul_death_y_975_S1
cumul_death_y_025_S2
cumul_death_y_mea_S2
cumul_death_y_975_S2
cumul_death_y_025_S3
cumul_death_y_mea_S3
cumul_death_y_975_S3
cumul_death_y_025_S4
cumul_death_y_mea_S4
cumul_death_y_975_S4
cumul_death_y_025_S5
cumul_death_y_mea_S5
cumul_death_y_975_S5
cumul_death_y_025_S6
cumul_death_y_mea_S6
cumul_death_y_975_S6
cumul_infec_y_025_S1
cumul_infec_y_mea_S1
cumul_infec_y_975_S1
cumul_infec_y_025_S2
cumul_infec_y_mea_S2
cumul_infec_y_975_S2
cumul_infec_y_025_S3
cumul_infec_y_mea_S3
cumul_infec_y_975_S3
cumul_infec_y_025_S4
cumul_infec_y_mea_S4
cumul_infec_y_975_S4
cumul_infec_y_025_S5
cumul_infec_y_mea_S5
cumul_infec_y_975_S5
cumul_infec_y_025_S6
cumul_infec_y_mea_S6
cumul_infec_y_975_S6
daily_death_y_025_S1
daily_death_y_mea_S1
daily_death_y_975_S1
daily_death_y_025_S2
daily_death_y_mea_S2
daily_death_y_975_S2
daily_death_y_025_S3
daily_death_y_mea_S3
daily_death_y_975_S3
daily_death_y_025_S4
daily_death_y_mea_S4
daily_death_y_975_S4
daily_death_y_025_S5
daily_death_y_mea_S5
daily_death_y_975_S5
daily_death_y_025_S6
daily_death_y_mea_S6
daily_death_y_975_S6
daily_infec_y_025_S1
daily_infec_y_mea_S1
daily_infec_y_975_S1
daily_infec_y_025_S2
daily_infec_y_mea_S2
daily_infec_y_975_S2
daily_infec_y_025_S3
daily_infec_y_mea_S3
daily_infec_y_975_S3
daily_infec_y_025_S4
daily_infec_y_mea_S4
daily_infec_y_975_S4
daily_infec_y_025_S5
daily_infec_y_mea_S5
daily_infec_y_975_S5
daily_infec_y_025_S6
daily_infec_y_mea_S6
daily_infec_y_975_S6
hospi_deman_y_025_S1
hospi_deman_y_mea_S1
hospi_deman_y_975_S1
hospi_deman_y_025_S2
hospi_deman_y_mea_S2
hospi_deman_y_975_S2
hospi_deman_y_025_S3
hospi_deman_y_mea_S3
hospi_deman_y_975_S3
hospi_deman_y_025_S4
hospi_deman_y_mea_S4
hospi_deman_y_975_S4
hospi_deman_y_025_S5
hospi_deman_y_mea_S5
hospi_deman_y_975_S5
hospi_deman_y_025_S6
hospi_deman_y_mea_S6
hospi_deman_y_975_S6
hospi_incid_y_025_S1
hospi_incid_y_mea_S1
hospi_incid_y_975_S1
hospi_incid_y_025_S2
hospi_incid_y_mea_S2
hospi_incid_y_975_S2
hospi_incid_y_025_S3
hospi_incid_y_mea_S3
hospi_incid_y_975_S3
hospi_incid_y_025_S4
hospi_incid_y_mea_S4
hospi_incid_y_975_S4
hospi_incid_y_025_S5
hospi_incid_y_mea_S5
hospi_incid_y_975_S5
hospi_incid_y_025_S6
hospi_incid_y_mea_S6
hospi_incid_y_975_S6
icu___deman_y_025_S1
icu___deman_y_mea_S1
icu___deman_y_975_S1
icu___deman_y_025_S2
icu___deman_y_mea_S2
icu___deman_y_975_S2
icu___deman_y_025_S3
icu___deman_y_mea_S3
icu___deman_y_975_S3
icu___deman_y_025_S4
icu___deman_y_mea_S4
icu___deman_y_975_S4
icu___deman_y_025_S5
icu___deman_y_mea_S5
icu___deman_y_975_S5
icu___deman_y_025_S6
icu___deman_y_mea_S6
icu___deman_y_975_S6
icu___incid_y_025_S1
icu___incid_y_mea_S1
icu___incid_y_975_S1
icu___incid_y_025_S2
icu___incid_y_mea_S2
icu___incid_y_975_S2
icu___incid_y_025_S3
icu___incid_y_mea_S3
icu___incid_y_975_S3
icu___incid_y_025_S4
icu___incid_y_mea_S4
icu___incid_y_975_S4
icu___incid_y_025_S5
icu___incid_y_mea_S5
icu___incid_y_975_S5
icu___incid_y_025_S6
icu___incid_y_mea_S6
icu___incid_y_975_S6
preval______y_025_S1
preval______y_mea_S1
preval______y_975_S1
preval______y_025_S2
preval______y_mea_S2
preval______y_975_S2
preval______y_025_S3
preval______y_mea_S3
preval______y_975_S3
preval______y_025_S4
preval______y_mea_S4
preval______y_975_S4
preval______y_025_S5
preval______y_mea_S5
preval______y_975_S5
preval______y_025_S6
preval______y_mea_S6
preval______y_975_S6
reff________y_025_S1
reff________y_mea_S1
reff________y_975_S1
reff________y_025_S2
reff________y_mea_S2
reff________y_975_S2
reff________y_025_S3
reff________y_mea_S3
reff________y_975_S3
reff________y_025_S4
reff________y_mea_S4
reff________y_975_S4
reff________y_025_S5
reff________y_mea_S5
reff________y_975_S5
reff________y_025_S6
reff________y_mea_S6
reff________y_975_S6
rt__________y_025_S1
rt__________y_mea_S1
rt__________y_975_S1
rt__________y_025_S2
rt__________y_mea_S2
rt__________y_975_S2
rt__________y_025_S3
rt__________y_mea_S3
rt__________y_975_S3
rt__________y_025_S4
rt__________y_mea_S4
rt__________y_975_S4
rt__________y_025_S5
rt__________y_mea_S5
rt__________y_975_S5
rt__________y_025_S6
rt__________y_mea_S6
rt__________y_975_S6
{txt}
{com}. *
. 
. 
. * gen date
. 
. gen year = substr(dateblock,1,4) 
{txt}
{com}. gen month = substr(dateblock,5,2) 
{txt}
{com}. gen day = substr(dateblock,7,2) 
{txt}
{com}. egen date2 = concat(day month year)
{txt}
{com}. gen date = date(date2, "DMY", 2050)
{txt}
{com}. format date %tdDDMonCCYY
{txt}
{com}. codebook date

{txt}{hline}
{res}date{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric daily date ({res}float{txt})

{col 18}range:  [{res}21882{txt},{res}22716{txt}]{col 55}units:  {res}1
{col 8}{txt}or equivalently:  [{res}29nov2019{txt},{res}12mar2022{txt}]{col 55}units:  {res}days
{col 10}{txt}unique values:  {res}835{col 51}{txt}missing .:  {res}0{txt}/{res}835

{txt}{col 19}mean:{res}{col 26}   22299{txt} = {res}19jan2021{txt}
{col 15}std. dev:{res}{col 26} 241.188

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}   21965{col 37}   22090{col 47}   22299{col 57}   22508{col 67}   22633
{col 26}20feb2020{col 36}24jun2020{col 46}19jan2021{col 56}16aug2021{col 66}19dec2021
{txt}
{com}. 
. 
. 
. * 
. 
. 
. * -renvars- somanyvars rather time consuming
. 
. foreach v of varlist cumul_death_y_025_S1-rt__________y_975_S6 {c -(} 
{txt}  2{com}. 
.     qui renvars, presub(cumul_death_y_025_ TotDeaLoRa)
{txt}  3{com}.     qui renvars, presub(cumul_death_y_975_ TotDeaUpRa)
{txt}  4{com}.     qui renvars, presub(cumul_death_y_mea_ TotDeaMeRa)
{txt}  5{com}. 
.         qui renvars, presub(daily_death_y_025_ DayDeaLoRa)
{txt}  6{com}.         qui renvars, presub(daily_death_y_975_ DayDeaUpRa)
{txt}  7{com}.         qui renvars, presub(daily_death_y_mea_ DayDeaMeRa)
{txt}  8{com}.         
.     qui renvars, presub(cumul_infec_y_025_ TotINFLoRa)
{txt}  9{com}.     qui renvars, presub(cumul_infec_y_975_ TotINFUpRa)
{txt} 10{com}.     qui renvars, presub(cumul_infec_y_mea_ TotINFMeRa)
{txt} 11{com}.         
.         qui renvars, presub(daily_infec_y_025_ DayINFLoRa)
{txt} 12{com}.         qui renvars, presub(daily_infec_y_975_ DayINFUpRa)
{txt} 13{com}.         qui renvars, presub(daily_infec_y_mea_ DayINFMeRa)
{txt} 14{com}.         
.         * other outcomes
.         
.         qui renvars, presub(icu___deman_y_025_ DayIcdLoRa) // "ICU_demand" 
{txt} 15{com}.         qui renvars, presub(icu___deman_y_975_ DayIcdUpRa)
{txt} 16{com}.         qui renvars, presub(icu___deman_y_mea_ DayIcdMeRa)
{txt} 17{com}.         
.         qui renvars, presub(icu___incid_y_025_ DayIciLoRa) // "ICU_incidence"
{txt} 18{com}.         qui renvars, presub(icu___incid_y_975_ DayIciUpRa)
{txt} 19{com}.         qui renvars, presub(icu___incid_y_mea_ DayIciMeRa)
{txt} 20{com}.         
.         qui renvars, presub(reff________y_025_ DayRefLoRa) // "Reff"
{txt} 21{com}.         qui renvars, presub(reff________y_975_ DayRefUpRa)
{txt} 22{com}.         qui renvars, presub(reff________y_mea_ DayRefMeRa)
{txt} 23{com}.         
.         qui renvars, presub(rt__________y_025_ DayRttLoRa) // "Rt"
{txt} 24{com}.         qui renvars, presub(rt__________y_975_ DayRttUpRa)
{txt} 25{com}.         qui renvars, presub(rt__________y_mea_ DayRttMeRa)
{txt} 26{com}.         
.         qui renvars, presub(hospi_deman_y_025_ DayHodLoRa) // "hospital_demand"
{txt} 27{com}.         qui renvars, presub(hospi_deman_y_975_ DayHodUpRa)
{txt} 28{com}.         qui renvars, presub(hospi_deman_y_mea_ DayHodMeRa)
{txt} 29{com}.         
.         qui renvars, presub(hospi_incid_y_025_ DayHoiLoRa) // "hospital_incidence"
{txt} 30{com}.         qui renvars, presub(hospi_incid_y_975_ DayHoiUpRa)
{txt} 31{com}.         qui renvars, presub(hospi_incid_y_mea_ DayHoiMeRa)
{txt} 32{com}.         
.         qui renvars, presub(preval______y_025_ DayPreLoRa) // "prevalence"
{txt} 33{com}.         qui renvars, presub(preval______y_975_ DayPreUpRa)
{txt} 34{com}.         qui renvars, presub(preval______y_mea_ DayPreMeRa)
{txt} 35{com}.         
.         qui renvars, postsub(S1 A03S01) 
{txt} 36{com}.         qui renvars, postsub(S2 A03S02) 
{txt} 37{com}.         qui renvars, postsub(S3 A03S03) 
{txt} 38{com}.         qui renvars, postsub(S4 A03S04) 
{txt} 39{com}.         qui renvars, postsub(S5 A03S05) 
{txt} 40{com}.         qui renvars, postsub(S6 A03S06) 
{txt} 41{com}.         
.         * "Wait Note: renvars are working ..."
.         
. {c )-} 
{txt}
{com}. *   
. 
. 
. 
. *
. 
. drop year month day date2 dateblock
{txt}
{com}. 
. order date  
{txt}
{com}. 
. label var DayINFLoRaA03S01 "Daily infections Lower A03 S01 "
{txt}
{com}. label var DayINFLoRaA03S02 "Daily infections Lower A03 S02 "
{txt}
{com}. label var DayINFLoRaA03S03 "Daily infections Lower A03 S03 "
{txt}
{com}. label var DayINFLoRaA03S04 "Daily infections Lower A03 S04 "
{txt}
{com}. label var DayINFLoRaA03S05 "Daily infections Lower A03 S05 "
{txt}
{com}. label var DayINFLoRaA03S06 "Daily infections Lower A03 S06 "
{txt}
{com}. label var DayINFMeRaA03S01 "Daily infections Mean A03 S01 "
{txt}
{com}. label var DayINFMeRaA03S02 "Daily infections Mean A03 S02 "
{txt}
{com}. label var DayINFMeRaA03S03 "Daily infections Mean A03 S03 "
{txt}
{com}. label var DayINFMeRaA03S04 "Daily infections Mean A03 S04 "
{txt}
{com}. label var DayINFMeRaA03S05 "Daily infections Mean A03 S05 "
{txt}
{com}. label var DayINFMeRaA03S06 "Daily infections Mean A03 S06 "
{txt}
{com}. label var DayINFUpRaA03S01 "Daily infections Upper A03 S01 "
{txt}
{com}. label var DayINFUpRaA03S02 "Daily infections Upper A03 S02 "
{txt}
{com}. label var DayINFUpRaA03S03 "Daily infections Upper A03 S03 "
{txt}
{com}. label var DayINFUpRaA03S04 "Daily infections Upper A03 S04 "
{txt}
{com}. label var DayINFUpRaA03S05 "Daily infections Upper A03 S05 "
{txt}
{com}. label var DayINFUpRaA03S06 "Daily infections Upper A03 S06 "
{txt}
{com}. label var DayDeaLoRaA03S01 "Daily Deaths Lower A03 S01 "
{txt}
{com}. label var DayDeaLoRaA03S02 "Daily Deaths Lower A03 S02 "
{txt}
{com}. label var DayDeaLoRaA03S03 "Daily Deaths Lower A03 S03 "
{txt}
{com}. label var DayDeaLoRaA03S04 "Daily Deaths Lower A03 S04 "
{txt}
{com}. label var DayDeaLoRaA03S05 "Daily Deaths Lower A03 S05 "
{txt}
{com}. label var DayDeaLoRaA03S06 "Daily Deaths Lower A03 S06 "
{txt}
{com}. label var DayDeaMeRaA03S01 "Daily Deaths Mean A03 S01 "
{txt}
{com}. label var DayDeaMeRaA03S02 "Daily Deaths Mean A03 S02 "
{txt}
{com}. label var DayDeaMeRaA03S03 "Daily Deaths Mean A03 S03 "
{txt}
{com}. label var DayDeaMeRaA03S04 "Daily Deaths Mean A03 S04 "
{txt}
{com}. label var DayDeaMeRaA03S05 "Daily Deaths Mean A03 S05 "
{txt}
{com}. label var DayDeaMeRaA03S06 "Daily Deaths Mean A03 S06 "
{txt}
{com}. label var DayDeaUpRaA03S01 "Daily Deaths Upper A03 S01 "
{txt}
{com}. label var DayDeaUpRaA03S02 "Daily Deaths Upper A03 S02 "
{txt}
{com}. label var DayDeaUpRaA03S03 "Daily Deaths Upper A03 S03 "
{txt}
{com}. label var DayDeaUpRaA03S04 "Daily Deaths Upper A03 S04 "
{txt}
{com}. label var DayDeaUpRaA03S05 "Daily Deaths Upper A03 S05 "
{txt}
{com}. label var DayDeaUpRaA03S06 "Daily Deaths Upper A03 S06 "
{txt}
{com}. label var TotINFLoRaA03S01 "Total infections Lower A03 S01 "
{txt}
{com}. label var TotINFLoRaA03S02 "Total infections Lower A03 S02 "
{txt}
{com}. label var TotINFLoRaA03S03 "Total infections Lower A03 S03 "
{txt}
{com}. label var TotINFLoRaA03S04 "Total infections Lower A03 S04 "
{txt}
{com}. label var TotINFLoRaA03S05 "Total infections Lower A03 S05 "
{txt}
{com}. label var TotINFLoRaA03S06 "Total infections Lower A03 S06 "
{txt}
{com}. label var TotINFMeRaA03S01 "Total infections Mean A03 S01 "
{txt}
{com}. label var TotINFMeRaA03S02 "Total infections Mean A03 S02 "
{txt}
{com}. label var TotINFMeRaA03S03 "Total infections Mean A03 S03 "
{txt}
{com}. label var TotINFMeRaA03S04 "Total infections Mean A03 S04 "
{txt}
{com}. label var TotINFMeRaA03S05 "Total infections Mean A03 S05 "
{txt}
{com}. label var TotINFMeRaA03S06 "Total infections Mean A03 S06 "
{txt}
{com}. label var TotINFUpRaA03S01 "Total infections Upper A03 S01 "
{txt}
{com}. label var TotINFUpRaA03S02 "Total infections Upper A03 S02 "
{txt}
{com}. label var TotINFUpRaA03S03 "Total infections Upper A03 S03 "
{txt}
{com}. label var TotINFUpRaA03S04 "Total infections Upper A03 S04 "
{txt}
{com}. label var TotINFUpRaA03S05 "Total infections Upper A03 S05 "
{txt}
{com}. label var TotINFUpRaA03S06 "Total infections Upper A03 S06 "
{txt}
{com}. label var TotDeaLoRaA03S01 "Total Deaths Lower A03 S01 "
{txt}
{com}. label var TotDeaLoRaA03S02 "Total Deaths Lower A03 S02 "
{txt}
{com}. label var TotDeaLoRaA03S03 "Total Deaths Lower A03 S03 "
{txt}
{com}. label var TotDeaLoRaA03S04 "Total Deaths Lower A03 S04 "
{txt}
{com}. label var TotDeaLoRaA03S05 "Total Deaths Lower A03 S05 "
{txt}
{com}. label var TotDeaLoRaA03S06 "Total Deaths Lower A03 S06 "
{txt}
{com}. label var TotDeaMeRaA03S01 "Total Deaths Mean A03 S01 "
{txt}
{com}. label var TotDeaMeRaA03S02 "Total Deaths Mean A03 S02 "
{txt}
{com}. label var TotDeaMeRaA03S03 "Total Deaths Mean A03 S03 "
{txt}
{com}. label var TotDeaMeRaA03S04 "Total Deaths Mean A03 S04 "
{txt}
{com}. label var TotDeaMeRaA03S05 "Total Deaths Mean A03 S05 "
{txt}
{com}. label var TotDeaMeRaA03S06 "Total Deaths Mean A03 S06 "
{txt}
{com}. label var TotDeaUpRaA03S01 "Total Deaths Upper A03 S01 "
{txt}
{com}. label var TotDeaUpRaA03S02 "Total Deaths Upper A03 S02 "
{txt}
{com}. label var TotDeaUpRaA03S03 "Total Deaths Upper A03 S03 "
{txt}
{com}. label var TotDeaUpRaA03S04 "Total Deaths Upper A03 S04 "
{txt}
{com}. label var TotDeaUpRaA03S05 "Total Deaths Upper A03 S05 "
{txt}
{com}. label var TotDeaUpRaA03S06 "Total Deaths Upper A03 S06 "
{txt}
{com}. 
. 
. * other outcomes
. 
. label var DayHodMeRaA03S01 "Daily hospital demand Mean A03 S01 "
{txt}
{com}. label var DayHodLoRaA03S01 "Daily hospital demand Lower A03 S01 "
{txt}
{com}. label var DayHodUpRaA03S01 "Daily hospital demand Upper A03 S01 "
{txt}
{com}. label var DayHodMeRaA03S02 "Daily hospital demand Mean A03 S02 "
{txt}
{com}. label var DayHodLoRaA03S02 "Daily hospital demand Lower A03 S02 "
{txt}
{com}. label var DayHodUpRaA03S02 "Daily hospital demand Upper A03 S02 "
{txt}
{com}. label var DayHodMeRaA03S03 "Daily hospital demand Mean A03 S03 "
{txt}
{com}. label var DayHodLoRaA03S03 "Daily hospital demand Lower A03 S03 "
{txt}
{com}. label var DayHodUpRaA03S03 "Daily hospital demand Upper A03 S03 "
{txt}
{com}. label var DayHodMeRaA03S04 "Daily hospital demand Mean A03 S04 "
{txt}
{com}. label var DayHodLoRaA03S04 "Daily hospital demand Lower A03 S04 "
{txt}
{com}. label var DayHodUpRaA03S04 "Daily hospital demand Upper A03 S04 " 
{txt}
{com}. label var DayHodMeRaA03S05 "Daily hospital demand Mean A03 S05 "
{txt}
{com}. label var DayHodLoRaA03S05 "Daily hospital demand Lower A03 S05 "
{txt}
{com}. label var DayHodUpRaA03S05 "Daily hospital demand Upper A03 S05 "
{txt}
{com}. label var DayHodMeRaA03S06 "Daily hospital demand Mean A03 S06 "
{txt}
{com}. label var DayHodLoRaA03S06 "Daily hospital demand Lower A03 S06 "
{txt}
{com}. label var DayHodUpRaA03S06 "Daily hospital demand Upper A03 S06 "
{txt}
{com}. 
. label var DayHoiMeRaA03S01 "Daily hospital incidence Mean A03 S01 "
{txt}
{com}. label var DayHoiLoRaA03S01 "Daily hospital incidence Lower A03 S01 "
{txt}
{com}. label var DayHoiUpRaA03S01 "Daily hospital incidence Upper A03 S01 "
{txt}
{com}. label var DayHoiMeRaA03S02 "Daily hospital incidence Mean A03 S02 "
{txt}
{com}. label var DayHoiLoRaA03S02 "Daily hospital incidence Lower A03 S02 "
{txt}
{com}. label var DayHoiUpRaA03S02 "Daily hospital incidence Upper A03 S02 "
{txt}
{com}. label var DayHoiMeRaA03S03 "Daily hospital incidence Mean A03 S03 "
{txt}
{com}. label var DayHoiLoRaA03S03 "Daily hospital incidence Lower A03 S03 "
{txt}
{com}. label var DayHoiUpRaA03S03 "Daily hospital incidence Upper A03 S03 "
{txt}
{com}. label var DayHoiMeRaA03S04 "Daily hospital incidence Mean A03 S04 "
{txt}
{com}. label var DayHoiLoRaA03S04 "Daily hospital incidence Lower A03 S04 "
{txt}
{com}. label var DayHoiUpRaA03S04 "Daily hospital incidence Upper A03 S04 "
{txt}
{com}. label var DayHoiMeRaA03S05 "Daily hospital incidence Mean A03 S05 "
{txt}
{com}. label var DayHoiLoRaA03S05 "Daily hospital incidence Lower A03 S05 "
{txt}
{com}. label var DayHoiUpRaA03S05 "Daily hospital incidence Upper A03 S05 "
{txt}
{com}. label var DayHoiMeRaA03S06 "Daily hospital incidence Mean A03 S06 "
{txt}
{com}. label var DayHoiLoRaA03S06 "Daily hospital incidence Lower A03 S06 "
{txt}
{com}. label var DayHoiUpRaA03S06 "Daily hospital incidence Upper A03 S06 "
{txt}
{com}. 
. label var DayIcdMeRaA03S01 "Daily ICU demand Mean A03 S01 "
{txt}
{com}. label var DayIcdLoRaA03S01 "Daily ICU demand Lower A03 S01 "
{txt}
{com}. label var DayIcdUpRaA03S01 "Daily ICU demand Upper A03 S01 "
{txt}
{com}. label var DayIcdMeRaA03S02 "Daily ICU demand Mean A03 S02 "
{txt}
{com}. label var DayIcdLoRaA03S02 "Daily ICU demand Lower A03 S02 "
{txt}
{com}. label var DayIcdUpRaA03S02 "Daily ICU demand Upper A03 S02 "
{txt}
{com}. label var DayIcdMeRaA03S03 "Daily ICU demand Mean A03 S03 "
{txt}
{com}. label var DayIcdLoRaA03S03 "Daily ICU demand Lower A03 S03 "
{txt}
{com}. label var DayIcdUpRaA03S03 "Daily ICU demand Upper A03 S03 "
{txt}
{com}. label var DayIcdMeRaA03S04 "Daily ICU demand Mean A03 S04 "
{txt}
{com}. label var DayIcdLoRaA03S04 "Daily ICU demand Lower A03 S04 "
{txt}
{com}. label var DayIcdUpRaA03S04 "Daily ICU demand Upper A03 S04 "
{txt}
{com}. label var DayIcdMeRaA03S05 "Daily ICU demand Mean A03 S05 "
{txt}
{com}. label var DayIcdLoRaA03S05 "Daily ICU demand Lower A03 S05 "
{txt}
{com}. label var DayIcdUpRaA03S05 "Daily ICU demand Upper A03 S05 "
{txt}
{com}. label var DayIcdMeRaA03S06 "Daily ICU demand Mean A03 S06 "
{txt}
{com}. label var DayIcdLoRaA03S06 "Daily ICU demand Lower A03 S06 "
{txt}
{com}. label var DayIcdUpRaA03S06 "Daily ICU demand Upper A03 S06 "
{txt}
{com}. 
. label var DayIciMeRaA03S01 "Daily ICU incidence Mean A03 S01 "
{txt}
{com}. label var DayIciLoRaA03S01 "Daily ICU incidence Lower A03 S01 "
{txt}
{com}. label var DayIciUpRaA03S01 "Daily ICU incidence Upper A03 S01 "
{txt}
{com}. label var DayIciMeRaA03S02 "Daily ICU incidence Mean A03 S02 "
{txt}
{com}. label var DayIciLoRaA03S02 "Daily ICU incidence Lower A03 S02 "
{txt}
{com}. label var DayIciUpRaA03S02 "Daily ICU incidence Upper A03 S02 "
{txt}
{com}. label var DayIciMeRaA03S03 "Daily ICU incidence Mean A03 S03 "
{txt}
{com}. label var DayIciLoRaA03S03 "Daily ICU incidence Lower A03 S03 "
{txt}
{com}. label var DayIciUpRaA03S03 "Daily ICU incidence Upper A03 S03 "
{txt}
{com}. label var DayIciMeRaA03S04 "Daily ICU incidence Mean A03 S04 "
{txt}
{com}. label var DayIciLoRaA03S04 "Daily ICU incidence Lower A03 S04 "
{txt}
{com}. label var DayIciUpRaA03S04 "Daily ICU incidence Upper A03 S04 "
{txt}
{com}. label var DayIciMeRaA03S05 "Daily ICU incidence Mean A03 S05 "
{txt}
{com}. label var DayIciLoRaA03S05 "Daily ICU incidence Lower A03 S05 "
{txt}
{com}. label var DayIciUpRaA03S05 "Daily ICU incidence Upper A03 S05 "
{txt}
{com}. label var DayIciMeRaA03S06 "Daily ICU incidence Mean A03 S06 "
{txt}
{com}. label var DayIciLoRaA03S06 "Daily ICU incidence Lower A03 S06 "
{txt}
{com}. label var DayIciUpRaA03S06 "Daily ICU incidence Upper A03 S06 "
{txt}
{com}. 
. label var DayPreMeRaA03S01 "Daily prevalence Mean A03 S01 "
{txt}
{com}. label var DayPreLoRaA03S01 "Daily prevalence Lower A03 S01 "
{txt}
{com}. label var DayPreUpRaA03S01 "Daily prevalence Upper A03 S01 "
{txt}
{com}. label var DayPreMeRaA03S02 "Daily prevalence Mean A03 S02 "
{txt}
{com}. label var DayPreLoRaA03S02 "Daily prevalence Lower A03 S02 "
{txt}
{com}. label var DayPreUpRaA03S02 "Daily prevalence Upper A03 S02 "
{txt}
{com}. label var DayPreMeRaA03S03 "Daily prevalence Mean A03 S03 "
{txt}
{com}. label var DayPreLoRaA03S03 "Daily prevalence Lower A03 S03 "
{txt}
{com}. label var DayPreUpRaA03S03 "Daily prevalence Upper A03 S03 "
{txt}
{com}. label var DayPreMeRaA03S04 "Daily prevalence Mean A03 S04 "
{txt}
{com}. label var DayPreLoRaA03S04 "Daily prevalence Lower A03 S04 "
{txt}
{com}. label var DayPreUpRaA03S04 "Daily prevalence Upper A03 S04 "
{txt}
{com}. label var DayPreMeRaA03S05 "Daily prevalence Mean A03 S05 "
{txt}
{com}. label var DayPreLoRaA03S05 "Daily prevalence Lower A03 S05 "
{txt}
{com}. label var DayPreUpRaA03S05 "Daily prevalence Upper A03 S05 "
{txt}
{com}. label var DayPreMeRaA03S06 "Daily prevalence Mean A03 S06 "
{txt}
{com}. label var DayPreLoRaA03S06 "Daily prevalence Lower A03 S06 "
{txt}
{com}. label var DayPreUpRaA03S06 "Daily prevalence Upper A03 S06 "
{txt}
{com}. 
. label var DayRefMeRaA03S01 "Daily R effective Mean A03 S01 "
{txt}
{com}. label var DayRefLoRaA03S01 "Daily R effective Lower A03 S01 "
{txt}
{com}. label var DayRefUpRaA03S01 "Daily R effective Upper A03 S01 "
{txt}
{com}. label var DayRefMeRaA03S02 "Daily R effective Mean A03 S02 "
{txt}
{com}. label var DayRefLoRaA03S02 "Daily R effective Lower A03 S02 "
{txt}
{com}. label var DayRefUpRaA03S02 "Daily R effective Upper A03 S02 "
{txt}
{com}. label var DayRefMeRaA03S03 "Daily R effective Mean A03 S03 "
{txt}
{com}. label var DayRefLoRaA03S03 "Daily R effective Lower A03 S03 "
{txt}
{com}. label var DayRefUpRaA03S03 "Daily R effective Upper A03 S03 "
{txt}
{com}. label var DayRefMeRaA03S04 "Daily R effective Mean A03 S04 "
{txt}
{com}. label var DayRefLoRaA03S04 "Daily R effective Lower A03 S04 "
{txt}
{com}. label var DayRefUpRaA03S04 "Daily R effective Upper A03 S04 "
{txt}
{com}. label var DayRefMeRaA03S05 "Daily R effective Mean A03 S05 "
{txt}
{com}. label var DayRefLoRaA03S05 "Daily R effective Lower A03 S05 "
{txt}
{com}. label var DayRefUpRaA03S05 "Daily R effective Upper A03 S05 "
{txt}
{com}. label var DayRefMeRaA03S06 "Daily R effective Mean A03 S06 "
{txt}
{com}. label var DayRefLoRaA03S06 "Daily R effective Lower A03 S06 "
{txt}
{com}. label var DayRefUpRaA03S06 "Daily R effective Upper A03 S06 "
{txt}
{com}. 
. label var DayRttMeRaA03S01 "Daily R t Mean A03 S01 "
{txt}
{com}. label var DayRttLoRaA03S01 "Daily R t Lower A03 S01 "
{txt}
{com}. label var DayRttUpRaA03S01 "Daily R t Upper A03 S01 "
{txt}
{com}. label var DayRttMeRaA03S02 "Daily R t Mean A03 S02 "
{txt}
{com}. label var DayRttLoRaA03S02 "Daily R t Lower A03 S02 "
{txt}
{com}. label var DayRttUpRaA03S02 "Daily R t Upper A03 S02 "
{txt}
{com}. label var DayRttMeRaA03S03 "Daily R t Mean A03 S03 "
{txt}
{com}. label var DayRttLoRaA03S03 "Daily R t Lower A03 S03 "
{txt}
{com}. label var DayRttUpRaA03S03 "Daily R t Upper A03 S03 "
{txt}
{com}. label var DayRttMeRaA03S04 "Daily R t Mean A03 S04 "
{txt}
{com}. label var DayRttLoRaA03S04 "Daily R t Lower A03 S04 "
{txt}
{com}. label var DayRttUpRaA03S04 "Daily R t Upper A03 S04 "
{txt}
{com}. label var DayRttMeRaA03S05 "Daily R t Mean A03 S05 "
{txt}
{com}. label var DayRttLoRaA03S05 "Daily R t Lower A03 S05 "
{txt}
{com}. label var DayRttUpRaA03S05 "Daily R t Upper A03 S05 "
{txt}
{com}. label var DayRttMeRaA03S06 "Daily R t Mean A03 S06 "
{txt}
{com}. label var DayRttLoRaA03S06 "Daily R t Lower A03 S06 "
{txt}
{com}. label var DayRttUpRaA03S06 "Daily R t Upper A03 S06 "
{txt}
{com}. 
. 
. rename country loc_grand_name
{res}{txt}
{com}. 
. 
. 
. order ///
> loc_grand_name date     ///
> TotDeaMeRaA03S01        TotDeaLoRaA03S01        TotDeaUpRaA03S01        ///
> TotDeaMeRaA03S02        TotDeaLoRaA03S02        TotDeaUpRaA03S02        ///
> TotDeaMeRaA03S03        TotDeaLoRaA03S03        TotDeaUpRaA03S03        ///
> TotDeaMeRaA03S04        TotDeaLoRaA03S04        TotDeaUpRaA03S04        ///
> TotDeaMeRaA03S05        TotDeaLoRaA03S05        TotDeaUpRaA03S05        ///
> TotDeaMeRaA03S06        TotDeaLoRaA03S06        TotDeaUpRaA03S06        ///
> DayDeaMeRaA03S01        DayDeaLoRaA03S01        DayDeaUpRaA03S01        ///
> DayDeaMeRaA03S02        DayDeaLoRaA03S02        DayDeaUpRaA03S02        ///
> DayDeaMeRaA03S03        DayDeaLoRaA03S03        DayDeaUpRaA03S03        ///
> DayDeaMeRaA03S04        DayDeaLoRaA03S04        DayDeaUpRaA03S04        ///
> DayDeaMeRaA03S05        DayDeaLoRaA03S05        DayDeaUpRaA03S05        ///
> DayDeaMeRaA03S06        DayDeaLoRaA03S06        DayDeaUpRaA03S06        ///
> TotINFMeRaA03S01        TotINFLoRaA03S01        TotINFUpRaA03S01        ///
> TotINFMeRaA03S02        TotINFLoRaA03S02        TotINFUpRaA03S02        ///
> TotINFMeRaA03S03        TotINFLoRaA03S03        TotINFUpRaA03S03        ///
> TotINFMeRaA03S04        TotINFLoRaA03S04        TotINFUpRaA03S04        ///
> TotINFMeRaA03S05        TotINFLoRaA03S05        TotINFUpRaA03S05        ///
> TotINFMeRaA03S06        TotINFLoRaA03S06        TotINFUpRaA03S06        ///
> DayINFMeRaA03S01        DayINFLoRaA03S01        DayINFUpRaA03S01        ///
> DayINFMeRaA03S02        DayINFLoRaA03S02        DayINFUpRaA03S02        ///
> DayINFMeRaA03S03        DayINFLoRaA03S03        DayINFUpRaA03S03        ///
> DayINFMeRaA03S04        DayINFLoRaA03S04        DayINFUpRaA03S04        ///
> DayINFMeRaA03S05        DayINFLoRaA03S05        DayINFUpRaA03S05        ///
> DayINFMeRaA03S06        DayINFLoRaA03S06        DayINFUpRaA03S06
{txt}
{com}. 
. 
.  *
.  
.  
. * gen IFR
. 
. gen DayIFRMeRaA03S01 = 100 * DayDeaMeRaA03S01 / DayINFMeRaA03S01 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S01 = 100 * DayDeaLoRaA03S01 / DayINFLoRaA03S01 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S01 = 100 * DayDeaUpRaA03S01 / DayINFUpRaA03S01 
{txt}(1 missing value generated)

{com}. gen DayIFRMeRaA03S02 = 100 * DayDeaMeRaA03S02 / DayINFMeRaA03S02 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S02 = 100 * DayDeaLoRaA03S02 / DayINFLoRaA03S02 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S02 = 100 * DayDeaUpRaA03S02 / DayINFUpRaA03S02 
{txt}(1 missing value generated)

{com}. gen DayIFRMeRaA03S03 = 100 * DayDeaMeRaA03S03 / DayINFMeRaA03S03 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S03 = 100 * DayDeaLoRaA03S03 / DayINFLoRaA03S03 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S03 = 100 * DayDeaUpRaA03S03 / DayINFUpRaA03S03 
{txt}(1 missing value generated)

{com}. gen DayIFRMeRaA03S04 = 100 * DayDeaMeRaA03S04 / DayINFMeRaA03S04 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S04 = 100 * DayDeaLoRaA03S04 / DayINFLoRaA03S04 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S04 = 100 * DayDeaUpRaA03S04 / DayINFUpRaA03S04 
{txt}(1 missing value generated)

{com}. gen DayIFRMeRaA03S05 = 100 * DayDeaMeRaA03S05 / DayINFMeRaA03S05 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S05 = 100 * DayDeaLoRaA03S05 / DayINFLoRaA03S05 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S05 = 100 * DayDeaUpRaA03S05 / DayINFUpRaA03S05 
{txt}(1 missing value generated)

{com}. gen DayIFRMeRaA03S06 = 100 * DayDeaMeRaA03S06 / DayINFMeRaA03S06 
{txt}(1 missing value generated)

{com}. gen DayIFRLoRaA03S06 = 100 * DayDeaLoRaA03S06 / DayINFLoRaA03S06 
{txt}(1 missing value generated)

{com}. gen DayIFRUpRaA03S06 = 100 * DayDeaUpRaA03S06 / DayINFUpRaA03S06 
{txt}(1 missing value generated)

{com}. 
. label var DayIFRMeRaA03S01 "Daily IFR Mean A03 S01 "
{txt}
{com}. label var DayIFRLoRaA03S01 "Daily IFR Lower A03 S01 "
{txt}
{com}. label var DayIFRUpRaA03S01 "Daily IFR Upper A03 S01 "
{txt}
{com}. label var DayIFRMeRaA03S02 "Daily IFR Mean A03 S02 "
{txt}
{com}. label var DayIFRLoRaA03S02 "Daily IFR Lower A03 S02 "
{txt}
{com}. label var DayIFRUpRaA03S02 "Daily IFR Upper A03 S02 "
{txt}
{com}. label var DayIFRMeRaA03S03 "Daily IFR Mean A03 S03 "
{txt}
{com}. label var DayIFRLoRaA03S03 "Daily IFR Lower A03 S03 "
{txt}
{com}. label var DayIFRUpRaA03S03 "Daily IFR Upper A03 S03 "
{txt}
{com}. label var DayIFRMeRaA03S04 "Daily IFR Mean A03 S04 "
{txt}
{com}. label var DayIFRLoRaA03S04 "Daily IFR Lower A03 S04 "
{txt}
{com}. label var DayIFRUpRaA03S04 "Daily IFR Upper A03 S04 "
{txt}
{com}. label var DayIFRMeRaA03S05 "Daily IFR Mean A03 S05 "
{txt}
{com}. label var DayIFRLoRaA03S05 "Daily IFR Lower A03 S05 "
{txt}
{com}. label var DayIFRUpRaA03S05 "Daily IFR Upper A03 S05 "
{txt}
{com}. label var DayIFRMeRaA03S06 "Daily IFR Mean A03 S06 "
{txt}
{com}. label var DayIFRLoRaA03S06 "Daily IFR Lower A03 S06 "
{txt}
{com}. label var DayIFRUpRaA03S06 "Daily IFR Upper A03 S06 "
{txt}
{com}. 
. 
. 
. 
. 
. * gen "Daily infections mean div by daily deaths mean IMPE DayCbD" for visulization of temporal relation of deaths and infections peaks 
. 
. 
. summ DayDeaMeRaA03S02 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDeaMeR~02 {c |}{res}        834    207.9394    232.2138          0    1019.31
{txt}
{com}. gen DayDeMMeRaA03S02 = r(mean)
{txt}
{com}. label var DayDeMMeRaA03S02 "Daily deaths mean IMPE DayDeM"
{txt}
{com}. 
. summ DayINFMeRaA03S02 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayINFMeR~02 {c |}{res}        834     89167.1    100745.2         .2   383799.7
{txt}
{com}. gen DayCaMMeRaA03S02 = r(mean)
{txt}
{com}. label var DayCaMMeRaA03S02 "Daily infections mean IMPE DayCaM"
{txt}
{com}.                            
. gen DayCbDMeRaA03S02 = DayCaMMeRaA03S02 / DayDeMMeRaA03S02
{txt}
{com}. label var DayCbDMeRaA03S02 "Daily infections mean div by daily deaths mean IMPE DayCbD"
{txt}
{com}. summ DayCbDMeRaA03S02

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayCbDMeR~02 {c |}{res}        835     428.813           0    428.813    428.813
{txt}
{com}.                                               
. gen DayDMuMeRaA03S02 = DayDeaMeRaA03S02 * DayCbDMeRaA03S02
{txt}(1 missing value generated)

{com}. label var DayDMuMeRaA03S02 "Daily deaths scaled (times means of infections by deaths) IMPE"
{txt}
{com}. summ DayDMuMeRaA03S02

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
DayDMuMeR~02 {c |}{res}        834     89167.1    99576.28          0   437093.4
{txt}
{com}. 
. 
. 
. 
. 
. sort date loc_grand_name
{txt}
{com}. 
. order date loc_grand_name
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "IMPE WPRO.dta", replace
{txt}file IMPE WPRO.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. view "log CovidVisualizedGlobal IMPE 1.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/CovidVisualizedGlobal-main/20220104/code/IMPE/log CovidVisualizedGlobal IMPE 1.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 5 Jan 2022, 17:40:08
{txt}{.-}
{smcl}
{txt}{sf}{ul off}